damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/*
 * Copyright (c) 2009-2018 ARM Limited. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     CW32L012.h
 * @brief    CMSIS HeaderFile
 * @version  1.2
 * @date     Wed Jul 30 11:20:43 2025
 * @note     Generated by SVDConv V3.3.46
 *           from File 'cw32l012.svd',
 *           last modified on Wed Jul 30 11:20:28 2025
 */


/** @addtogroup Wuhan Xinyuan Semiconductor Co.Ltd
  * @{
  */


/** @addtogroup CW32L012
  * @{
  */


#ifndef __CW32L012_H
#define __CW32L012_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M0+ Specific Interrupt Numbers  ======================================= */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  cw32l012 Specific Interrupt Numbers  ========================================== */
  WDT_IRQn                  =   0,              /*!< 0  Watch Dog Timer Interrupt                                              */
  LVD_IRQn                  =   1,              /*!< 1  Low Voltage Detect Interrupt                                           */
  RTC_IRQn                  =   2,              /*!< 2  Real Time Clock Interrupt                                              */
  FLASHRAM_IRQn             =   3,              /*!< 3  Flash/RAM Interrupt                                                    */
  SYSCTRL_IRQn              =   4,              /*!< 4  SYSCTRL Interupt                                                       */
  GPIOA_IRQn                =   5,              /*!< 5  GPIOA Interrupt                                                        */
  GPIOB_IRQn                =   6,              /*!< 6  GPIOB Interrupt                                                        */
  GPIOC_IRQn                =   7,              /*!< 7  GPIOC Interrupt                                                        */
  GPIOF_IRQn                =   8,              /*!< 8  GPIOF Interrupt                                                        */
  DMACH12_IRQn              =   9,              /*!< 9  DMA Channel 1/2 Interrupt                                              */
  DMACH34_IRQn              =  10,              /*!< 10 DMA Channel 3/4 Interrupt                                              */
  CORDIC_IRQn               =  11,              /*!< 11 desc CORDIC                                                            */
  ADC1_IRQn                 =  12,              /*!< 12 ADC Interrupt                                                          */
  ATIM_IRQn                 =  13,              /*!< 13 Advanced Timer Interrupt                                               */
  VC13_IRQn                 =  14,              /*!< 14 Voltage Comparator 1/3 Interrupt                                       */
  VC24_IRQn                 =  15,              /*!< 15 Voltage Comparator 2/4 Interrupt                                       */
  GTIM1_IRQn                =  16,              /*!< 16 General Timer1 Interrupt                                               */
  GTIM2_IRQn                =  17,              /*!< 17 General Timer1 Interrupt                                               */
  GTIM34_IRQn               =  18,              /*!< 18 General Timer3_4 Interrupt                                             */
  LPTIM_IRQn                =  19,              /*!< 19 LPTIM Interrupt                                                        */
  BTIM1_IRQn                =  20,              /*!< 20 Base Timer1 Interrupt                                                  */
  BTIM2_IRQn                =  21,              /*!< 21 Base Timer2 Interrupt                                                  */
  BTIM3_HALLTIM_IRQn        =  22,              /*!< 22 Base Timer3 and Hall timer Interrupt                                   */
  I2C1_IRQn                 =  23,              /*!< 23 I2C1 Interrupt                                                         */
  I2C2_IRQn                 =  24,              /*!< 24 I2C2 Interrupt                                                         */
  SPI1_IRQn                 =  25,              /*!< 25 SPI1 Interrupt                                                         */
  SPI23_IRQn                =  26,              /*!< 26 SPI23 Interrupt                                                        */
  UART1_IRQn                =  27,              /*!< 27 UART1 Interrupt                                                        */
  UART2_IRQn                =  28,              /*!< 28 UART2 Interrupt                                                        */
  UART3_IRQn                =  29,              /*!< 29 UART3 Interrupt                                                        */
  ADC2_DAC_IRQn             =  30,              /*!< 30 ADC2 and DAC Interrupt                                                 */
  CLKFAULT_IRQn             =  31               /*!< 31 Clock Fault Interrupt                                                  */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

