damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* ==========================  Configuration of the ARM Cortex-M0+ Processor and Core Peripherals  =========================== */
#define __CM0PLUS_REV                 0x0001U   /*!< CM0PLUS Core Revision                                                     */
#define __NVIC_PRIO_BITS               2        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 0        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __MPU_PRESENT                  0        /*!< MPU present                                                               */
#define __FPU_PRESENT                  0        /*!< FPU present                                                               */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0plus.h"                       /*!< ARM Cortex-M0+ processor and core peripherals                             */
#include "system_cw32l012.h"                    /*!< cw32l012 System                                                           */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           ADC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc ADC1 (ADC1)
  */

typedef struct {                                /*!< (@ 0x40000000) ADC1 Structure                                             */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) desc CR                                                    */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t CONT       : 1;            /*!< [1..1] desc CONT                                                          */
      __IOM uint32_t CLK        : 2;            /*!< [3..2] desc CLK                                                           */
      __IOM uint32_t ENS        : 3;            /*!< [6..4] desc ENS                                                           */
      __IOM uint32_t SLAVE      : 1;            /*!< [7..7] desc SLAVE                                                         */      
    } CR_f;
  } ;
  
  union {
    __IOM uint32_t START;                       /*!< (@ 0x00000004) desc START                                                 */
    
    struct {
      __IOM uint32_t START      : 1;            /*!< [0..0] desc START                                                         */
    } START_f;
  } ;
  
  union {
    __IOM uint32_t AWDTR;                       /*!< (@ 0x00000008) desc AWDTR                                                 */
    
    struct {
      __IOM uint32_t VTL        : 12;           /*!< [11..0] desc VTL                                                          */
      __IM  uint32_t            : 4;
      __IOM uint32_t VTH        : 12;           /*!< [27..16] desc VTH                                                         */
    } AWDTR_f;
  } ;
  
  union {
    __IOM uint32_t AWDCR;                       /*!< (@ 0x0000000C) desc AWDCR                                                 */
    
    struct {
      __IOM uint32_t IN0        : 1;            /*!< [0..0] desc IN0                                                           */
      __IOM uint32_t IN1        : 1;            /*!< [1..1] desc IN1                                                           */
      __IOM uint32_t IN2        : 1;            /*!< [2..2] desc IN2                                                           */
      __IOM uint32_t IN3        : 1;            /*!< [3..3] desc IN3                                                           */
      __IOM uint32_t IN4        : 1;            /*!< [4..4] desc IN4                                                           */
      __IOM uint32_t IN5        : 1;            /*!< [5..5] desc IN5                                                           */
      __IOM uint32_t IN6        : 1;            /*!< [6..6] desc IN6                                                           */
      __IOM uint32_t IN7        : 1;            /*!< [7..7] desc IN7                                                           */
      __IOM uint32_t IN8        : 1;            /*!< [8..8] desc IN8                                                           */
      __IOM uint32_t IN9        : 1;            /*!< [9..9] desc IN9                                                           */
      __IOM uint32_t IN10       : 1;            /*!< [10..10] desc IN10                                                        */
      __IOM uint32_t IN11       : 1;            /*!< [11..11] desc IN11                                                        */
      __IOM uint32_t IN12       : 1;            /*!< [12..12] desc IN12                                                        */
      __IOM uint32_t IN13       : 1;            /*!< [13..13] desc IN13                                                        */
      __IOM uint32_t IN14       : 1;            /*!< [14..14] desc IN14                                                        */
      __IOM uint32_t IN15       : 1;            /*!< [15..15] desc IN15                                                        */
    } AWDCR_f;
  } ;
  
  union {
    __IOM uint32_t TRIGGER;                     /*!< (@ 0x00000010) desc TRIGGER                                               */
    
