damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t ATIMTRGO   : 1;            /*!< [0..0] desc ATIMTRGO                                                      */
      __IOM uint32_t ATIMTRGO2  : 1;            /*!< [1..1] desc ATIMTRGO2                                                     */
      __IOM uint32_t ATIMOC1REFC : 1;           /*!< [2..2] desc ATIMOC1REFC                                                   */
      __IOM uint32_t ATIMOC2REFC : 1;           /*!< [3..3] desc ATIMOC2REFC                                                   */
      __IOM uint32_t ATIMOC3REFC : 1;           /*!< [4..4] desc ATIMOC3REFC                                                   */
      __IOM uint32_t ATIMOC4REFC : 1;           /*!< [5..5] desc ATIMOC4REFC                                                   */
      __IOM uint32_t ATIMOC5REFC : 1;           /*!< [6..6] desc ATIMOC5REFC                                                   */
      __IOM uint32_t ATIMOC6REFC : 1;           /*!< [7..7] desc ATIMOC6REFC                                                   */
      __IOM uint32_t GTIM1TRGO  : 1;            /*!< [8..8] desc GTIM1TRGO                                                     */
      __IOM uint32_t GTIM1OC1REFC : 1;          /*!< [9..9] desc GTIM1OC1REFC                                                  */
      __IOM uint32_t GTIM1OC2REFC : 1;          /*!< [10..10] desc GTIM1OC2REFC                                                */
      __IOM uint32_t GTIM1OC3REFC : 1;          /*!< [11..11] desc GTIM1OC3REFC                                                */
      __IOM uint32_t GTIM1OC4REFC : 1;          /*!< [12..12] desc GTIM1OC4REFC                                                */
      __IOM uint32_t GTIM2TRGO  : 1;            /*!< [13..13] desc GTIM2TRGO                                                   */
      __IOM uint32_t GTIM2OC1REFC : 1;          /*!< [14..14] desc GTIM2OC1REFC                                                */
      __IOM uint32_t GTIM2OC2REFC : 1;          /*!< [15..15] desc GTIM2OC2REFC                                                */
      __IOM uint32_t GTIM2OC3REFC : 1;          /*!< [16..16] desc GTIM2OC3REFC                                                */
      __IOM uint32_t GTIM2OC4REFC : 1;          /*!< [17..17] desc GTIM2OC4REFC                                                */
      __IOM uint32_t GTIM3TRGO  : 1;            /*!< [18..18] desc GTIM3TRGO                                                   */
      __IOM uint32_t GTIM3OC1REFC : 1;          /*!< [19..19] desc GTIM3OC1REFC                                                */
      __IOM uint32_t GTIM3OC2REFC : 1;          /*!< [20..20] desc GTIM3OC2REFC                                                */
      __IOM uint32_t GTIM3OC3REFC : 1;          /*!< [21..21] desc GTIM3OC3REFC                                                */
      __IOM uint32_t GTIM3OC4REFC : 1;          /*!< [22..22] desc GTIM3OC4REFC                                                */
      __IOM uint32_t GTIM4TRGO  : 1;            /*!< [23..23] desc GTIM4TRGO                                                   */
      __IOM uint32_t GTIM4OC1REFC : 1;          /*!< [24..24] desc GTIM4OC1REFC                                                */
      __IOM uint32_t GTIM4OC2REFC : 1;          /*!< [25..25] desc GTIM4OC2REFC                                                */
      __IOM uint32_t GTIM4OC3REFC : 1;          /*!< [26..26] desc GTIM4OC3REFC                                                */
      __IOM uint32_t GTIM4OC4REFC : 1;          /*!< [27..27] desc GTIM4OC4REFC                                                */
      __IOM uint32_t BTIM1TRGO  : 1;            /*!< [28..28] desc BTIM1TRGO                                                   */
      __IOM uint32_t BTIM2TRGO  : 1;            /*!< [29..29] desc BTIM2TRGO                                                   */
      __IOM uint32_t BTIM3TRGO  : 1;            /*!< [30..30] desc BTIM3TRGO                                                   */
      __IOM uint32_t HALLTIMTRGO : 1;           /*!< [31..31] desc HALLTIMTRGO                                                 */
    } TRIGGER_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t SAMPLE;                      /*!< (@ 0x00000018) desc SAMPLE                                                */
    
    struct {
      __IOM uint32_t SQRCH0     : 4;            /*!< [3..0] desc SQRCH0                                                        */
      __IOM uint32_t SQRCH1     : 4;            /*!< [7..4] desc SQRCH1                                                        */
      __IOM uint32_t SQRCH2     : 4;            /*!< [11..8] desc SQRCH2                                                       */
      __IOM uint32_t SQRCH3     : 4;            /*!< [15..12] desc SQRCH3                                                      */
      __IOM uint32_t SQRCH4     : 4;            /*!< [19..16] desc SQRCH4                                                      */
      __IOM uint32_t SQRCH5     : 4;            /*!< [23..20] desc SQRCH5                                                      */
      __IOM uint32_t SQRCH6     : 4;            /*!< [27..24] desc SQRCH6                                                      */
      __IOM uint32_t SQRCH7     : 4;            /*!< [31..28] desc SQRCH7                                                      */
    } SAMPLE_f;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t SQRCFR;                      /*!< (@ 0x00000020) desc SQRCFR                                                */
    
    struct {
      __IOM uint32_t SQRCH0     : 4;            /*!< [3..0] desc SQRCH0                                                        */
      __IOM uint32_t SQRCH1     : 4;            /*!< [7..4] desc SQRCH1                                                        */
      __IOM uint32_t SQRCH2     : 4;            /*!< [11..8] desc SQRCH2                                                       */
      __IOM uint32_t SQRCH3     : 4;            /*!< [15..12] desc SQRCH3                                                      */
      __IOM uint32_t SQRCH4     : 4;            /*!< [19..16] desc SQRCH4                                                      */
      __IOM uint32_t SQRCH5     : 4;            /*!< [23..20] desc SQRCH5                                                      */
      __IOM uint32_t SQRCH6     : 4;            /*!< [27..24] desc SQRCH6                                                      */
      __IOM uint32_t SQRCH7     : 4;            /*!< [31..28] desc SQRCH7                                                      */
    } SQRCFR_f;
  } ;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IM  uint32_t RESULT0;                     /*!< (@ 0x00000030) desc RESULT0                                               */
    
