damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [15..0] desc RESULT                                                       */
    } RESULT0_f;
  } ;
  
  union {
    __IM  uint32_t RESULT1;                     /*!< (@ 0x00000034) desc RESULT1                                               */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [15..0] desc RESULT                                                       */
    } RESULT1_f;
  } ;
  
  union {
    __IM  uint32_t RESULT2;                     /*!< (@ 0x00000038) desc RESULT2                                               */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [15..0] desc RESULT                                                       */
    } RESULT2_f;
  } ;
  
  union {
    __IM  uint32_t RESULT3;                     /*!< (@ 0x0000003C) desc RESULT3                                               */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [15..0] desc RESULT                                                       */
    } RESULT3_f;
  } ;
  
  union {
    __IM  uint32_t RESULT4;                     /*!< (@ 0x00000040) desc RESULT4                                               */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [15..0] desc RESULT                                                       */
    } RESULT4_f;
  } ;
  
  union {
    __IM  uint32_t RESULT5;                     /*!< (@ 0x00000044) desc RESULT5                                               */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [15..0] desc RESULT                                                       */
    } RESULT5_f;
  } ;
  
  union {
    __IM  uint32_t RESULT6;                     /*!< (@ 0x00000048) desc RESULT6                                               */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [15..0] desc RESULT                                                       */
    } RESULT6_f;
  } ;
  
  union {
    __IM  uint32_t RESULT7;                     /*!< (@ 0x0000004C) desc RESULT7                                               */
    
    struct {
      __IM  uint32_t RESULT     : 12;           /*!< [15..0] desc RESULT                                                       */
    } RESULT7_f;
  } ;
  __IM  uint32_t  RESERVED3[8];
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000070) desc IER                                                   */
    
    struct {
      __IOM uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
      __IOM uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t AWDL       : 1;            /*!< [3..3] desc AWDL                                                          */
      __IOM uint32_t AWDH       : 1;            /*!< [4..4] desc AWDH                                                          */
      __IOM uint32_t DMAEOC     : 1;            /*!< [5..5] desc DMAEOC                                                        */
      __IOM uint32_t DMAEOS     : 1;            /*!< [6..6] desc DMAEOS                                                        */
    } IER_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000074) desc ICR                                                   */
    
    struct {
      __IOM uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
      __IOM uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t AWDL       : 1;            /*!< [3..3] desc AWDL                                                          */
      __IOM uint32_t AWDH       : 1;            /*!< [4..4] desc AWDH                                                          */
    } ICR_f;
  } ;
  
  union {
    __IOM uint32_t ISR;                         /*!< (@ 0x00000078) desc ISR                                                   */
    
    struct {
      __IM  uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
      __IM  uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
      __IM  uint32_t            : 1;
      __IM  uint32_t AWDL       : 1;            /*!< [3..3] desc AWDL                                                          */
      __IOM uint32_t AWDH       : 1;            /*!< [4..4] desc AWDH                                                          */
    } ISR_f;
  } ;
} ADC_TypeDef;                                     /*!< Size = 124 (0x7c)                                                         */



/* =========================================================================================================================== */
/* ================                                           ATIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc ATIM (ATIM)
  */

typedef struct {                                /*!< (@ 0x40001400) ATIM Structure                                             */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control Register1                                          */
    
    struct {
      __IOM uint32_t CEN        : 1;            /*!< [0..0] desc CEN                                                           */
      __IOM uint32_t UDIS       : 1;            /*!< [1..1] desc UDIS                                                          */
      __IOM uint32_t URS        : 1;            /*!< [2..2] desc URS                                                           */
      __IOM uint32_t OPM        : 1;            /*!< [3..3] desc OPM                                                           */
      __IOM uint32_t DIR        : 1;            /*!< [4..4] desc DIR                                                           */
      __IOM uint32_t CMS        : 2;            /*!< [6..5] desc CMS                                                           */
      __IOM uint32_t ARPE       : 1;            /*!< [7..7] desc ARPE                                                          */
      __IOM uint32_t CKD        : 2;            /*!< [9..8] desc CKD                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t UIFREMAP   : 1;            /*!< [11..11] desc UIFREMAP                                                    */
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control Register2                                          */
    
