damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t CCPC       : 1;            /*!< [0..0] desc CCPC                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CCUS       : 1;            /*!< [2..2] desc CCUS                                                          */
      __IOM uint32_t CCDS       : 1;            /*!< [3..3] desc CCDS                                                          */
      __IOM uint32_t MMS        : 3;            /*!< [6..4] desc MMS                                                           */
      __IOM uint32_t TI1S       : 1;            /*!< [7..7] desc TI1S                                                          */
      __IOM uint32_t OIS1       : 1;            /*!< [8..8] desc OIS1                                                          */
      __IOM uint32_t OIS1N      : 1;            /*!< [9..9] desc OIS1N                                                         */
      __IOM uint32_t OIS2       : 1;            /*!< [10..10] desc OIS2                                                        */
      __IOM uint32_t OIS2N      : 1;            /*!< [11..11] desc OIS2N                                                       */
      __IOM uint32_t OIS3       : 1;            /*!< [12..12] desc OIS3                                                        */
      __IOM uint32_t OIS3N      : 1;            /*!< [13..13] desc OIS3N                                                       */
      __IOM uint32_t OIS4       : 1;            /*!< [14..14] desc OIS4                                                        */
      __IOM uint32_t OIS4N      : 1;            /*!< [15..15] desc OIS4N                                                       */
      __IOM uint32_t OIS5       : 1;            /*!< [16..16] desc OIS5                                                        */
      __IOM uint32_t OIS5N      : 1;            /*!< [17..17] desc OIS5N                                                       */
      __IOM uint32_t OIS6       : 1;            /*!< [18..18] desc OIS6                                                        */
      __IOM uint32_t OIS6N      : 1;            /*!< [19..19] desc OIS6N                                                       */
      __IOM uint32_t MMS2       : 5;            /*!< [24..20] desc MMS2                                                        */
      __IOM uint32_t MMSH       : 2;            /*!< [26..25] desc MMSH                                                        */
    } CR2_f;
  } ;
  
  union {
    __IOM uint32_t SMCR;                        /*!< (@ 0x00000008) Slave Mode Control Register                                */
    
    struct {
      __IOM uint32_t SMS        : 3;            /*!< [2..0] desc SMS                                                           */
      __IOM uint32_t OCCS       : 1;            /*!< [3..3] desc OCCS                                                          */
      __IOM uint32_t TS         : 3;            /*!< [6..4] desc TS                                                            */
      __IOM uint32_t MSM        : 1;            /*!< [7..7] desc MSM                                                           */
      __IOM uint32_t ETF        : 4;            /*!< [11..8] desc ETF                                                          */
      __IOM uint32_t ETPS       : 2;            /*!< [13..12] desc ETPS                                                        */
      __IOM uint32_t ECE        : 1;            /*!< [14..14] desc ECE                                                         */
      __IOM uint32_t ETP        : 1;            /*!< [15..15] desc ETP                                                         */
      __IOM uint32_t SMSH       : 1;            /*!< [16..16] desc SMSH                                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t TSH        : 2;            /*!< [21..20] desc TSH                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t SMSPE      : 1;            /*!< [24..24] desc SMSPE                                                       */
      __IOM uint32_t SMSPS      : 1;            /*!< [25..25] desc SMSPS                                                       */
    } SMCR_f;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x0000000C) Interrupt Enable Register                                  */
    
    struct {
      __IOM uint32_t UIE        : 1;            /*!< [0..0] desc UIE                                                           */
      __IOM uint32_t CC1IE      : 1;            /*!< [1..1] desc CC1IE                                                         */
      __IOM uint32_t CC2IE      : 1;            /*!< [2..2] desc CC2IE                                                         */
      __IOM uint32_t CC3IE      : 1;            /*!< [3..3] desc CC3IE                                                         */
      __IOM uint32_t CC4IE      : 1;            /*!< [4..4] desc CC4IE                                                         */
      __IOM uint32_t COMIE      : 1;            /*!< [5..5] desc COMIE                                                         */
      __IOM uint32_t TIE        : 1;            /*!< [6..6] desc TIE                                                           */
      __IOM uint32_t BIE        : 1;            /*!< [7..7] desc BIE                                                           */
      __IOM uint32_t UDE        : 1;            /*!< [8..8] desc UDE                                                           */
      __IOM uint32_t CC1DE      : 1;            /*!< [9..9] desc CC1DE                                                         */
      __IOM uint32_t CC2DE      : 1;            /*!< [10..10] desc CC2DE                                                       */
      __IOM uint32_t CC3DE      : 1;            /*!< [11..11] desc CC3DE                                                       */
      __IOM uint32_t CC4DE      : 1;            /*!< [12..12] desc CC4DE                                                       */
      __IOM uint32_t COMDE      : 1;            /*!< [13..13] desc COMDE                                                       */
      __IOM uint32_t TDE        : 1;            /*!< [14..14] desc TDE                                                         */
            uint32_t            : 1;
      __IOM uint32_t CC5IE      : 1;            /*!< [16..16] desc CC5IE                                                       */
      __IOM uint32_t CC6IE      : 1;            /*!< [17..17] desc CC6IE                                                       */
      __IOM uint32_t CC5DE      : 1;            /*!< [18..18] desc CC5DE                                                       */
      __IOM uint32_t CC6DE      : 1;            /*!< [19..19] desc CC6DE                                                       */
      __IOM uint32_t IDXIE      : 1;            /*!< [20..20] desc IDXIE                                                       */
      __IOM uint32_t DIRIE      : 1;            /*!< [21..21] desc DIRIE                                                       */
      __IOM uint32_t IERRIE     : 1;            /*!< [22..22] desc IERRIE                                                      */
      __IOM uint32_t TERRIE     : 1;            /*!< [23..23] desc TERRIE                                                      */
    } IER_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000010) Interrupt status register                                  */
    
