damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IM  uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
      __IM  uint32_t CC1IF      : 1;            /*!< [1..1] desc CC1IF                                                         */
      __IM  uint32_t CC2IF      : 1;            /*!< [2..2] desc CC2IF                                                         */
      __IM  uint32_t CC3IF      : 1;            /*!< [3..3] desc CC3IF                                                         */
      __IM  uint32_t CC4IF      : 1;            /*!< [4..4] desc CC4IF                                                         */
      __IM  uint32_t COMIF      : 1;            /*!< [5..5] desc COMIF                                                         */
      __IM  uint32_t TIF        : 1;            /*!< [6..6] desc TIF                                                           */
      __IM  uint32_t BIF        : 1;            /*!< [7..7] desc BIF                                                           */
      __IM  uint32_t B2IF       : 1;            /*!< [8..8] desc B2IF                                                          */
      __IM  uint32_t CC1OF      : 1;            /*!< [9..9] desc CC1OF                                                         */
      __IM  uint32_t CC2OF      : 1;            /*!< [10..10] desc CC2OF                                                       */
      __IM  uint32_t CC3OF      : 1;            /*!< [11..11] desc CC3OF                                                       */
      __IM  uint32_t CC4OF      : 1;            /*!< [12..12] desc CC4OF                                                       */
      __IM  uint32_t SBIF       : 1;            /*!< [13..13] desc SBIF                                                        */
      __IM  uint32_t            : 2;
      __IM  uint32_t CC5IF      : 1;            /*!< [16..16] desc CC5IF                                                       */
      __IM  uint32_t CC6IF      : 1;            /*!< [17..17] desc CC6IF                                                       */
      __IM  uint32_t CC5OF      : 1;            /*!< [18..18] desc CC5OF                                                       */
      __IM  uint32_t CC6OF      : 1;            /*!< [19..19] desc CC6OF                                                       */
      __IM  uint32_t IDXF       : 1;            /*!< [20..20] desc IDXF                                                        */
      __IM  uint32_t DIRF       : 1;            /*!< [21..21] desc DIRF                                                        */
      __IM  uint32_t IERRF      : 1;            /*!< [22..22] desc IERRF                                                       */
      __IM  uint32_t TERRF      : 1;            /*!< [23..23] desc TERRF                                                       */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t EGR;                         /*!< (@ 0x00000014) Event generation register                                  */
    
    struct {
      __IOM uint32_t UG         : 1;            /*!< [0..0] desc UG                                                            */
      __IOM uint32_t CC1G       : 1;            /*!< [1..1] desc CC1G                                                          */
      __IOM uint32_t CC2G       : 1;            /*!< [2..2] desc CC2G                                                          */
      __IOM uint32_t CC3G       : 1;            /*!< [3..3] desc CC3G                                                          */
      __IOM uint32_t CC4G       : 1;            /*!< [4..4] desc CC4G                                                          */
      __IOM uint32_t COMG       : 1;            /*!< [5..5] desc COMG                                                          */
      __IOM uint32_t TG         : 1;            /*!< [6..6] desc TG                                                            */
      __IOM uint32_t BG         : 1;            /*!< [7..7] desc BG                                                            */
      __IOM uint32_t B2G        : 1;            /*!< [8..8] desc B2G                                                           */
      __IM  uint32_t            : 7;
      __IOM uint32_t CC5G       : 1;            /*!< [16..16] desc CC5G                                                        */
      __IOM uint32_t CC6G       : 1;            /*!< [17..17] desc CC6G                                                        */
    } EGR_f;
  } ;
  
  union {
    union {
      __IOM uint32_t CCMR1CAP;                  /*!< (@ 0x00000018) capture compare mode register 1                            */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< [1..0] desc CC1S                                                          */
        __IOM uint32_t IC1PSC   : 2;            /*!< [3..2] desc IC1PSC                                                        */
        __IOM uint32_t IC1F     : 4;            /*!< [7..4] desc IC1F                                                          */
        __IOM uint32_t CC2S     : 2;            /*!< [9..8] desc CC2S                                                          */
        __IOM uint32_t IC2PSC   : 2;            /*!< [11..10] desc IC2PSC                                                      */
        __IOM uint32_t IC2F     : 4;            /*!< [15..12] desc IC2F                                                        */
      } CCMR1CAP_f;
    } ;
    
    union {
      __IOM uint32_t CCMR1CMP;                  /*!< (@ 0x00000018) capture compare mode register 1                            */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< [1..0] desc CC1S                                                          */
        __IOM uint32_t OC1FE    : 1;            /*!< [2..2] desc OC1FE                                                         */
        __IOM uint32_t OC1PE    : 1;            /*!< [3..3] desc OC1PE                                                         */
        __IOM uint32_t OC1M     : 3;            /*!< [6..4] desc OC1M                                                          */
        __IOM uint32_t OC1CE    : 1;            /*!< [7..7] desc OC1CE                                                         */
        __IOM uint32_t CC2S     : 2;            /*!< [9..8] desc CC2S                                                          */
        __IOM uint32_t OC2FE    : 1;            /*!< [10..10] desc OC2FE                                                       */
        __IOM uint32_t OC2PE    : 1;            /*!< [11..11] desc OC2PE                                                       */
        __IOM uint32_t OC2M     : 3;            /*!< [14..12] desc OC2M                                                        */
        __IOM uint32_t OC2CE    : 1;            /*!< [15..15] desc OC2CE                                                       */
        __IOM uint32_t OC1MH    : 1;            /*!< [16..16] desc OC1MH                                                       */
        __IM  uint32_t          : 7;
        __IOM uint32_t OC2MH    : 1;            /*!< [24..24] desc OC2MH                                                       */
      } CCMR1CMP_f;
    } ;
  };
  
  union {
    union {
      __IOM uint32_t CCMR2CAP;                  /*!< (@ 0x0000001C) capture compare mode register 2                            */
      
