damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< [1..0] desc CC3S                                                          */
        __IOM uint32_t IC3PSC   : 2;            /*!< [3..2] desc IC3PSC                                                        */
        __IOM uint32_t IC3F     : 4;            /*!< [7..4] desc IC3F                                                          */
        __IOM uint32_t CC4S     : 2;            /*!< [9..8] desc CC4S                                                          */
        __IOM uint32_t IC4PSC   : 2;            /*!< [11..10] desc IC4PSC                                                      */
        __IOM uint32_t IC4F     : 4;            /*!< [15..12] desc IC4F                                                        */
      } CCMR2CAP_f;
    } ;
    
    union {
      __IOM uint32_t CCMR2CMP;                  /*!< (@ 0x0000001C) capture compare mode register 2                            */
      
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< [1..0] desc CC3S                                                          */
        __IOM uint32_t OC3FE    : 1;            /*!< [2..2] desc OC3FE                                                         */
        __IOM uint32_t OC3PE    : 1;            /*!< [3..3] desc OC3PE                                                         */
        __IOM uint32_t OC3M     : 3;            /*!< [6..4] desc OC3M                                                          */
        __IOM uint32_t OC3CE    : 1;            /*!< [7..7] desc OC3CE                                                         */
        __IOM uint32_t CC4S     : 2;            /*!< [9..8] desc CC4S                                                          */
        __IOM uint32_t OC4FE    : 1;            /*!< [10..10] desc OC4FE                                                       */
        __IOM uint32_t OC4PE    : 1;            /*!< [11..11] desc OC4PE                                                       */
        __IOM uint32_t OC4M     : 3;            /*!< [14..12] desc OC4M                                                        */
        __IOM uint32_t OC4CE    : 1;            /*!< [15..15] desc OC4CE                                                       */
        __IOM uint32_t OC3MH    : 1;            /*!< [16..16] desc OC3MH                                                       */
        __IM  uint32_t          : 7;
        __IOM uint32_t OC4MH    : 1;            /*!< [24..24] desc OC4MH                                                       */
      } CCMR2CMP_f;
    } ;
  };
  
  union {
    __IOM uint32_t CCER;                        /*!< (@ 0x00000020) capture compare enable register                            */
    
    struct {
      __IOM uint32_t CC1E       : 1;            /*!< [0..0] desc CC1E                                                          */
      __IOM uint32_t CC1P       : 1;            /*!< [1..1] desc CC1P                                                          */
      __IOM uint32_t CC1NE      : 1;            /*!< [2..2] desc CC1NE                                                         */
      __IOM uint32_t CC1NP      : 1;            /*!< [3..3] desc CC1NP                                                         */
      __IOM uint32_t CC2E       : 1;            /*!< [4..4] desc CC2E                                                          */
      __IOM uint32_t CC2P       : 1;            /*!< [5..5] desc CC2P                                                          */
      __IOM uint32_t CC2NE      : 1;            /*!< [6..6] desc CC2NE                                                         */
      __IOM uint32_t CC2NP      : 1;            /*!< [7..7] desc CC2NP                                                         */
      __IOM uint32_t CC3E       : 1;            /*!< [8..8] desc CC3E                                                          */
      __IOM uint32_t CC3P       : 1;            /*!< [9..9] desc CC3P                                                          */
      __IOM uint32_t CC3NE      : 1;            /*!< [10..10] desc CC3NE                                                       */
      __IOM uint32_t CC3NP      : 1;            /*!< [11..11] desc CC3NP                                                       */
      __IOM uint32_t CC4E       : 1;            /*!< [12..12] desc CC4E                                                        */
      __IOM uint32_t CC4P       : 1;            /*!< [13..13] desc CC4P                                                        */
      __IOM uint32_t CC4NE      : 1;            /*!< [14..14] desc CC4NE                                                       */
      __IOM uint32_t CC4NP      : 1;            /*!< [15..15] desc CC4NP                                                       */
      __IOM uint32_t CC5E       : 1;            /*!< [16..16] desc CC5E                                                        */
      __IOM uint32_t CC5P       : 1;            /*!< [17..17] desc CC5P                                                        */
      __IOM uint32_t CC5NE      : 1;            /*!< [18..18] desc CC5NE                                                       */
      __IOM uint32_t CC5NP      : 1;            /*!< [19..19] desc CC5NP                                                       */
      __IOM uint32_t CC6E       : 1;            /*!< [20..20] desc CC6E                                                        */
      __IOM uint32_t CC6P       : 1;            /*!< [21..21] desc CC6P                                                        */
      __IOM uint32_t CC6NE      : 1;            /*!< [22..22] desc CC6NE                                                       */
      __IOM uint32_t CC6NP      : 1;            /*!< [23..23] desc CC6NP                                                       */
    } CCER_f;
  } ;
  
  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000024) Counter Register                                           */
    
