damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IM  uint32_t            : 15;
      __IM  uint32_t UIFCPY     : 1;            /*!< [31..31] desc UIFCPY                                                      */
    } CNT_f;
  } ;
  
  union {
    __IOM uint32_t PSC;                         /*!< (@ 0x00000028) prescaler Register                                         */
    
    struct {
      __IOM uint32_t PSC        : 16;           /*!< [15..0] desc PSC                                                          */
    } PSC_f;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x0000002C) Auto reload Register                                       */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
    } ARR_f;
  } ;
  
  union {
    __IOM uint32_t RCR;                         /*!< (@ 0x00000030) Repetition Counter Register                                */
    
    struct {
      __IOM uint32_t REP        : 16;           /*!< [15..0] desc REP                                                          */
    } RCR_f;
  } ;
  
  union {
    __IOM uint32_t CCR1;                        /*!< (@ 0x00000034) capture compare register1                                  */
    
    struct {
      __IOM uint32_t CCR1       : 16;           /*!< [15..0] desc CCR1                                                         */
    } CCR1_f;
  } ;
  
  union {
    __IOM uint32_t CCR2;                        /*!< (@ 0x00000038) capture compare register2                                  */
    
    struct {
      __IOM uint32_t CCR2       : 16;           /*!< [15..0] desc CCR2                                                         */
    } CCR2_f;
  } ;
  
  union {
    __IOM uint32_t CCR3;                        /*!< (@ 0x0000003C) capture compare register3                                  */
    
    struct {
      __IOM uint32_t CCR3       : 16;           /*!< [15..0] desc CCR3                                                         */
    } CCR3_f;
  } ;
  
  union {
    __IOM uint32_t CCR4;                        /*!< (@ 0x00000040) capture compare register4                                  */
    
    struct {
      __IOM uint32_t CCR4       : 16;           /*!< [15..0] desc CCR4                                                         */
    } CCR4_f;
  } ;
  
  union {
    __IOM uint32_t BDTR;                        /*!< (@ 0x00000044) break and dead-time register                               */
    
    struct {
      __IOM uint32_t DTG        : 8;            /*!< [7..0] desc DTG                                                           */
      __IOM uint32_t LOCK       : 2;            /*!< [9..8] desc LOCK                                                          */
      __IOM uint32_t OSSI       : 1;            /*!< [10..10] desc OSSI                                                        */
      __IOM uint32_t OSSR       : 1;            /*!< [11..11] desc OSSR                                                        */
      __IOM uint32_t BKE        : 1;            /*!< [12..12] desc BKE                                                         */
      __IOM uint32_t BKP        : 1;            /*!< [13..13] desc BKP                                                         */
      __IOM uint32_t AOE        : 1;            /*!< [14..14] desc AOE                                                         */
      __IOM uint32_t MOE        : 1;            /*!< [15..15] desc MOE                                                         */
      __IOM uint32_t BKF        : 4;            /*!< [19..16] desc BKF                                                         */
      __IOM uint32_t BK2F       : 4;            /*!< [23..20] desc BK2F                                                        */
      __IOM uint32_t BK2E       : 1;            /*!< [24..24] desc BK2E                                                        */
      __IOM uint32_t BK2P       : 1;            /*!< [25..25] desc BK2P                                                        */
    } BDTR_f;
  } ;
  
  union {
    __IOM uint32_t CCR5;                        /*!< (@ 0x00000048) capture compare register5                                  */
    
    struct {
      __IOM uint32_t CCR5       : 16;           /*!< [15..0] desc CCR5                                                         */
      __IM  uint32_t            : 10;
      __IOM uint32_t GC5C1      : 1;            /*!< [26..26] desc GC5C1                                                       */
      __IOM uint32_t GC5C2      : 1;            /*!< [27..27] desc GC5C2                                                       */
      __IOM uint32_t GC5C3      : 1;            /*!< [28..28] desc GC5C3                                                       */
      __IOM uint32_t GC5C4      : 1;            /*!< [29..29] desc GC5C4                                                       */
      __IOM uint32_t GC5C5      : 1;            /*!< [30..30] desc GC5C5                                                       */
      __IOM uint32_t GC5C6      : 1;            /*!< [31..31] desc GC5C6                                                       */
    } CCR5_f;
  } ;
  
  union {
    __IOM uint32_t CCR6;                        /*!< (@ 0x0000004C) capture compare register6                                  */
    
    struct {
      __IOM uint32_t CCR6       : 16;           /*!< [15..0] desc CCR6                                                         */
      __IM  uint32_t            : 10;
      __IOM uint32_t GC6C1      : 1;            /*!< [26..26] desc GC6C1                                                       */
      __IOM uint32_t GC6C2      : 1;            /*!< [27..27] desc GC6C2                                                       */
      __IOM uint32_t GC6C3      : 1;            /*!< [28..28] desc GC6C3                                                       */
      __IOM uint32_t GC6C4      : 1;            /*!< [29..29] desc GC6C4                                                       */
      __IOM uint32_t GC6C5      : 1;            /*!< [30..30] desc GC6C5                                                       */
      __IOM uint32_t GC6C6      : 1;            /*!< [31..31] desc GC6C6                                                       */
    } CCR6_f;
  } ;
  
  union {
    union {
      __IOM uint32_t CCMR3CAP;                  /*!< (@ 0x00000050) capture compare mode register 3                            */
      
