damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
      struct {
        __IOM uint32_t CC5S     : 2;            /*!< [1..0] desc CC5S                                                          */
        __IOM uint32_t IC5PSC   : 2;            /*!< [3..2] desc IC5PSC                                                        */
        __IOM uint32_t IC5F     : 4;            /*!< [7..4] desc IC5F                                                          */
        __IOM uint32_t CC6S     : 2;            /*!< [9..8] desc CC6S                                                          */
        __IOM uint32_t IC6PSC   : 2;            /*!< [11..10] desc IC6PSC                                                      */
        __IOM uint32_t IC6F     : 4;            /*!< [15..12] desc IC6F                                                        */
      } CCMR3CAP_f;
    } ;
    
    union {
      __IOM uint32_t CCMR3CMP;                  /*!< (@ 0x00000050) capture compare mode register 3                            */
      
      struct {
        __IOM uint32_t CC5S     : 2;            /*!< [1..0] desc CC5S                                                          */
        __IOM uint32_t OC5FE    : 1;            /*!< [2..2] desc OC5FE                                                         */
        __IOM uint32_t OC5PE    : 1;            /*!< [3..3] desc OC5PE                                                         */
        __IOM uint32_t OC5M     : 3;            /*!< [6..4] desc OC5M                                                          */
        __IOM uint32_t OC5CE    : 1;            /*!< [7..7] desc OC5CE                                                         */
        __IOM uint32_t CC6S     : 2;            /*!< [9..8] desc CC6S                                                          */
        __IOM uint32_t OC6FE    : 1;            /*!< [10..10] desc OC6FE                                                       */
        __IOM uint32_t OC6PE    : 1;            /*!< [11..11] desc OC6PE                                                       */
        __IOM uint32_t OC6M     : 3;            /*!< [14..12] desc OC6M                                                        */
        __IOM uint32_t OC6CE    : 1;            /*!< [15..15] desc OC6CE                                                       */
        __IOM uint32_t OC5MH    : 1;            /*!< [16..16] desc OC5MH                                                       */
        __IM  uint32_t          : 7;
        __IOM uint32_t OC6MH    : 1;            /*!< [24..24] desc OC6MH                                                       */
      } CCMR3CMP_f;
    } ;
  };
  
  union {
    __IOM uint32_t DTR2;                        /*!< (@ 0x00000054) dead-time register2                                        */
    
    struct {
      __IOM uint32_t DTGF       : 8;            /*!< [7..0] desc DTGF                                                          */
      __IM  uint32_t            : 8;
      __IOM uint32_t DTAE       : 1;            /*!< [16..16] desc DTAE                                                        */
      __IOM uint32_t DTPE       : 1;            /*!< [17..17] desc DTPE                                                        */
    } DTR2_f;
  } ;
  
  union {
    __IOM uint32_t ECR;                         /*!< (@ 0x00000058) Encoder control Register                                   */
    
    struct {
      __IOM uint32_t IE         : 1;            /*!< [0..0] desc IE                                                            */
      __IOM uint32_t IDIR       : 2;            /*!< [2..1] desc IDIR                                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t FIDX       : 1;            /*!< [5..5] desc FIDX                                                          */
      __IOM uint32_t IPOS       : 2;            /*!< [7..6] desc IPOS                                                          */
    } ECR_f;
  } ;
  
  union {
    __IOM uint32_t TISEL1;                      /*!< (@ 0x0000005C) Timer Input Select Register1                               */
    
    struct {
      __IOM uint32_t TI1SEL     : 4;            /*!< [3..0] desc TI1SEL                                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI2SEL     : 4;            /*!< [11..8] desc TI2SEL                                                       */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI3SEL     : 4;            /*!< [19..16] desc TI3SEL                                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI4SEL     : 4;            /*!< [27..24] desc TI4SEL                                                      */
    } TISEL1_f;
  } ;
  
  union {
    __IOM uint32_t AF1;                         /*!< (@ 0x00000060) Alternate function Register1                               */
    
    struct {
      __IOM uint32_t BKINE      : 1;            /*!< [0..0] desc BKINE                                                         */
      __IOM uint32_t BKVC1E     : 1;            /*!< [1..1] desc BKVC1E                                                        */
      __IOM uint32_t BKVC2E     : 1;            /*!< [2..2] desc BKVC2E                                                        */
      __IOM uint32_t BKVC3E     : 1;            /*!< [3..3] desc BKVC3E                                                        */
      __IOM uint32_t BKVC4E     : 1;            /*!< [4..4] desc BKVC4E                                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t BKINP      : 1;            /*!< [9..9] desc BKINP                                                         */
      __IOM uint32_t BKVC1P     : 1;            /*!< [10..10] desc BKVC1P                                                      */
      __IOM uint32_t BKVC2P     : 1;            /*!< [11..11] desc BKVC2P                                                      */
      __IOM uint32_t BKVC3P     : 1;            /*!< [12..12] desc BKVC3P                                                      */
      __IOM uint32_t BKVC4P     : 1;            /*!< [13..13] desc BKVC4P                                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t ETRSEL     : 4;            /*!< [19..16] desc ETRSEL                                                      */
    } AF1_f;
  } ;
  
  union {
    __IOM uint32_t AF2;                         /*!< (@ 0x00000064) Alternate function Register2                               */
    
