damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t BK2INE     : 1;            /*!< [0..0] desc BK2INE                                                        */
      __IOM uint32_t BK2VC1E    : 1;            /*!< [1..1] desc BK2VC1E                                                       */
      __IOM uint32_t BK2VC2E    : 1;            /*!< [2..2] desc BK2VC2E                                                       */
      __IOM uint32_t BK2VC3E    : 1;            /*!< [3..3] desc BK2VC3E                                                       */
      __IOM uint32_t BK2VC4E    : 1;            /*!< [4..4] desc BK2VC4E                                                       */
      __IM  uint32_t            : 4;
      __IOM uint32_t BK2INP     : 1;            /*!< [9..9] desc BK2INP                                                        */
      __IOM uint32_t BK2VC1P    : 1;            /*!< [10..10] desc BK2VC1P                                                     */
      __IOM uint32_t BK2VC2P    : 1;            /*!< [11..11] desc BK2VC2P                                                     */
      __IOM uint32_t BK2VC3P    : 1;            /*!< [12..12] desc BK2VC3P                                                     */
      __IOM uint32_t BK2VC4P    : 1;            /*!< [13..13] desc BK2VC4P                                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t OCRSEL     : 4;            /*!< [19..16] desc OCRSEL                                                      */
    } AF2_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t TISEL2;                      /*!< (@ 0x0000006C) Timer Input Select Register2                               */
    
    struct {
      __IOM uint32_t TI5SEL     : 4;            /*!< [3..0] desc TI5SEL                                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI6SEL     : 4;            /*!< [11..8] desc TI6SEL                                                       */
    } TISEL2_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000070) Interrupt clean register                                   */
    
    struct {
      __IOM uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
      __IOM uint32_t CC1IF      : 1;            /*!< [1..1] desc CC1IF                                                         */
      __IOM uint32_t CC2IF      : 1;            /*!< [2..2] desc CC2IF                                                         */
      __IOM uint32_t CC3IF      : 1;            /*!< [3..3] desc CC3IF                                                         */
      __IOM uint32_t CC4IF      : 1;            /*!< [4..4] desc CC4IF                                                         */
      __IOM uint32_t COMIF      : 1;            /*!< [5..5] desc COMIF                                                         */
      __IOM uint32_t TIF        : 1;            /*!< [6..6] desc TIF                                                           */
      __IOM uint32_t BIF        : 1;            /*!< [7..7] desc BIF                                                           */
      __IOM uint32_t B2IF       : 1;            /*!< [8..8] desc B2IF                                                          */
      __IOM uint32_t CC1OF      : 1;            /*!< [9..9] desc CC1OF                                                         */
      __IOM uint32_t CC2OF      : 1;            /*!< [10..10] desc CC2OF                                                       */
      __IOM uint32_t CC3OF      : 1;            /*!< [11..11] desc CC3OF                                                       */
      __IOM uint32_t CC4OF      : 1;            /*!< [12..12] desc CC4OF                                                       */
      __IOM uint32_t SBIF       : 1;            /*!< [13..13] desc SBIF                                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t CC5IF      : 1;            /*!< [16..16] desc CC5IF                                                       */
      __IOM uint32_t CC6IF      : 1;            /*!< [17..17] desc CC6IF                                                       */
      __IOM uint32_t CC5OF      : 1;            /*!< [18..18] desc CC5OF                                                       */
      __IOM uint32_t CC6OF      : 1;            /*!< [19..19] desc CC6OF                                                       */
      __IOM uint32_t IDXF       : 1;            /*!< [20..20] desc IDXF                                                        */
      __IOM uint32_t DIRF       : 1;            /*!< [21..21] desc DIRF                                                        */
      __IOM uint32_t IERRF      : 1;            /*!< [22..22] desc IERRF                                                       */
      __IOM uint32_t TERRF      : 1;            /*!< [23..23] desc TERRF                                                       */
    } ICR_f;
  } ;
} ATIM_TypeDef;                                    /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                            BGR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief BGR (BGR)
  */

typedef struct {                                /*!< (@ 0x400000FC) BGR Structure                                              */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) Control register1                                          */
    
    struct {
      __IOM uint32_t BGREN      : 1;            /*!< [0..0] desc BGREN                                                         */
      __IOM uint32_t TSEN       : 1;            /*!< [1..1] desc TSEN                                                          */
    } CR_f;
  } ;
} BGR_TypeDef;                                     /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           BTIM1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Base Timer 1 (BTIM1)
  */

typedef struct {                                /*!< (@ 0x40004800) BTIM1 Structure                                            */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register1                                          */
    
