damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t FUNC       : 4;            /*!< [3..0] desc FUNC                                                          */
      __IOM uint32_t SCALE      : 3;            /*!< [6..4] desc SCALE                                                         */
      __IOM uint32_t FORMAT     : 1;            /*!< [7..7] desc FORMAT                                                        */
      __IOM uint32_t ITER       : 4;            /*!< [11..8] desc ITER                                                         */
      __IOM uint32_t COMP       : 1;            /*!< [12..12] desc COMP                                                        */
      __IOM uint32_t IE         : 1;            /*!< [13..13] desc IE                                                          */
      __IOM uint32_t DMAEOC     : 1;            /*!< [14..14] desc DMAEOC                                                      */
      __IOM uint32_t DMAIDLE    : 1;            /*!< [15..15] desc DMAIDLE                                                     */
      __IM  uint32_t EOC        : 1;            /*!< [16..16] desc EOC                                                         */
      __IM  uint32_t BUSY       : 1;            /*!< [17..17] desc BUSY                                                        */
    } CSR_f;
  } ;
  
  union {
    __IOM uint32_t X;                           /*!< (@ 0x00000004) Data register X                                            */
    
    struct {
      __IOM uint32_t X          : 32;           /*!< [31..0] desc DATA                                                         */
    } X_f;
  } ;
  
  union {
    __IOM uint32_t Y;                           /*!< (@ 0x00000008) Data register Y                                            */
    
    struct {
      __IOM uint32_t Y          : 32;           /*!< [31..0] desc DATA                                                         */
    } Y_f;
  } ;
  
  union {
    __IOM uint32_t Z;                           /*!< (@ 0x0000000C) Data register Y                                            */
    
    struct {
      __IOM uint32_t Z          : 32;           /*!< [31..0] desc DATA                                                         */
    } Z_f;
  } ;
} CORDIC_TypeDef;                                  /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc CRC (CRC)
  */

typedef struct {                                /*!< (@ 0x40023000) CRC Structure                                              */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) Control register                                           */
    
    struct {
      __IOM uint32_t MODE       : 4;            /*!< [3..0] desc MODE                                                          */
    } CR_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t DR;                          /*!< (@ 0x00000008) Data register                                              */
    
    struct {
      __IOM uint32_t DR         : 8;            /*!< [7..0] desc DR                                                            */
    } DR_f;
  } ;
  
  union {
    __IM  uint32_t RESULT;                      /*!< (@ 0x0000000C) Result register                                            */
    
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT_f;
  } ;
} CRC_TypeDef;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            DAC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc DAC (DAC)
  */

typedef struct {                                /*!< (@ 0x400000C0) DAC Structure                                              */
  
  union {
    __IOM uint32_t CR0;                         /*!< (@ 0x00000000) Control register                                           */
    
    struct {
      __IOM uint32_t EN1        : 1;            /*!< [0..0] desc EN1                                                           */
      __IOM uint32_t TEN1       : 1;            /*!< [1..1] desc TEN1                                                          */
      __IOM uint32_t TSEL1      : 4;            /*!< [5..2] desc TSEL1                                                         */
      __IOM uint32_t WAVE1      : 2;            /*!< [7..6] desc WAVE1                                                         */
      __IOM uint32_t MAMP1      : 4;            /*!< [11..8] desc MAMP1                                                        */
      __IOM uint32_t DMAEN1     : 1;            /*!< [12..12] desc DMAEN1                                                      */
      __IOM uint32_t DMAUDRIE1  : 1;            /*!< [13..13] desc DMAUDRIE1                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t EN2        : 1;            /*!< [16..16] desc EN2                                                         */
      __IOM uint32_t TEN2       : 1;            /*!< [17..17] desc TEN2                                                        */
      __IOM uint32_t TSEL2      : 4;            /*!< [21..18] desc TSEL2                                                       */
      __IOM uint32_t WAVE2      : 2;            /*!< [23..22] desc WAVE2                                                       */
      __IOM uint32_t MAMP2      : 4;            /*!< [27..24] desc MAMP2                                                       */
      __IOM uint32_t DMAEN2     : 1;            /*!< [28..28] desc DMAEN2                                                      */
      __IOM uint32_t DMAUDRIE2  : 1;            /*!< [29..29] desc DMAUDRIE2                                                   */
    } CR0_f;
  } ;
  
  union {
    __IOM uint32_t SWTRGR;                      /*!< (@ 0x00000004) Data register                                              */
    
