damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t SWTRIG1    : 1;            /*!< [0..0] desc SWTRIG1                                                       */
      __IOM uint32_t SWTRIG2    : 1;            /*!< [1..1] desc SWTRIG2                                                       */
    } SWTRGR_f;
  } ;
  
  union {
    __IOM uint32_t DHR12R1;                     /*!< (@ 0x00000008) Result register                                            */
    
    struct {
      __IOM uint32_t DATA       : 12;           /*!< [11..0] desc DATA                                                         */
    } DHR12R1_f;
  } ;
  
  union {
    __IOM uint32_t DHR12L1;                     /*!< (@ 0x0000000C) Result register                                            */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DATA       : 12;           /*!< [15..4] desc DATA                                                         */
    }DHR12L1_f;
  } ;
  
  union {
    __IOM uint32_t DHR8R1;                      /*!< (@ 0x00000010) Result register                                            */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DATA       : 4;            /*!< [7..4] desc DATA                                                          */
    } DHR8R1_f;
  } ;
  
  union {
    __IOM uint32_t DHR12R2;                     /*!< (@ 0x00000014) Result register                                            */
    
    struct {
      __IOM uint32_t DATA       : 12;           /*!< [11..0] desc DATA                                                         */
    } DHR12R2_f;
  } ;
  
  union {
    __IOM uint32_t DHR12L2;                    /*!< (@ 0x00000018) Result register                                            */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DATA       : 12;           /*!< [15..4] desc DATA                                                         */
    } DHR12L2_f;
  } ;
  
  union {
    __IOM uint32_t DHR8R2;                      /*!< (@ 0x0000001C) Result register                                            */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DATA       : 4;            /*!< [7..4] desc DATA                                                          */
    } DHR8R2_f;
  } ;
  
  union {
    __IOM uint32_t DHR12RD;                     /*!< (@ 0x00000020) Result register                                            */
    
    struct {
      __IOM uint32_t C1DATA     : 12;           /*!< [11..0] desc C1DATA                                                       */
      __IM  uint32_t            : 4;
      __IOM uint32_t C2DATA     : 12;           /*!< [27..16] desc C2DATA                                                      */
    } DHR12RD_f;
  } ;
  
  union {
    __IOM uint32_t DHR12LD;                     /*!< (@ 0x00000024) Result register                                            */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t C1DATA     : 12;           /*!< [15..4] desc C1DATA                                                       */
      __IM  uint32_t            : 4;
      __IOM uint32_t C2DATA     : 12;           /*!< [31..20] desc C2DATA                                                      */
    } DHR12LD_f;
  } ;
  
  union {
    __IOM uint32_t DHR8RD;                      /*!< (@ 0x00000028) Result register                                            */
    
    struct {
      __IOM uint32_t C1DATA     : 8;            /*!< [7..0] desc C1DATA                                                        */
      __IOM uint32_t C2DATA     : 8;            /*!< [15..8] desc C2DATA                                                       */
    } DHR8RD_f;
  } ;
  
  union {
    __IOM uint32_t DOR1;                        /*!< (@ 0x0000002C) Result register                                            */
    
    struct {
      __IOM uint32_t DATA       : 12;           /*!< [12..0] desc DATA                                                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t DMAUDR     : 1;            /*!< [15..15] desc DMAUDR                                                      */
    } DOR1_f;
  } ;
  
  union {
    __IOM uint32_t DOR2;                       /*!< (@ 0x00000030) Result register                                            */
    
    struct {
      __IOM uint32_t DATA       : 12;           /*!< [11..0] desc DATA                                                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t DMAUDR     : 1;            /*!< [15..15] desc DMAUDR                                                      */
    } DOR2_f;
  } ;
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000034) Result register                                            */
    
    struct {
      __IOM uint32_t C1OUT      : 1;            /*!< [0..0] desc C1OUT                                                         */
      __IOM uint32_t C2OUT      : 1;            /*!< [1..1] desc C2OUT                                                         */
    } CR1_f;
  } ;
} DAC_TypeDef;                                     /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc DMA (DMA)
  */

typedef struct {                                /*!< (@ 0x40020000) DMA Structure                                              */
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000000) Interrupt status register                                  */
    
