damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IM  uint32_t TC1        : 1;            /*!< [0..0] desc TC1                                                           */
      __IM  uint32_t TE1        : 1;            /*!< [1..1] desc TE1                                                           */
      __IM  uint32_t            : 2;
      __IM  uint32_t TC2        : 1;            /*!< [4..4] desc TC2                                                           */
      __IM  uint32_t TE2        : 1;            /*!< [5..5] desc TE2                                                           */
      __IM  uint32_t            : 2;
      __IM  uint32_t TC3        : 1;            /*!< [8..8] desc TC3                                                           */
      __IM  uint32_t TE3        : 1;            /*!< [9..9] desc TE3                                                           */
      __IM  uint32_t            : 2;
      __IM  uint32_t TC4        : 1;            /*!< [12..12] desc TC4                                                         */
      __IM  uint32_t TE4        : 1;            /*!< [13..13] desc TE4                                                         */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000004) Interrupt flag clear register                              */
    
    struct {
      __IOM uint32_t TC1        : 1;            /*!< [0..0] desc TC1                                                           */
      __IOM uint32_t TE1        : 1;            /*!< [1..1] desc TE1                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t TC2        : 1;            /*!< [4..4] desc TC2                                                           */
      __IOM uint32_t TE2        : 1;            /*!< [5..5] desc TE2                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t TC3        : 1;            /*!< [8..8] desc TC3                                                           */
      __IOM uint32_t TE3        : 1;            /*!< [9..9] desc TE3                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t TC4        : 1;            /*!< [12..12] desc TC4                                                         */
      __IOM uint32_t TE4        : 1;            /*!< [13..13] desc TE4                                                         */
    } ICR_f;
  } ;
  __IM  uint32_t  RESERVED[6];
  
  union {
    __IOM uint32_t CSR1;                        /*!< (@ 0x00000020) Channel1 control and status register                       */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] desc TCIE                                                          */
      __IOM uint32_t TEIE       : 1;            /*!< [2..2] desc TEIE                                                          */
      __IOM uint32_t TRANS      : 1;            /*!< [3..3] desc TRANS                                                         */
      __IOM uint32_t SRCINC     : 1;            /*!< [4..4] desc SRCINC                                                        */
      __IOM uint32_t DSTINC     : 1;            /*!< [5..5] desc DSTINC                                                        */
      __IOM uint32_t SIZE       : 2;            /*!< [7..6] desc SIZE                                                          */
      __IOM uint32_t STATUS     : 3;            /*!< [10..8] desc STATUS                                                       */
      __IOM uint32_t RESTART    : 1;            /*!< [11..11] desc RESTART                                                     */
      __IM  uint32_t TC         : 1;            /*!< [12..12] desc TC                                                          */
      __IM  uint32_t TE         : 1;            /*!< [13..13] desc TE                                                          */
      __IOM uint32_t SRCLOAD    : 1;            /*!< [14..14] desc SRCLOAD                                                     */
      __IOM uint32_t DSTLOAD    : 1;            /*!< [15..15] desc DSTLOAD                                                     */
    } CSR1_f;
  } ;
  
  union {
    __IOM uint32_t CNT1;                        /*!< (@ 0x00000024) Channel1 counter register                                  */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IOM uint32_t REPEAT     : 4;            /*!< [19..16] desc REPEAT                                                      */
    } CNT1_f;
  } ;
  
  union {
    __IOM uint32_t SRCADDR1;                    /*!< (@ 0x00000028) Channel1 source address register                           */
    
    struct {
      __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] desc SRCADDR                                                      */
    } SRCADDR1_f;
  } ;
  
  union {
    __IOM uint32_t DSTADDR1;                    /*!< (@ 0x0000002C) Channel1 destination address register                      */
    
    struct {
      __IOM uint32_t DSTADDR    : 32;           /*!< [31..0] desc DSTADDR                                                      */
    } DSTADDR1_f;
  } ;
  
  union {
    __IOM uint32_t TRIG1;                       /*!< (@ 0x00000030) Channel1 trigger register                                  */
    
    struct {
      __IOM uint32_t TYPE       : 1;            /*!< [0..0] desc TYPE                                                          */
      __IOM uint32_t SOFTSRC    : 1;            /*!< [1..1] desc SOFTSRC                                                       */
      __IOM uint32_t HARDSRC    : 6;            /*!< [7..2] desc HARDSRC                                                       */
    } TRIG1_f;
  } ;
  
  union {
    __IOM uint32_t CCNT1;                       /*!< (@ 0x00000034) Channel1 trigger register                                  */
    
