damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IOM uint32_t REPEAT     : 4;            /*!< [19..16] desc REPEAT                                                      */
    } CNT3_f;
  } ;
  
  union {
    __IOM uint32_t SRCADDR3;                    /*!< (@ 0x00000068) Channel1 source address register                           */
    
    struct {
      __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] desc SRCADDR                                                      */
    } SRCADDR3_f;
  } ;
  
  union {
    __IOM uint32_t DSTADDR3;                    /*!< (@ 0x0000006C) Channel1 destination address register                      */
    
    struct {
      __IOM uint32_t DSTADDR    : 32;           /*!< [31..0] desc DSTADDR                                                      */
    } DSTADDR3_f;
  } ;
  
  union {
    __IOM uint32_t TRIG3;                       /*!< (@ 0x00000070) Channel1 trigger register                                  */
    
    struct {
      __IOM uint32_t TYPE       : 1;            /*!< [0..0] desc TYPE                                                          */
      __IOM uint32_t SOFTSRC    : 1;            /*!< [1..1] desc SOFTSRC                                                       */
      __IOM uint32_t HARDSRC    : 6;            /*!< [7..2] desc HARDSRC                                                       */
    } TRIG3_f;
  } ;
  
  union {
    __IOM uint32_t CCNT3;                       /*!< (@ 0x00000074) Channel1 trigger register                                  */
    
    struct {
      __IOM uint32_t CCNT       : 16;           /*!< [15..0] desc CCNT                                                         */
      __IOM uint32_t CREPEAT    : 4;            /*!< [19..16] desc CREPEAT                                                     */
    } CCNT3_f;
  } ;
  
  union {
    __IM  uint32_t CSRCADDR3;                   /*!< (@ 0x00000078) Channel1 source address register                           */
    
    struct {
      __IM  uint32_t CSRCADDR   : 32;           /*!< [31..0] desc CSRCADDR                                                     */
    } CSRCADDR3_f;
  } ;
  
  union {
    __IM  uint32_t CDSTADDR3;                   /*!< (@ 0x0000007C) Channel1 destination address register                      */
    
    struct {
      __IM  uint32_t CDSTADDR   : 32;           /*!< [31..0] desc CDSTADDR                                                     */
    } CDSTADDR3_f;
  } ;
  
  union {
    __IOM uint32_t CSR4;                        /*!< (@ 0x00000080) Channel1 control and status register                       */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] desc TCIE                                                          */
      __IOM uint32_t TEIE       : 1;            /*!< [2..2] desc TEIE                                                          */
      __IOM uint32_t TRANS      : 1;            /*!< [3..3] desc TRANS                                                         */
      __IOM uint32_t SRCINC     : 1;            /*!< [4..4] desc SRCINC                                                        */
      __IOM uint32_t DSTINC     : 1;            /*!< [5..5] desc DSTINC                                                        */
      __IOM uint32_t SIZE       : 2;            /*!< [7..6] desc SIZE                                                          */
      __IOM uint32_t STATUS     : 3;            /*!< [10..8] desc STATUS                                                       */
      __IOM uint32_t RESTART    : 1;            /*!< [11..11] desc RESTART                                                     */
      __IM  uint32_t TC         : 1;            /*!< [12..12] desc TC                                                          */
      __IM  uint32_t TE         : 1;            /*!< [13..13] desc TE                                                          */
      __IOM uint32_t SRCLOAD    : 1;            /*!< [14..14] desc SRCLOAD                                                     */
      __IOM uint32_t DSTLOAD    : 1;            /*!< [15..15] desc DSTLOAD                                                     */
    } CSR4_f;
  } ;
  
  union {
    __IOM uint32_t CNT4;                        /*!< (@ 0x00000084) Channel1 counter register                                  */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IOM uint32_t REPEAT     : 4;            /*!< [19..16] desc REPEAT                                                      */
    } CNT4_f;
  } ;
  
  union {
    __IOM uint32_t SRCADDR4;                    /*!< (@ 0x00000088) Channel1 source address register                           */
    
    struct {
      __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] desc SRCADDR                                                      */
    } SRCADDR4_f;
  } ;
  
  union {
    __IOM uint32_t DSTADDR4;                    /*!< (@ 0x0000008C) Channel1 destination address register                      */
    
    struct {
      __IOM uint32_t DSTADDR    : 32;           /*!< [31..0] desc DSTADDR                                                      */
    } DSTADDR4_f;
  } ;
  
  union {
    __IOM uint32_t TRIG4;                       /*!< (@ 0x00000090) Channel1 trigger register                                  */
    
    struct {
      __IOM uint32_t TYPE       : 1;            /*!< [0..0] desc TYPE                                                          */
      __IOM uint32_t SOFTSRC    : 1;            /*!< [1..1] desc SOFTSRC                                                       */
      __IOM uint32_t HARDSRC    : 6;            /*!< [7..2] desc HARDSRC                                                       */
    } TRIG4_f;
  } ;
  
  union {
    __IOM uint32_t CCNT4;                       /*!< (@ 0x00000094) Channel1 trigger register                                  */
    
