damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t CCNT       : 16;           /*!< [15..0] desc CCNT                                                         */
      __IOM uint32_t CREPEAT    : 4;            /*!< [19..16] desc CREPEAT                                                     */
    } CCNT4_f;
  } ;
  
  union {
    __IM  uint32_t CSRCADDR4;                   /*!< (@ 0x00000098) Channel1 source address register                           */
    
    struct {
      __IM  uint32_t CSRCADDR   : 32;           /*!< [31..0] desc CSRCADDR                                                     */
    } CSRCADDR4_f;
  } ;
  
  union {
    __IM  uint32_t CDSTADDR4;                   /*!< (@ 0x0000009C) Channel1 destination address register                      */
    
    struct {
      __IM  uint32_t CDSTADDR   : 32;           /*!< [31..0] desc CDSTADDR                                                     */
    } CDSTADDR4_f;
  } ;
} DMA_TypeDef;                                     /*!< Size = 160 (0xa0)                                                         */



/* =========================================================================================================================== */
/* ================                                        DMACHANNEL1                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA Channel 1 (DMACHANNEL1)
  */

typedef struct {                                /*!< (@ 0x40020020) DMACHANNEL1 Structure                                      */
  
  union {
    __IOM uint32_t CSR;                         /*!< (@ 0x00000000) Channel1 control and status register                       */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] desc TCIE                                                          */
      __IOM uint32_t TEIE       : 1;            /*!< [2..2] desc TEIE                                                          */
      __IOM uint32_t TRANS      : 1;            /*!< [3..3] desc TRANS                                                         */
      __IOM uint32_t SRCINC     : 1;            /*!< [4..4] desc SRCINC                                                        */
      __IOM uint32_t DSTINC     : 1;            /*!< [5..5] desc DSTINC                                                        */
      __IOM uint32_t SIZE       : 2;            /*!< [7..6] desc SIZE                                                          */
      __IOM uint32_t STATUS     : 3;            /*!< [10..8] desc STATUS                                                       */
      __IOM uint32_t RESTART    : 1;            /*!< [11..11] desc RESTART                                                     */
      __IM  uint32_t TC         : 1;            /*!< [12..12] desc TC                                                          */
      __IM  uint32_t TE         : 1;            /*!< [13..13] desc TE                                                          */
      __IOM uint32_t SRCLOAD    : 1;            /*!< [14..14] desc SRCLOAD                                                     */
      __IOM uint32_t DSTLOAD    : 1;            /*!< [15..15] desc DSTLOAD                                                     */
    } CSR_f;
  } ;
  
  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000004) Channel1 counter register                                  */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IOM uint32_t REPEAT     : 4;            /*!< [19..16] desc REPEAT                                                      */
    } CNT_f;
  } ;
  
  union {
    __IOM uint32_t SRCADDR;                     /*!< (@ 0x00000008) Channel1 source address register                           */
    
    struct {
      __IOM uint32_t SRCADDR    : 32;           /*!< [31..0] desc SRCADDR                                                      */
    } SRCADDR_f;
  } ;
  
  union {
    __IOM uint32_t DSTADDR;                     /*!< (@ 0x0000000C) Channel1 destination address register                      */
    
    struct {
      __IOM uint32_t DSTADDR    : 32;           /*!< [31..0] desc DSTADDR                                                      */
    } DSTADDR_f;
  } ;
  
  union {
    __IOM uint32_t TRIG;                        /*!< (@ 0x00000010) Channel1 trigger register                                  */
    
    struct {
      __IOM uint32_t TYPE       : 1;            /*!< [0..0] desc TYPE                                                          */
      __IOM uint32_t SOFTSRC    : 1;            /*!< [1..1] desc SOFTSRC                                                       */
      __IOM uint32_t HARDSRC    : 6;            /*!< [7..2] desc HARDSRC                                                       */
    } TRIG_f;
  } ;
  
  union {
    __IOM uint32_t CCNT;                        /*!< (@ 0x00000014) Channel1 trigger register                                  */
    
    struct {
      __IOM uint32_t CCNT       : 16;           /*!< [15..0] desc CCNT                                                         */
      __IOM uint32_t CREPEAT    : 4;            /*!< [19..16] desc CREPEAT                                                     */
    } CCNT_f;
  } ;
  
  union {
    __IM  uint32_t CSRCADDR;                    /*!< (@ 0x00000018) Channel1 source address register                           */
    
    struct {
      __IM  uint32_t CSRCADDR   : 32;           /*!< [31..0] desc CSRCADDR                                                     */
    } CSRCADDR_f;
  } ;
  
  union {
    __IM  uint32_t CDSTADDR;                    /*!< (@ 0x0000001C) Channel1 destination address register                      */
    
