damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IM  uint32_t CDSTADDR   : 32;           /*!< [31..0] desc CDSTADDR                                                     */
    } CDSTADDR_f;
  } ;
} DMACHANNEL_TypeDef;                              /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                            EAU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc EAU (EAU)
  */

typedef struct {                                /*!< (@ 0x40023200) EAU Structure                                              */
  
  union {
    __IOM uint32_t CSR;                         /*!< (@ 0x00000000) desc CSR                                                   */
    
    struct {
      __IOM uint32_t MODE       : 2;            /*!< [1..0] desc MODE                                                          */
      __IM  uint32_t OVR        : 1;            /*!< [2..2] desc OVR                                                           */
      __IM  uint32_t ZERO       : 1;            /*!< [3..3] desc ZERO                                                          */
      __IM  uint32_t BUSY       : 1;            /*!< [4..4] desc BUSY                                                          */
    } CSR_f;
  } ;
  
  union {
    __IOM uint32_t DIVIDEND;                    /*!< (@ 0x00000004) desc DIVIDEND                                              */
    
    struct {
      __IOM uint32_t DIVIDEND   : 32;           /*!< [31..0] desc DIVIDEND                                                     */
    } DIVIDEND_f;
  } ;
  
  union {
    __IOM uint32_t DIVISOR;                     /*!< (@ 0x00000008) desc DIVISOR                                               */
    
    struct {
      __IOM uint32_t DIVISOR    : 32;           /*!< [31..0] desc DIVISOR                                                      */
    } DIVISOR_f;
  } ;
  
  union {
    __IM  uint32_t QUOTIENT;                    /*!< (@ 0x0000000C) desc QUOTIENT                                              */
    
    struct {
      __IM  uint32_t QUOTIENT   : 32;           /*!< [31..0] desc QUOTIENT                                                     */
    } QUOTIENT_f;
  } ;
  
  union {
    __IM  uint32_t REMAINDER;                   /*!< (@ 0x00000010) desc REMAINDER                                             */
    
    struct {
      __IM  uint32_t REMAINDER  : 32;           /*!< [31..0] desc REMAINDER                                                    */
    } REMAINDER_f;
  } ;
} EAU_TypeDef;                                     /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc FLASH (FLASH)
  */

typedef struct {                                /*!< (@ 0x40022000) FLASH Structure                                            */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register1                                          */
    
    struct {
      __IOM uint32_t MODE       : 2;            /*!< [1..0] desc MODE                                                          */
      __IM  uint32_t            : 3;
      __IM  uint32_t SECURITY   : 2;            /*!< [6..5] desc SECURITY                                                      */
      __IM  uint32_t            : 9;
      __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control register2                                          */
    
    struct {
      __IOM uint32_t WAIT       : 3;            /*!< [2..0] desc WAIT                                                          */
      __IOM uint32_t FETCH      : 1;            /*!< [3..3] desc FETCH                                                         */
      __IOM uint32_t CACHE      : 1;            /*!< [4..4] desc CACHE                                                         */
      __IOM uint32_t CACHEINVALID : 1;          /*!< [5..5] desc CACHEINVALID                                                  */
      __IM  uint32_t            : 10;
      __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
    } CR2_f;
  } ;
  
  union {
    __IOM uint32_t PAGELOCK;                    /*!< (@ 0x00000008) Page Write Erase Lock                                      */
    
    struct {
      __IOM uint32_t LOCK0      : 1;            /*!< [0..0] Page0 - 7                                                          */
      __IOM uint32_t LOCK1      : 1;            /*!< [1..1] Page8 - 15                                                         */
      __IOM uint32_t LOCK2      : 1;            /*!< [2..2] Page16 - 23                                                        */
      __IOM uint32_t LOCK3      : 1;            /*!< [3..3] Page24 - 31                                                        */
      __IOM uint32_t LOCK4      : 1;            /*!< [4..4] Page32 - 39                                                        */
      __IOM uint32_t LOCK5      : 1;            /*!< [5..5] Page40 - 47                                                        */
      __IOM uint32_t LOCK6      : 1;            /*!< [6..6] Page48 - 55                                                        */
      __IOM uint32_t LOCK7      : 1;            /*!< [7..7] Page56 - 63                                                        */
      __IOM uint32_t LOCK8      : 1;            /*!< [8..8] Page64 - 71                                                        */
      __IOM uint32_t LOCK9      : 1;            /*!< [9..9] Page72 - 79                                                        */
      __IOM uint32_t LOCK10     : 1;            /*!< [10..10] Page80 - 87                                                      */
      __IOM uint32_t LOCK11     : 1;            /*!< [11..11] Page88 - 95                                                      */
      __IOM uint32_t LOCK12     : 1;            /*!< [12..12] Page96 - 103                                                     */
      __IOM uint32_t LOCK13     : 1;            /*!< [13..13] Page104 - 111                                                    */
      __IOM uint32_t LOCK14     : 1;            /*!< [14..14] Page112 - 119                                                    */
      __IOM uint32_t LOCK15     : 1;            /*!< [15..15] Page120 - 127                                                    */
      __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
    } PAGELOCK_f;
  } ;
  __IM  uint32_t  RESERVED[5];
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000020) Interrupt enable register                                  */
    
