damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
      __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
      __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
      __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
      __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
      __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
      __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
      __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
      __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
      __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
      __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
      __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
      __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
      __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
      __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
      __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
    } OPENDRAIN_f;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t PUR;                         /*!< (@ 0x00000010) desc PUR                                                   */
    
    struct {
      __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
      __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
      __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
      __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
      __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
      __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
      __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
      __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
      __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
      __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
      __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
      __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
      __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
      __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
      __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
      __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
    } PUR_f;
  } ;
  
  union {
    __IOM uint32_t AFRH;                        /*!< (@ 0x00000014) desc AFRH                                                  */
    
    struct {
      __IOM uint32_t PIN8       : 4;            /*!< [2..0] desc AFR8                                                          */
      __IOM uint32_t PIN9       : 4;            /*!< [6..4] desc AFR9                                                          */
      __IOM uint32_t PIN10      : 4;            /*!< [10..8] desc AFR10                                                        */
      __IOM uint32_t PIN11      : 4;            /*!< [14..12] desc AFR11                                                       */
      __IOM uint32_t PIN12      : 4;            /*!< [18..16] desc AFR12                                                       */
      __IOM uint32_t PIN13      : 4;            /*!< [22..20] desc AFR13                                                       */
      __IOM uint32_t PIN14      : 4;            /*!< [26..24] desc AFR14                                                       */
      __IOM uint32_t PIN15      : 4;            /*!< [30..28] desc AFR15                                                       */
    } AFRH_f;
  } ;
  
  union {
    __IOM uint32_t AFRL;                        /*!< (@ 0x00000018) desc AFRL                                                  */
    
    struct {
      __IOM uint32_t PIN0       : 4;            /*!< [2..0] desc AFR0                                                          */
      __IOM uint32_t PIN1       : 4;            /*!< [6..4] desc AFR1                                                          */
      __IOM uint32_t PIN2       : 4;            /*!< [10..8] desc AFR2                                                         */
      __IOM uint32_t PIN3       : 4;            /*!< [14..12] desc AFR3                                                        */
      __IOM uint32_t PIN4       : 4;            /*!< [18..16] desc AFR4                                                        */
      __IOM uint32_t PIN5       : 4;            /*!< [22..20] desc AFR5                                                        */
      __IOM uint32_t PIN6       : 4;            /*!< [26..24] desc AFR6                                                        */
      __IOM uint32_t PIN7       : 4;            /*!< [30..28] desc AFR7                                                        */
    } AFRL_f;
  } ;
  
  union {
    __IOM uint32_t ANALOG;                      /*!< (@ 0x0000001C) desc ANALOG                                                */
    
