damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
      __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
      __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
      __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
      __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
      __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
      __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
      __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
      __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
      __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
      __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
      __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
      __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
      __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
      __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
      __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
    } ANALOG_f;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t RISEIE;                      /*!< (@ 0x00000024) Interrupt enable register                                  */
    
    struct {
      __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
      __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
      __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
      __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
      __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
      __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
      __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
      __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
      __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
      __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
      __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
      __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
      __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
      __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
      __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
      __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
    } RISEIE_f;
  } ;
  
  union {
    __IOM uint32_t FALLIE;                      /*!< (@ 0x00000028) Interrupt enable register                                  */
    
    struct {
      __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
      __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
      __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
      __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
      __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
      __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
      __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
      __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
      __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
      __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
      __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
      __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
      __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
      __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
      __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
      __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
    } FALLIE_f;
  } ;
  __IM  uint32_t  RESERVED2[2];
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000034) Interrupt status register                                  */
    
