damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IM  uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
      __IM  uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
      __IM  uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
      __IM  uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
      __IM  uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
      __IM  uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
      __IM  uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
      __IM  uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
      __IM  uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
      __IM  uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
      __IM  uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
      __IM  uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
      __IM  uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
      __IM  uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
      __IM  uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
      __IM  uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
    } IDR_f;
  } ;
  
  union {
    __IOM uint32_t ODR;                         /*!< (@ 0x00000054) desc ODR                                                   */
    
    struct {
      __IOM uint32_t PIN0       : 1;            /*!< [0..0] desc PIN0                                                          */
      __IOM uint32_t PIN1       : 1;            /*!< [1..1] desc PIN1                                                          */
      __IOM uint32_t PIN2       : 1;            /*!< [2..2] desc PIN2                                                          */
      __IOM uint32_t PIN3       : 1;            /*!< [3..3] desc PIN3                                                          */
      __IOM uint32_t PIN4       : 1;            /*!< [4..4] desc PIN4                                                          */
      __IOM uint32_t PIN5       : 1;            /*!< [5..5] desc PIN5                                                          */
      __IOM uint32_t PIN6       : 1;            /*!< [6..6] desc PIN6                                                          */
      __IOM uint32_t PIN7       : 1;            /*!< [7..7] desc PIN7                                                          */
      __IOM uint32_t PIN8       : 1;            /*!< [8..8] desc PIN8                                                          */
      __IOM uint32_t PIN9       : 1;            /*!< [9..9] desc PIN9                                                          */
      __IOM uint32_t PIN10      : 1;            /*!< [10..10] desc PIN10                                                       */
      __IOM uint32_t PIN11      : 1;            /*!< [11..11] desc PIN11                                                       */
      __IOM uint32_t PIN12      : 1;            /*!< [12..12] desc PIN12                                                       */
      __IOM uint32_t PIN13      : 1;            /*!< [13..13] desc PIN13                                                       */
      __IOM uint32_t PIN14      : 1;            /*!< [14..14] desc PIN14                                                       */
      __IOM uint32_t PIN15      : 1;            /*!< [15..15] desc PIN15                                                       */
    } ODR_f;
  } ;
  
  union {
    __IOM uint32_t BRR;                         /*!< (@ 0x00000058) desc BRR                                                   */
    
    struct {
      __IOM uint32_t BRR0       : 1;            /*!< [0..0] desc BRR0                                                          */
      __IOM uint32_t BRR1       : 1;            /*!< [1..1] desc BRR1                                                          */
      __IOM uint32_t BRR2       : 1;            /*!< [2..2] desc BRR2                                                          */
      __IOM uint32_t BRR3       : 1;            /*!< [3..3] desc BRR3                                                          */
      __IOM uint32_t BRR4       : 1;            /*!< [4..4] desc BRR4                                                          */
      __IOM uint32_t BRR5       : 1;            /*!< [5..5] desc BRR5                                                          */
      __IOM uint32_t BRR6       : 1;            /*!< [6..6] desc BRR6                                                          */
      __IOM uint32_t BRR7       : 1;            /*!< [7..7] desc BRR7                                                          */
      __IOM uint32_t BRR8       : 1;            /*!< [8..8] desc BRR8                                                          */
      __IOM uint32_t BRR9       : 1;            /*!< [9..9] desc BRR9                                                          */
      __IOM uint32_t BRR10      : 1;            /*!< [10..10] desc BRR10                                                       */
      __IOM uint32_t BRR11      : 1;            /*!< [11..11] desc BRR11                                                       */
      __IOM uint32_t BRR12      : 1;            /*!< [12..12] desc BRR12                                                       */
      __IOM uint32_t BRR13      : 1;            /*!< [13..13] desc BRR13                                                       */
      __IOM uint32_t BRR14      : 1;            /*!< [14..14] desc BRR14                                                       */
      __IOM uint32_t BRR15      : 1;            /*!< [15..15] desc BRR15                                                       */
    } BRR_f;
  } ;
  
  union {
    __IOM uint32_t BSRR;                        /*!< (@ 0x0000005C) desc BSRR                                                  */
    
