damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IM  uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
      __IM  uint32_t CC1IF      : 1;            /*!< [1..1] desc CC1IF                                                         */
      __IM  uint32_t CC2IF      : 1;            /*!< [2..2] desc CC2IF                                                         */
      __IM  uint32_t CC3IF      : 1;            /*!< [3..3] desc CC3IF                                                         */
      __IM  uint32_t CC4IF      : 1;            /*!< [4..4] desc CC4IF                                                         */
      __IM  uint32_t            : 1;
      __IM  uint32_t TIF        : 1;            /*!< [6..6] desc TIF                                                           */
      __IM  uint32_t            : 2;
      __IM  uint32_t CC1OF      : 1;            /*!< [9..9] desc CC1OF                                                         */
      __IM  uint32_t CC2OF      : 1;            /*!< [10..10] desc CC2OF                                                       */
      __IM  uint32_t CC3OF      : 1;            /*!< [11..11] desc CC3OF                                                       */
      __IM  uint32_t CC4OF      : 1;            /*!< [12..12] desc CC4OF                                                       */
      __IM  uint32_t            : 7;
      __IM  uint32_t IDXF       : 1;            /*!< [20..20] desc IDXF                                                        */
      __IM  uint32_t DIRF       : 1;            /*!< [21..21] desc DIRF                                                        */
      __IM  uint32_t IERRF      : 1;            /*!< [22..22] desc IERRF                                                       */
      __IM  uint32_t TERRF      : 1;            /*!< [23..23] desc TERRF                                                       */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t EGR;                         /*!< (@ 0x00000014) Event Generate register                                    */
    
    struct {
      __IOM uint32_t UG         : 1;            /*!< [0..0] desc UG                                                            */
      __IOM uint32_t CC1G       : 1;            /*!< [1..1] desc CC1G                                                          */
      __IOM uint32_t CC2G       : 1;            /*!< [2..2] desc CC2G                                                          */
      __IOM uint32_t CC3G       : 1;            /*!< [3..3] desc CC3G                                                          */
      __IOM uint32_t CC4G       : 1;            /*!< [4..4] desc CC4G                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t TG         : 1;            /*!< [6..6] desc TG                                                            */
    } EGR_f;
  } ;
  
  union {
    union {
      __IOM uint32_t CCMR1CAP;                  /*!< (@ 0x00000018) Capture control Register1                                  */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< [1..0] desc CC1S                                                          */
        __IOM uint32_t IC1PSC   : 2;            /*!< [3..2] desc IC1PSC                                                        */
        __IOM uint32_t IC1F     : 4;            /*!< [7..4] desc IC1F                                                          */
        __IOM uint32_t CC2S     : 2;            /*!< [9..8] desc CC2S                                                          */
        __IOM uint32_t IC2PSC   : 2;            /*!< [11..10] desc IC2PSC                                                      */
        __IOM uint32_t IC2F     : 4;            /*!< [15..12] desc IC2F                                                        */
      } CCMR1CAP_f;
    } ;
    
    union {
      __IOM uint32_t CCMR1CMP;                  /*!< (@ 0x00000018) Compare control Register1                                  */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< [1..0] desc CC1S                                                          */
        __IOM uint32_t OC1FE    : 1;            /*!< [2..2] desc OC1FE                                                         */
        __IOM uint32_t OC1PE    : 1;            /*!< [3..3] desc OC1PE                                                         */
        __IOM uint32_t OC1M     : 3;            /*!< [6..4] desc OC1M                                                          */
        __IOM uint32_t OC1CE    : 1;            /*!< [7..7] desc OC1CE                                                         */
        __IOM uint32_t CC2S     : 2;            /*!< [9..8] desc CC2S                                                          */
        __IOM uint32_t OC2FE    : 1;            /*!< [10..10] desc OC2FE                                                       */
        __IOM uint32_t OC2PE    : 1;            /*!< [11..11] desc OC2PE                                                       */
        __IOM uint32_t OC2M     : 3;            /*!< [14..12] desc OC2M                                                        */
        __IOM uint32_t OC2CE    : 1;            /*!< [15..15] desc OC2CE                                                       */
        __IOM uint32_t OC1MH    : 1;            /*!< [16..16] desc OC1MH                                                       */
        __IM  uint32_t          : 7;
        __IOM uint32_t OC2MH    : 1;            /*!< [24..24] desc OC2MH                                                       */
      } CCMR1CMP_f;
    } ;
  };
  
  union {
    union {
      __IOM uint32_t CCMR2CAP;                  /*!< (@ 0x0000001C) Capture control Register2                                  */
      
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< [1..0] desc CC3S                                                          */
        __IOM uint32_t IC3PSC   : 2;            /*!< [3..2] desc IC3PSC                                                        */
        __IOM uint32_t IC3F     : 4;            /*!< [7..4] desc IC3F                                                          */
        __IOM uint32_t CC4S     : 2;            /*!< [9..8] desc CC4S                                                          */
        __IOM uint32_t IC4PSC   : 2;            /*!< [11..10] desc IC4PSC                                                      */
        __IOM uint32_t IC4F     : 4;            /*!< [15..12] desc IC4F                                                        */
      } CCMR2CAP_f;
    } ;
    
    union {
      __IOM uint32_t CCMR2CMP;                  /*!< (@ 0x0000001C) Compare control Register2                                  */
      
