damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
      struct {
        __IOM uint32_t CC3S     : 2;            /*!< [1..0] desc CC3S                                                          */
        __IOM uint32_t OC3FE    : 1;            /*!< [2..2] desc OC3FE                                                         */
        __IOM uint32_t OC3PE    : 1;            /*!< [3..3] desc OC3PE                                                         */
        __IOM uint32_t OC3M     : 3;            /*!< [6..4] desc OC3M                                                          */
        __IOM uint32_t OC3CE    : 1;            /*!< [7..7] desc OC3CE                                                         */
        __IOM uint32_t CC4S     : 2;            /*!< [9..8] desc CC4S                                                          */
        __IOM uint32_t OC4FE    : 1;            /*!< [10..10] desc OC4FE                                                       */
        __IOM uint32_t OC4PE    : 1;            /*!< [11..11] desc OC4PE                                                       */
        __IOM uint32_t OC4M     : 3;            /*!< [14..12] desc OC4M                                                        */
        __IOM uint32_t OC4CE    : 1;            /*!< [15..15] desc OC4CE                                                       */
        __IOM uint32_t OC3MH    : 1;            /*!< [16..16] desc OC3MH                                                       */
        __IM  uint32_t          : 7;
        __IOM uint32_t OC4MH    : 1;            /*!< [24..24] desc OC4MH                                                       */
      } CCMR2CMP_f;
    } ;
  };
  
  union {
    __IOM uint32_t CCER;                        /*!< (@ 0x00000020) Capture compare Enable Register                            */
    
    struct {
      __IOM uint32_t CC1E       : 1;            /*!< [0..0] desc CC1E                                                          */
      __IOM uint32_t CC1P       : 1;            /*!< [1..1] desc CC1P                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CC1NP      : 1;            /*!< [3..3] desc CC1NP                                                         */
      __IOM uint32_t CC2E       : 1;            /*!< [4..4] desc CC2E                                                          */
      __IOM uint32_t CC2P       : 1;            /*!< [5..5] desc CC2P                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CC2NP      : 1;            /*!< [7..7] desc CC2NP                                                         */
      __IOM uint32_t CC3E       : 1;            /*!< [8..8] desc CC3E                                                          */
      __IOM uint32_t CC3P       : 1;            /*!< [9..9] desc CC3P                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CC3NP      : 1;            /*!< [11..11] desc CC3NP                                                       */
      __IOM uint32_t CC4E       : 1;            /*!< [12..12] desc CC4E                                                        */
      __IOM uint32_t CC4P       : 1;            /*!< [13..13] desc CC4P                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t CC4NP      : 1;            /*!< [15..15] desc CC4NP                                                       */
    } CCER_f;
  } ;
  
  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000024) Counter Register                                           */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IM  uint32_t            : 15;
      __IM  uint32_t UIFCPY     : 1;            /*!< [31..31] desc UIFCPY                                                      */
    } CNT_f;
  } ;
  
  union {
    __IOM uint32_t PSC;                         /*!< (@ 0x00000028) Prescaler Control Register                                 */
    
    struct {
      __IOM uint32_t PSC        : 16;           /*!< [15..0] desc PSC                                                          */
    } PSC_f;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x0000002C) Auto Reload Register                                       */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
    } ARR_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t CCR1;                        /*!< (@ 0x00000034) Capture control Register1                                  */
    
    struct {
      __IOM uint32_t CCR1       : 16;           /*!< [15..0] desc CCR1                                                         */
    } CCR1_f;
  } ;
  
  union {
    __IOM uint32_t CCR2;                        /*!< (@ 0x00000038) Capture control Register2                                  */
    
    struct {
      __IOM uint32_t CCR2       : 16;           /*!< [15..0] desc CCR2                                                         */
    } CCR2_f;
  } ;
  
  union {
    __IOM uint32_t CCR3;                        /*!< (@ 0x0000003C) Capture control Register3                                  */
    
    struct {
      __IOM uint32_t CCR3       : 16;           /*!< [15..0] desc CCR3                                                         */
    } CCR3_f;
  } ;
  
  union {
    __IOM uint32_t CCR4;                        /*!< (@ 0x00000040) Capture control Register4                                  */
    
    struct {
      __IOM uint32_t CCR4       : 16;           /*!< [15..0] desc CCR4                                                         */
    } CCR4_f;
  } ;
  __IM  uint32_t  RESERVED1[5];
  
  union {
    __IOM uint32_t ECR;                         /*!< (@ 0x00000058) Encoder control Register                                   */
    
