damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t IE         : 1;            /*!< [0..0] desc IE                                                            */
      __IOM uint32_t IDIR       : 2;            /*!< [2..1] desc IDIR                                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t FIDX       : 1;            /*!< [5..5] desc FIDX                                                          */
      __IOM uint32_t IPOS       : 2;            /*!< [7..6] desc IPOS                                                          */
    } ECR_f;
  } ;
  
  union {
    __IOM uint32_t TISEL;                       /*!< (@ 0x0000005C) Timer Input Select Register                                */
    
    struct {
      __IOM uint32_t TI1SEL     : 4;            /*!< [3..0] desc TI1SEL                                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI2SEL     : 4;            /*!< [11..8] desc TI2SEL                                                       */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI3SEL     : 4;            /*!< [19..16] desc TI3SEL                                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI4SEL     : 4;            /*!< [27..24] desc TI4SEL                                                      */
    } TISEL_f;
  } ;
  
  union {
    __IOM uint32_t AF1;                         /*!< (@ 0x00000060) Alternate function Register1                               */
    
    struct {
      __IM  uint32_t            : 14;
      __IOM uint32_t ETRSEL     : 4;            /*!< [17..14] desc ETRSEL                                                      */
    } AF1_f;
  } ;
  
  union {
    __IOM uint32_t AF2;                         /*!< (@ 0x00000064) Alternate function Register2                               */
    
    struct {
      __IM  uint32_t            : 16;
      __IOM uint32_t OCRSEL     : 3;            /*!< [18..16] desc OCRSEL                                                      */
    } AF2_f;
  } ;
  __IM  uint32_t  RESERVED2[2];
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000070) Interrupt flag clear register                              */
    
    struct {
      __IOM uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
      __IOM uint32_t CC1IF      : 1;            /*!< [1..1] desc CC1IF                                                         */
      __IOM uint32_t CC2IF      : 1;            /*!< [2..2] desc CC2IF                                                         */
      __IOM uint32_t CC3IF      : 1;            /*!< [3..3] desc CC3IF                                                         */
      __IOM uint32_t CC4IF      : 1;            /*!< [4..4] desc CC4IF                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TIF        : 1;            /*!< [6..6] desc TIF                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t CC1OF      : 1;            /*!< [9..9] desc CC1OF                                                         */
      __IOM uint32_t CC2OF      : 1;            /*!< [10..10] desc CC2OF                                                       */
      __IOM uint32_t CC3OF      : 1;            /*!< [11..11] desc CC3OF                                                       */
      __IOM uint32_t CC4OF      : 1;            /*!< [12..12] desc CC4OF                                                       */
      __IM  uint32_t            : 7;
      __IOM uint32_t IDXF       : 1;            /*!< [20..20] desc IDXF                                                        */
      __IOM uint32_t DIRF       : 1;            /*!< [21..21] desc DIRF                                                        */
      __IOM uint32_t IERRF      : 1;            /*!< [22..22] desc IERRF                                                       */
      __IOM uint32_t TERRF      : 1;            /*!< [23..23] desc TERRF                                                       */
    } ICR_f;
  } ;
} GTIM_TypeDef;                                    /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                          HALLTIM                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief HALL Timer (HALLTIM)
  */

typedef struct {                                /*!< (@ 0x40006400) HALLTIM Structure                                          */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) Control register1                                          */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t FLT1EN     : 1;            /*!< [1..1] desc FLT1EN                                                         */
      __IOM uint32_t DIV        : 2;            /*!< [3..2] desc DIV                                                           */
      __IOM uint32_t MMS        : 3;            /*!< [6..4] desc MMS                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t FLT2LEN    : 15;           /*!< [22..8] desc FLT2LEN                                                       */
      __IOM uint32_t SOFTCAP    : 1;            /*!< [23..23] desc SOFTCAP                                                    */
    } CR_f;
  } ;
  
  union {
    __IOM uint32_t DIER;                        /*!< (@ 0x00000004) DMA and Interrupt register2                                */
    
