damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t CAPIE      : 1;            /*!< [0..0] desc CAPIE                                                         */
      __IOM uint32_t OVIE       : 1;            /*!< [1..1] desc OVIE                                                          */
      __IOM uint32_t MATCHIE    : 1;            /*!< [2..2] desc MATCHIE                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t CAPDMA     : 1;            /*!< [4..4] desc CAPDMA                                                        */
      __IOM uint32_t OVDMA      : 1;            /*!< [5..5] desc OVDMA                                                         */
      __IOM uint32_t MATCHDMA   : 1;            /*!< [6..6] desc MATCHDMA                                                      */
      __IOM uint32_t SOFTDMA    : 1;            /*!< [7..7] desc SOFTDMA                                                       */
    } DIER_f;
  } ;
  
  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000008) counter register                                           */
    
    struct {
      __IOM uint32_t DATA       : 24;           /*!< [23..0] desc CNT                                                          */
    } CNT_f;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x0000000C) Auto Reload Register                                       */
    
    struct {
      __IOM uint32_t DATA       : 24;           /*!< [23..0] desc ARR                                                          */
    } ARR_f;
  } ;
  
  union {
    __IM  uint32_t WIDTH;                       /*!< (@ 0x00000010) Width Register                                             */
    
    struct {
      __IM  uint32_t DATA       : 24;           /*!< [23..0] desc WIDTH                                                        */
    } WIDTH_f;
  } ;
  
  union {
    __IOM uint32_t CCR;                         /*!< (@ 0x00000014) Compare control Register                                   */
    
    struct {
      __IOM uint32_t DATA       : 24;           /*!< [23..0] desc CCR                                                          */
    } CCR_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000018) Interrupt states register                                  */
    
    struct {
      __IM  uint32_t CAPF       : 1;            /*!< [0..0] desc CAPF                                                         */
      __IM  uint32_t OV         : 1;            /*!< [1..1] desc OV                                                            */
      __IM  uint32_t MATCH      : 1;            /*!< [2..2] desc MATCH                                                         */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x0000001C) Interrupt clean register                                   */
    
    struct {
      __IOM uint32_t CAPF       : 1;            /*!< [0..0] desc CHG                                                           */
      __IOM uint32_t OVF        : 1;            /*!< [1..1] desc OV                                                            */
      __IOM uint32_t MATCHF     : 1;            /*!< [2..2] desc MATCH                                                         */
    } ICR_f;
  } ;
  
  union {
    __IM  uint32_t STATE;                       /*!< (@ 0x00000020) State register                                             */
    
    struct {
      __IM  uint32_t CH1F       : 1;            /*!< desc CH1F                                                                 */
      __IM  uint32_t CH2F       : 1;            /*!< desc CH2F                                                                 */
      __IM  uint32_t CH3F       : 1;            /*!< desc CH3F                                                                 */
            uint32_t            : 1;
      __IM  uint32_t CH1S       : 1;            /*!< desc CH1S                                                                 */
      __IM  uint32_t CH2S       : 1;            /*!< desc CH2S                                                                 */
      __IM  uint32_t CH3S       : 1;            /*!< desc CH3S                                                                 */
    } STATE_f;
  } ;
} HALLTIM_TypeDef;                                 /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           I2C1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc I2C1 (I2C1)
  */
typedef struct {                                /*!< (@ 0x40005800) I2C1 Structure                                             */
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t INSEL;                       /*!< (@ 0x00000008) Input selection register                                   */

    struct {
      __IOM uint32_t SCLINSEL   : 3;            /*!< [2..0] desc SCLINSEL                                                      */
      __IOM uint32_t SDAINSEL   : 3;            /*!< [5..3] desc SDAINSEL                                                      */
    } INSEL_f;
  } ;

  union {
    __IOM uint32_t MICR;                        /*!< (@ 0x0000000C) Master Interrupt Flag Clear Register                       */

    struct {
            uint32_t            : 8;
      __IOM uint32_t PACKET     : 1;            /*!< [8..8] desc PACKET                                                        */
      __IOM uint32_t STOP       : 1;            /*!< [9..9] desc STOP                                                          */
      __IOM uint32_t NACK       : 1;            /*!< [10..10] desc NACK                                                        */
      __IOM uint32_t ARBI       : 1;            /*!< [11..11] desc ARBI                                                        */
      __IOM uint32_t FIFO       : 1;            /*!< [12..12] desc FIFO                                                        */
      __IOM uint32_t PINLOW     : 1;            /*!< [13..13] desc PINLOW                                                      */
      __IOM uint32_t MATCH      : 1;            /*!< [14..14] desc MATCH                                                       */
    } MICR_f;
  } ;

  union {
    __IOM uint32_t MCR0;                        /*!< (@ 0x00000010) Master Control Register0                                   */

