damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t MEN        : 1;            /*!< [0..0] desc MEN                                                           */
      __IOM uint32_t RESET      : 1;            /*!< [1..1] desc RESET                                                         */
      __IOM uint32_t SLEEPEN    : 1;            /*!< [2..2] desc SLEEPEN                                                       */
      __IOM uint32_t DBGEN      : 1;            /*!< [3..3] desc DBGEN                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t CLKSRC     : 2;            /*!< [7..6] desc CLKSRC                                                        */
      __IOM uint32_t TXFIFORST  : 1;            /*!< [8..8] desc TXFIFORST                                                     */
      __IOM uint32_t RXFIFORST  : 1;            /*!< [9..9] desc RXFIFORST                                                     */
    } MCR0_f;
  } ;

  union {
    __IM  uint32_t MISR;                        /*!< (@ 0x00000014) Master Interrupt Status Register                           */

    struct {
      __IM  uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IM  uint32_t RXNE       : 1;            /*!< [1..1] desc RXNE                                                          */
            uint32_t            : 6;
      __IM  uint32_t PACKET     : 1;            /*!< [8..8] desc PACKET                                                        */
      __IM  uint32_t STOP       : 1;            /*!< [9..9] desc STOP                                                          */
      __IM  uint32_t NACK       : 1;            /*!< [10..10] desc NACK                                                        */
      __IM  uint32_t ARBI       : 1;            /*!< [11..11] desc ARBI                                                        */
      __IM  uint32_t FIFO       : 1;            /*!< [12..12] desc FIFO                                                        */
      __IM  uint32_t PINLOW     : 1;            /*!< [13..13] desc PINLOW                                                      */
      __IM  uint32_t MATCH      : 1;            /*!< [14..14] desc MATCH                                                       */
      __IM  uint32_t            : 9;
      __IM  uint32_t MSTBUSY    : 1;            /*!< [24..24] desc MSTBUSY                                                     */
      __IM  uint32_t BUSBUSY    : 1;            /*!< [25..25] desc BUSBUSY                                                     */
    } MISR_f;
  } ;

  union {
    __IOM uint32_t MIER;                        /*!< (@ 0x00000018) Master Interrupt Enable Register                           */

    struct {
      __IOM uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IOM uint32_t RXNE       : 1;            /*!< [1..1] desc RXNE                                                          */
            uint32_t            : 6;
      __IOM uint32_t PACKET     : 1;            /*!< [8..8] desc PACKET                                                        */
      __IOM uint32_t STOP       : 1;            /*!< [9..9] desc STOP                                                          */
      __IOM uint32_t NACK       : 1;            /*!< [10..10] desc NACK                                                        */
      __IOM uint32_t ARBI       : 1;            /*!< [11..11] desc ARBI                                                        */
      __IOM uint32_t FIFO       : 1;            /*!< [12..12] desc FIFO                                                        */
      __IOM uint32_t PINLOW     : 1;            /*!< [13..13] desc PINLOW                                                      */
      __IOM uint32_t MATCH      : 1;            /*!< [14..14] desc MATCH                                                       */
    } MIER_f;
  } ;

  union {
    __IOM uint32_t MDER;                        /*!< (@ 0x0000001C) Master DMA Enable Register                                 */

    struct {
      __IOM uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IOM uint32_t RXNE       : 1;            /*!< [1..1] desc RXNE                                                          */
    } MDER_f;
  } ;

  union {
    __IOM uint32_t MCR1;                        /*!< (@ 0x00000020) Master Control Register1                                   */

    struct {
      __IM  uint32_t            : 8;
      __IOM uint32_t CIRFIFO    : 1;            /*!< [8..8] desc CIRFIFO                                                       */
      __IOM uint32_t RDMO       : 1;            /*!< [9..9] desc RDMO                                                          */
    } MCR1_f;
  } ;

  union {
    union {
      __IOM uint32_t MCR2;                      /*!< (@ 0x00000024) Master Control Register2                                   */

      struct {
          __IOM uint32_t PRESCALE   : 3;        /*!< [2..0] desc PRESCALE                                                      */
          __IM  uint32_t            : 5;
          __IOM uint32_t AUTOSTOP   : 1;        /*!< [8..8] desc AUTOSTOP                                                      */
          __IOM uint32_t IGNACK     : 1;        /*!< [9..9] desc IGNACK                                                        */
          __IOM uint32_t TIMECFG    : 1;        /*!< [10..10] desc TIMECFG                                                     */
          __IM  uint32_t            : 4;
          __IOM uint32_t TRGSEL     : 1;        /*!< [15..15] desc TRGSEL                                                      */
          __IOM uint32_t MATCFG     : 3;        /*!< [18..16] desc MATCFG                                                      */
                uint32_t            : 5;
          __IOM uint32_t PINCFG     : 3;        /*!< [26..24] desc PINCFG                                                      */
      } MCR2_f;
    } ;

    union {
      __IOM uint32_t SCR2;                      /*!< (@ 0x00000024) desc SCR2                                                  */

