damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
      struct {
          __IM  uint32_t            : 24;
          __IOM uint32_t PINCFG     : 3;        /*!< [26..24] desc PINCFG                                                      */
      } SCR2_f;
    } ;
  } ;

  union {
    __IOM uint32_t MCR3;                        /*!< (@ 0x00000028) Master Control Register3                                   */

    struct {
      __IOM uint32_t BUSIDLE    : 12;           /*!< [11..0] desc BUSIDLE                                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t FLTSCL     : 4;            /*!< [19..16] desc FLTSCL                                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t FLTSDA     : 4;            /*!< [27..24] desc FLTSDA                                                      */
    } MCR3_f;
  } ;

  union {
    __IOM uint32_t MCR4;                        /*!< (@ 0x0000002C) Master Control Register4                                   */

    struct {
      __IM  uint32_t            : 8;
      __IOM uint32_t PINLOW     : 12;           /*!< [19..8] desc PINLOW                                                       */
    } MCR4_f;
  } ;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t MMATCH;                      /*!< (@ 0x00000040) Master Match Register                                      */

    struct {
      __IOM uint32_t MATCH0     : 8;            /*!< [7..0] desc MATCH0                                                        */
      __IM  uint32_t            : 8;
      __IOM uint32_t MATCH1     : 8;            /*!< [23..16] desc MATCH1                                                      */
    } MMATCH_f;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t MCCR;                        /*!< (@ 0x00000048) Master Clock Control Register0                             */

    struct {
      __IOM uint32_t CLKLO      : 6;            /*!< [5..0] desc CLKLO                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t CLKHI      : 6;            /*!< [13..8] desc CLKHI                                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t SETHOLD    : 6;            /*!< [21..16] desc SETHOLD                                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t DATAVD     : 6;            /*!< [29..24] desc DATAVD                                                      */
    } MCCR_f;
  } ;
  __IM  uint32_t  RESERVED3[3];

  union {
    __IOM uint32_t MFIFOCR;                     /*!< (@ 0x00000058) Master FIFO Control Register                               */

    struct {
      __IOM uint32_t TXWATER    : 1;            /*!< [0..0] desc TXWATER                                                       */
      __IM  uint32_t            : 15;
      __IOM uint32_t RXWATER    : 1;            /*!< [16..16] desc RXWATER                                                     */
    } MFIFOCR_f;
  } ;

  union {
    __IM  uint32_t MFIFOSR;                     /*!< (@ 0x0000005C) Master FIFO Status Register                                */

    struct {
      __IM  uint32_t TXCNT      : 2;            /*!< [1..0] desc TXCNT                                                         */
      __IM  uint32_t            : 14;
      __IM  uint32_t RXCNT      : 2;            /*!< [17..16] desc RXCNT                                                       */
    } MFIFOSR_f;
  } ;

  union {
    __OM  uint32_t MTDR;                        /*!< (@ 0x00000060) Master Tx Data Register                                    */

    struct {
      __OM  uint32_t DATA       : 8;            /*!< [7..0] desc DATA                                                          */
      __OM  uint32_t CMD        : 3;            /*!< [10..8] desc CMD                                                          */
    } MTDR_f;
  } ;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IM  uint32_t MRDR;                        /*!< (@ 0x00000070) Master Rx Data Register                                    */

    struct {
      __IM  uint32_t DATA       : 8;            /*!< [7..0] desc DATA                                                          */
      __IM  uint32_t            : 6;
      __IM  uint32_t EMPTY      : 1;            /*!< [14..14] desc EMPTY                                                       */
    } MRDR_f;
  } ;
  __IM  uint32_t  RESERVED5[38];
  
  union {
    __IOM uint32_t SICR;                        /*!< (@ 0x0000010C) desc SICR                                                  */

    struct {
      __IM  uint32_t            : 8;
      __IOM uint32_t RESTART    : 1;            /*!< [8..8] desc RESTART                                                       */
      __IOM uint32_t STOP       : 1;            /*!< [9..9] desc STOP                                                          */
      __IOM uint32_t BIT        : 1;            /*!< [10..10] desc BIT                                                         */
      __IOM uint32_t FIFO       : 1;            /*!< [11..11] desc FIFO                                                        */
    } SICR_f;
  } ;

  union {
    __IOM uint32_t SCR0;                        /*!< (@ 0x00000110) Slave Control Register0                                    */

    struct {
      __IOM uint32_t SEN        : 1;            /*!< [0..0] desc SEN                                                           */
      __IOM uint32_t RESET      : 1;            /*!< [1..1] desc RESET                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t FLTEN      : 1;            /*!< [4..4] desc FLTEN                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t CLKSRC     : 2;            /*!< [7..6] desc CLKSRC                                                        */
      __IOM uint32_t TXFIFORST  : 1;            /*!< [8..8] desc TXFIFORST                                                     */
      __IOM uint32_t RXFIFORST  : 1;            /*!< [9..9] desc RXFIFORST                                                     */
    } SCR0_f;
  } ;

  union {
    __IM  uint32_t SISR;                        /*!< (@ 0x00000114) desc SISR                                                  */

