damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IM  uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IM  uint32_t RXNE       : 1;            /*!< [1..1] desc RXNE                                                          */
      __IM  uint32_t ADDR       : 1;            /*!< [2..2] desc ADDR                                                          */
      __IM  uint32_t TACK       : 1;            /*!< [3..3] desc TACK                                                          */
      __IM  uint32_t            : 4;
      __IM  uint32_t RESTART    : 1;            /*!< [8..8] desc RESTART                                                       */
      __IM  uint32_t STOP       : 1;            /*!< [9..9] desc STOP                                                          */
      __IM  uint32_t BIT        : 1;            /*!< [10..10] desc BIT                                                         */
      __IM  uint32_t FIFO       : 1;            /*!< [11..11] desc FIFO                                                        */
      __IM  uint32_t AM0        : 1;            /*!< [12..12] desc AM0                                                         */
      __IM  uint32_t AM1        : 1;            /*!< [13..13] desc AM1                                                         */
      __IM  uint32_t GC         : 1;            /*!< [14..14] desc GC                                                          */
      __IM  uint32_t ALERT      : 1;            /*!< [15..15] desc ALERT                                                       */
      __IM  uint32_t            : 8;
      __IM  uint32_t SLVBUSY    : 1;            /*!< [24..24] desc SLVBUSY                                                     */
      __IM  uint32_t BUSBUSY    : 1;            /*!< [25..25] desc BUSBUSY                                                     */
    } SISR_f;
  } ;

  union {
    __IOM uint32_t SIER;                        /*!< (@ 0x00000118) desc SIER                                                  */

    struct {
      __IOM uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IOM uint32_t RXNE       : 1;            /*!< [1..1] desc RXNE                                                          */
      __IOM uint32_t ADDR       : 1;            /*!< [2..2] desc ADDR                                                          */
      __IOM uint32_t TACK       : 1;            /*!< [3..3] desc TACK                                                          */
      __IM  uint32_t            : 4;
      __IOM uint32_t RESTART    : 1;            /*!< [8..8] desc RESTART                                                       */
      __IOM uint32_t STOP       : 1;            /*!< [9..9] desc STOP                                                          */
      __IOM uint32_t BIT        : 1;            /*!< [10..10] desc BIT                                                         */
      __IOM uint32_t FIFO       : 1;            /*!< [11..11] desc FIFO                                                        */
      __IOM uint32_t AM0        : 1;            /*!< [12..12] desc AM0                                                         */
      __IOM uint32_t AM1        : 1;            /*!< [13..13] desc AM1                                                         */
      __IOM uint32_t GC         : 1;            /*!< [14..14] desc GC                                                          */
      __IOM uint32_t ALERT      : 1;            /*!< [15..15] desc ALERT                                                       */
    } SIER_f;
  } ;

  union {
    __IOM uint32_t SDER;                        /*!< (@ 0x0000011C) desc SDER                                                  */

    struct {
      __IOM uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IOM uint32_t RXNE       : 1;            /*!< [1..1] desc RXNE                                                          */
      __IOM uint32_t ADDR       : 1;            /*!< [2..2] desc ADDR                                                          */
    } SDER_f;
  } ;
  __IM  uint32_t  RESERVED6;
  
  union {
    __IOM uint32_t SCR1;                        /*!< (@ 0x00000124) desc SCR1                                                  */

    struct {
      __IOM uint32_t ADRSTALL   : 1;            /*!< [0..0] desc ADRSTALL                                                      */
      __IOM uint32_t RXSTALL    : 1;            /*!< [1..1] desc RXSTALL                                                       */
      __IOM uint32_t TXSTALL    : 1;            /*!< [2..2] desc TXSTALL                                                       */
      __IOM uint32_t ACKSTALL   : 1;            /*!< [3..3] desc ACKSTALL                                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t GCEN       : 1;            /*!< [8..8] desc GCEN                                                          */
      __IOM uint32_t ALERTEN    : 1;            /*!< [9..9] desc ALERTEN                                                       */
      __IOM uint32_t TXCFG      : 1;            /*!< [10..10] desc TXCFG                                                       */
      __IOM uint32_t RXCFG      : 1;            /*!< [11..11] desc RXCFG                                                       */
      __IOM uint32_t IGNACK     : 1;            /*!< [12..12] desc IGNACK                                                      */
            uint32_t            : 2;
      __IOM uint32_t TRGSEL     : 1;            /*!< [15..15] desc TRGSEL                                                      */
      __IOM uint32_t ADDRCFG    : 3;            /*!< [18..16] desc ADDRCFG                                                     */
    } SCR1_f;
  } ;

  union {
    __IOM uint32_t SCR3;                        /*!< (@ 0x00000128) desc SCR3                                                  */

