damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t CLKHOLD    : 4;            /*!< [3..0] desc CLKHOLD                                                       */
      __IM  uint32_t            : 4;
      __IOM uint32_t DATAVD     : 6;            /*!< [13..8] desc DATAVD                                                       */
      __IM  uint32_t            : 2;
      __IOM uint32_t FLTSCL     : 4;            /*!< [19..16] desc FLTSCL                                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t FLTSDA     : 4;            /*!< [27..24] desc FLTSDA                                                      */
    } SCR3_f;
  } ;
  __IM  uint32_t  RESERVED7[5];

  union {
    __IOM uint32_t SAMR;                        /*!< (@ 0x00000140) desc SAMR                                                  */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t ADDR0      : 10;           /*!< [10..1] desc ADDR0                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t ADDR1      : 10;           /*!< [26..17] desc ADDR1                                                       */
    } SAMR_f;
  } ;
  __IM  uint32_t  RESERVED8[3];

  union {
    __IM  uint32_t SASR;                        /*!< (@ 0x00000150) desc SASR                                                  */

    struct {
      __IM  uint32_t RADDR      : 11;           /*!< [10..0] desc RADDR                                                        */
      __IM  uint32_t            : 3;
      __IM  uint32_t ANV        : 1;            /*!< [14..14] desc ANV                                                         */
    } SASR_f;
  } ;

  union {
    __IOM uint32_t STAR;                        /*!< (@ 0x00000154) desc STAR                                                  */

    struct {
      __IOM uint32_t TXNACK     : 1;            /*!< [0..0] desc TXNACK                                                        */
    } STAR_f;
  } ;
  __IM  uint32_t  RESERVED9[2];

  union {
    __OM  uint32_t STDR;                        /*!< (@ 0x00000160) desc STDR                                                  */

    struct {
      __OM  uint32_t DATA       : 8;            /*!< [7..0] desc DATA                                                          */
    } STDR_f;
  } ;
  __IM  uint32_t  RESERVED10[3];

  union {
    __IM  uint32_t SRDR;                        /*!< (@ 0x00000170) desc SRDR                                                  */

    struct {
      __IM  uint32_t DATA       : 8;            /*!< [7..0] desc DATA                                                          */
      __IM  uint32_t            : 6;
      __IM  uint32_t RXEMPTY    : 1;            /*!< [14..14] desc RXEMPTY                                                     */
      __IM  uint32_t SOF        : 1;            /*!< [15..15] desc SOF                                                         */
    } SRDR_f;
  } ;
} I2C_TypeDef;                                     /*!< Size = 372 (0x174)                                                        */



/* =========================================================================================================================== */
/* ================                                           IRMOD                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc IRMOD (IRMOD)
  */

typedef struct {                                /*!< (@ 0x40004080) IRMOD Structure                                            */
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) Input selection register                                   */
    
    struct {
      __IOM uint32_t MOD        : 4;            /*!< [3..0] desc MOD                                                           */
      __IOM uint32_t IRSW       : 1;            /*!< [4..4] desc IRSW                                                          */
      __IOM uint32_t INV        : 1;            /*!< [5..5] desc INV                                                           */
    } CR_f;
  } ;
} IRMOD_TypeDef;                                   /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           IWDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc IWDT (IWDT)
  */

typedef struct {                                /*!< (@ 0x40005000) IWDT Structure                                             */
  
  union {
    __OM  uint32_t KR;                          /*!< (@ 0x00000000) Key register                                               */
    
    struct {
      __OM  uint32_t KR         : 16;           /*!< [15..0] desc KR                                                           */
    } KR_f;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000004) Control register                                           */
    
    struct {
      __IOM uint32_t PRS        : 3;            /*!< [2..0] desc PRS                                                           */
      __IOM uint32_t ACTION     : 1;            /*!< [3..3] desc ACTION                                                        */
      __IOM uint32_t IE         : 1;            /*!< [4..4] desc IE                                                            */
      __IOM uint32_t PAUSE      : 1;            /*!< [5..5] desc PAUSE                                                         */
    } CR_f;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x00000008) Auto reload register                                       */
    
