damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t ARR        : 12;           /*!< [11..0] desc ARR                                                          */
    } ARR_f;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< (@ 0x0000000C) Status register                                            */
    
    struct {
      __IM  uint32_t CRF        : 1;            /*!< [0..0] desc CRF                                                           */
      __IM  uint32_t ARRF       : 1;            /*!< [1..1] desc ARRF                                                          */
      __IM  uint32_t WINRF      : 1;            /*!< [2..2] desc WINRF                                                         */
      __IOM uint32_t OV         : 1;            /*!< [3..3] desc OV                                                            */
      __IM  uint32_t RUN        : 1;            /*!< [4..4] desc RUN                                                           */
      __IM  uint32_t RELOAD     : 1;            /*!< [5..5] desc RELOAD                                                        */
    } SR_f;
  } ;
  
  union {
    __IOM uint32_t WINR;                        /*!< (@ 0x00000010) Window register                                            */
    
    struct {
      __IOM uint32_t WINR       : 12;           /*!< [11..0] desc WINR                                                         */
    } WINR_f;
  } ;
  __IM  uint32_t  RESERVED[4];
  
  union {
    __IM  uint32_t CNT;                         /*!< (@ 0x00000024) counter                                                    */
    
    struct {
      __IM  uint32_t CNT        : 12;           /*!< [11..0] desc CNT                                                          */
    } CNT_f;
  } ;
} IWDT_TypeDef;                                    /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                           LPTIM                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc LPTIM (LPTIM)
  */

typedef struct {                                /*!< (@ 0x40006000) LPTIM Structure                                            */
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000000) desc ISR                                                   */
    
    struct {
      __IM  uint32_t CMPM       : 1;            /*!< [0..0] desc CMPM                                                          */
      __IM  uint32_t ARRM       : 1;            /*!< [1..1] desc ARRM                                                          */
      __IM  uint32_t EXTTRIG    : 1;            /*!< [2..2] desc EXTTRIG                                                       */
      __IM  uint32_t CMPOK      : 1;            /*!< [3..3] desc CMPOK                                                         */
      __IM  uint32_t ARROK      : 1;            /*!< [4..4] desc ARROK                                                         */
      __IM  uint32_t UP         : 1;            /*!< [5..5] desc UP                                                            */
      __IM  uint32_t DOWN       : 1;            /*!< [6..6] desc DOWN                                                          */
      __IM  uint32_t DIR        : 2;            /*!< [8..7] desc DIR                                                           */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000004) desc ICR                                                   */
    
    struct {
      __IOM uint32_t CMPM       : 1;            /*!< [0..0] desc CMPM                                                          */
      __IOM uint32_t ARRM       : 1;            /*!< [1..1] desc ARRM                                                          */
      __IOM uint32_t EXTTRIG    : 1;            /*!< [2..2] desc EXTTRIG                                                       */
      __IOM uint32_t CMPOK      : 1;            /*!< [3..3] desc CMPOK                                                         */
      __IOM uint32_t ARROK      : 1;            /*!< [4..4] desc ARROK                                                         */
      __IOM uint32_t UP         : 1;            /*!< [5..5] desc UP                                                            */
      __IOM uint32_t DOWN       : 1;            /*!< [6..6] desc DOWN                                                          */
    } ICR_f;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000008) desc IER                                                   */
    
    struct {
      __IOM uint32_t CMPM       : 1;            /*!< [0..0] desc CMPM                                                          */
      __IOM uint32_t ARRM       : 1;            /*!< [1..1] desc ARRM                                                          */
      __IOM uint32_t EXTTRIG    : 1;            /*!< [2..2] desc EXTTRIG                                                       */
      __IOM uint32_t CMPOK      : 1;            /*!< [3..3] desc CMPOK                                                         */
      __IOM uint32_t ARROK      : 1;            /*!< [4..4] desc ARROK                                                         */
      __IOM uint32_t UP         : 1;            /*!< [5..5] desc UP                                                            */
      __IOM uint32_t DOWN       : 1;            /*!< [6..6] desc DOWN                                                          */
    } IER_f;
  } ;
  
  union {
    __IOM uint32_t CFGR;                        /*!< (@ 0x0000000C) desc CFGR1                                                 */
    
