damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t CKSEL      : 1;            /*!< [0..0] desc CKSEL                                                         */
      __IOM uint32_t ENCMD_CKPOL : 2;           /*!< [2..1] desc ENCMD_CKPOL                                                   */
      __IOM uint32_t CHFLT      : 2;            /*!< [4..3] desc CHFLT                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TRIGFLT    : 2;            /*!< [7..6] desc TRIGFLT                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t PRS        : 3;            /*!< [11..9] desc PRS                                                          */
      __IOM uint32_t TRIGSEL    : 4;            /*!< [15..12] desc TRIGSEL                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t TRIGEN     : 2;            /*!< [18..17] desc TRIGEN                                                      */
      __IOM uint32_t TIMOUT     : 1;            /*!< [19..19] desc TIMOUT                                                      */
      __IOM uint32_t WAVE       : 1;            /*!< [20..20] desc WAVE                                                        */
      __IOM uint32_t WAVPOL     : 1;            /*!< [21..21] desc WAVPOL                                                      */
      __IOM uint32_t PRELOAD    : 1;            /*!< [22..22] desc PRELOAD                                                     */
      __IOM uint32_t COUNTMD    : 1;            /*!< [23..23] desc COUNTMD                                                     */
      __IOM uint32_t ENC        : 1;            /*!< [24..24] desc ENC                                                         */
      __IOM uint32_t ICLKSRC    : 2;            /*!< [26..25] desc ICLKSRC                                                     */
    } CFGR_f;
  } ;
  
  union {
    __IOM uint32_t CR0;                         /*!< (@ 0x00000010) desc CR                                                    */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t SNGSTART   : 1;            /*!< [1..1] desc SNGSTART                                                      */
      __IOM uint32_t CNTSTART   : 1;            /*!< [2..2] desc CNTSTART                                                      */
      __IOM uint32_t SRST       : 1;            /*!< [3..3] desc SRST                                                          */
      __IOM uint32_t ARST       : 1;            /*!< [4..4] desc ARST                                                          */
    } CR0_f;
  } ;
  
  union {
    __IOM uint32_t CMP;                         /*!< (@ 0x00000014) desc CMP                                                   */
    
    struct {
      __IOM uint32_t CMP        : 16;           /*!< [15..0] desc CMP                                                          */
    } CMP_f;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x00000018) desc ARR                                                   */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
    } ARR_f;
  } ;
  
  union {
    __IM  uint32_t CNT;                         /*!< (@ 0x0000001C) desc CNT                                                   */
    
    struct {
      __IM  uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
    } CNT_f;
  } ;
  
  union {
    __IOM uint32_t CR1;                       /*!< (@ 0x00000020) desc CFGR2                                                 */
    
    struct {
      __IOM uint32_t CH1SRC     : 3;            /*!< [2..0] desc CH1SRC                                                        */
      __IOM uint32_t CH2SRC     : 3;            /*!< [5..3] desc CH2SRC                                                        */
    } CR1_f;
  } ;
} LPTIM_TypeDef;                                   /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc UART1 (UART1)
  */

typedef struct {                                /*!< (@ 0x40000C00) UART1 Structure                                            */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register1                                          */
    
    struct {
      __IOM uint32_t TXEN       : 1;            /*!< [0..0] desc TXEN                                                          */
      __IOM uint32_t RXEN       : 1;            /*!< [1..1] desc RXEN                                                          */
      __IOM uint32_t PARITY     : 1;            /*!< [2..2] desc PARITY                                                        */
      __IOM uint32_t PARITYEN   : 1;            /*!< [3..3] desc PARITYEN                                                      */
      __IOM uint32_t STOP       : 2;            /*!< [5..4] desc STOP                                                          */
      __IOM uint32_t CHLEN      : 1;            /*!< [6..6] desc CHLEN                                                         */
      __IOM uint32_t MSBF       : 1;            /*!< [7..7] desc MSBF                                                          */
      __IOM uint32_t START      : 1;            /*!< [8..8] desc START                                                         */
      __IOM uint32_t OVER       : 2;            /*!< [10..9] desc OVER                                                         */
      __IOM uint32_t SIGNAL     : 1;            /*!< [11..11] desc SIGNAL                                                      */
      __IOM uint32_t SOURCE     : 2;            /*!< [13..12] desc SOURCE                                                      */
      __IOM uint32_t SYNC       : 1;            /*!< [14..14] desc SYNC                                                        */
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control register2                                          */
    
