damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t ADDREN     : 1;            /*!< [0..0] desc ADDREN                                                        */
      __IOM uint32_t RXMATCHEN  : 1;            /*!< [1..1] desc RXMATCHEN                                                     */
      __IOM uint32_t CTSEN      : 1;            /*!< [2..2] desc CTSEN                                                         */
      __IOM uint32_t RTSEN      : 1;            /*!< [3..3] desc RTSEN                                                         */
      __IOM uint32_t RXINV      : 1;            /*!< [4..4] desc RXINV                                                         */
      __IOM uint32_t TXINV      : 1;            /*!< [5..5] desc TXINV                                                         */
      __IOM uint32_t DMARX      : 1;            /*!< [6..6] desc DMARX                                                         */
      __IOM uint32_t DMATX      : 1;            /*!< [7..7] desc DMATX                                                         */
      __IOM uint32_t TIMCR      : 3;            /*!< [10..8] desc TIMCR                                                        */
      __IOM uint32_t SWAP       : 1;            /*!< [11..11] desc SWAP                                                        */
      __IOM uint32_t ADCRX      : 1;            /*!< desc ADCRX                                                                */
      __IOM uint32_t ADCTX      : 1;            /*!< desc ADCTX                                                                */
      __IOM uint32_t LOOP       : 1;            /*!< [14..14] desc LOOP                                                        */
      __IOM uint32_t RXSRC      : 3;            /*!< [17..15] desc RXSRC                                                       */
    } CR2_f;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000008) Interrupt enable register                                  */
    
    struct {
      __IOM uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IOM uint32_t TC         : 1;            /*!< [1..1] desc TC                                                            */
      __IOM uint32_t RC         : 1;            /*!< [2..2] desc RC                                                            */
      __IOM uint32_t RXIDLE     : 1;            /*!< [3..3] desc RXIDLE                                                        */
      __IOM uint32_t RXBRK      : 1;            /*!< [4..4] desc RXBRK                                                         */
      __IOM uint32_t BAUD       : 1;            /*!< [5..5] desc BAUD                                                          */
      __IOM uint32_t TIMOV      : 1;            /*!< [6..6] desc TIMOV                                                         */
      __IOM uint32_t CTS        : 1;            /*!< [7..7] desc CTS                                                           */
      __IOM uint32_t FE         : 1;            /*!< [8..8] desc FE                                                            */
      __IOM uint32_t PE         : 1;            /*!< [9..9] desc PE                                                            */
      __IOM uint32_t NE         : 1;            /*!< [10..10] desc NE                                                          */
      __IOM uint32_t ORE        : 1;            /*!< [11..11] desc ORE                                                         */
      __IOM uint32_t RXMATCH    : 1;            /*!< [12..12] desc RXMATCH                                                     */
    } IER_f;
  } ;
  
  union {
    __IOM uint32_t BRRI;                        /*!< (@ 0x0000000C) desc BRRI                                                  */
    
    struct {
      __IOM uint32_t BRRI       : 16;           /*!< [15..0] desc BRRI                                                         */
    } BRRI_f;
  } ;
  
  union {
    __IOM uint32_t BRRF;                        /*!< (@ 0x00000010) desc BRRF                                                  */
    
    struct {
      __IOM uint32_t BRRF       : 4;            /*!< [3..0] desc BRRF                                                          */
    } BRRF_f;
  } ;
  
  union {
    __IOM uint32_t TIMARR;                      /*!< (@ 0x00000014) desc TIMARR                                                */
    
    struct {
      __IOM uint32_t TIMARR     : 24;           /*!< [23..0] desc TIMARR                                                       */
    } TIMARR_f;
  } ;
  
  union {
    __IM  uint32_t TIMCNT;                      /*!< (@ 0x00000018) desc TIMCNT                                                */
    
    struct {
      __IM  uint32_t TIMCNT     : 24;           /*!< [23..0] desc TIMCNT                                                       */
    } TIMCNT_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x0000001C) Interrupt status register                                  */
    
    struct {
      __IM  uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IM  uint32_t TC         : 1;            /*!< [1..1] desc TC                                                            */
      __IM  uint32_t RC         : 1;            /*!< [2..2] desc RC                                                            */
      __IM  uint32_t RXIDLE     : 1;            /*!< [3..3] desc RXIDLE                                                        */
      __IM  uint32_t RXBRK      : 1;            /*!< [4..4] desc RXBRK                                                         */
      __IM  uint32_t BAUD       : 1;            /*!< [5..5] desc BAUD                                                          */
      __IM  uint32_t TIMOV      : 1;            /*!< [6..6] desc TIMOV                                                         */
      __IM  uint32_t CTS        : 1;            /*!< [7..7] desc CTS                                                           */
      __IM  uint32_t FE         : 1;            /*!< [8..8] desc FE                                                            */
      __IM  uint32_t PE         : 1;            /*!< [9..9] desc PE                                                            */
      __IM  uint32_t NE         : 1;            /*!< [10..10] desc NE                                                          */
      __IM  uint32_t ORE        : 1;            /*!< [11..11] desc ORE                                                         */
      __IM  uint32_t RXMATCH    : 1;            /*!< [12..12] desc RXMATCH                                                     */
      __IM  uint32_t SLVMATCH   : 1;            /*!< [13..13] desc SLVMATCH                                                    */
      __IM  uint32_t TXBUSY     : 1;            /*!< [14..14] desc TXBUSY                                                      */
      __IM  uint32_t CTSLV      : 1;            /*!< [15..15] desc CTSLV                                                       */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000020) Interrupt flag clear register                              */
    
