damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t TC         : 1;            /*!< [1..1] desc TC                                                            */
      __IOM uint32_t RC         : 1;            /*!< [2..2] desc RC                                                            */
      __IOM uint32_t RXIDLE     : 1;            /*!< [3..3] desc RXIDLE                                                        */
      __IOM uint32_t RXBRK      : 1;            /*!< [4..4] desc RXBRK                                                         */
      __IOM uint32_t BAUD       : 1;            /*!< [5..5] desc BAUD                                                          */
      __IOM uint32_t TIMOV      : 1;            /*!< [6..6] desc TIMOV                                                         */
      __IOM uint32_t CTS        : 1;            /*!< [7..7] desc CTS                                                           */
      __IOM uint32_t FE         : 1;            /*!< [8..8] desc FE                                                            */
      __IOM uint32_t PE         : 1;            /*!< [9..9] desc PE                                                            */
      __IOM uint32_t NE         : 1;            /*!< [10..10] desc NE                                                          */
      __IOM uint32_t ORE        : 1;            /*!< [11..11] desc ORE                                                         */
      __IOM uint32_t RXMATCH    : 1;            /*!< [12..12] desc RXMATCH                                                     */
    } ICR_f;
  } ;
  
  union {
    __IM  uint32_t RDR;                         /*!< (@ 0x00000024) Data reg for read                                          */
    
    struct {
      __IM  uint32_t RDR        : 9;            /*!< [8..0] desc RDR                                                           */
    } RDR_f;
  } ;
  
  union {
    __OM  uint32_t TDR;                         /*!< (@ 0x00000028) Data reg for write                                         */
    
    struct {
      __OM  uint32_t TDR        : 9;            /*!< [8..0] desc TDR                                                           */
      __OM  uint32_t IDLE       : 1;            /*!< [9..9] desc IDLE                                                          */
      __OM  uint32_t BREAK      : 1;            /*!< [10..10] desc BREAK                                                       */
    } TDR_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t ADDR;                        /*!< (@ 0x00000030) Slave addr                                                 */
    
    struct {
      __IOM uint32_t ADDR       : 8;            /*!< [7..0] desc ADDR                                                          */
    } ADDR_f;
  } ;
  
  union {
    __IOM uint32_t MASK;                        /*!< (@ 0x00000034) Slave addr mask                                            */
    
    struct {
      __IOM uint32_t MASK       : 8;            /*!< [7..0] desc MASK                                                          */
    } MASK_f;
  } ;
  
  union {
    __IOM uint32_t CR3;                         /*!< (@ 0x00000038) Control register3                                          */
    
    struct {
      __IOM uint32_t DEM        : 1;            /*!< [0..0] desc DEM                                                           */
      __IOM uint32_t DEP        : 1;            /*!< desc DEP                                                                  */
      __IOM uint32_t DETIME     : 5;            /*!< [6..2] desc DETIME                                                        */
      __IOM uint32_t LIN        : 1;            /*!< [7..7] desc LIN                                                           */
      __IOM uint32_t BRKL       : 1;            /*!< [8..8] desc BRKL                                                          */
    } CR3_f;
  } ;
  
  union {
    __IOM uint32_t RXMATCH;                     /*!< (@ 0x0000003C) desc RXMATCH                                               */
    
    struct {
      __IOM uint32_t RXMATCH    : 9;            /*!< [8..0] desc RXMATCH                                                       */
    } RXMATCH_f;
  } ;
} UART_TypeDef;                                    /*!< Size = 64 (0x40)                                                          */



/* =========================================================================================================================== */
/* ================                                            LVD                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc LVD (LVD)
  */

typedef struct {                                /*!< (@ 0x400000A4) LVD Structure                                              */
  
  union {
    __IOM uint32_t CR0;                         /*!< (@ 0x00000000) Control register0                                          */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t ACTION     : 1;            /*!< [1..1] desc ACTION                                                        */
      __IOM uint32_t SOURCE     : 1;            /*!< [2..2] desc SOURCE                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t VTH        : 3;            /*!< [6..4] desc VTH                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t FLTCLK     : 1;            /*!< [8..8] desc FLTCLK                                                        */
    } CR0_f;
  } ;
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000004) Control register1                                          */
    
