damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t IE         : 1;            /*!< [0..0] desc IE                                                            */
      __IOM uint32_t LEVEL      : 1;            /*!< [1..1] desc LEVEL                                                         */
      __IOM uint32_t RISE       : 1;            /*!< [2..2] desc RISE                                                          */
      __IOM uint32_t FALL       : 1;            /*!< [3..3] desc FALL                                                          */
      __IOM uint32_t FLTTIME    : 4;            /*!< [7..4] desc FLTTIME                                                       */
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< (@ 0x00000008) status register                                            */
    
    struct {
      __IOM uint32_t INTF       : 1;            /*!< [0..0] desc INTF                                                          */
      __IM  uint32_t FLTV       : 1;            /*!< [1..1] desc FLTV                                                          */
    } SR_f;
  } ;
} LVD_TypeDef;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           OPA1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc OPA1 (OPA1)
  */

typedef struct {                                /*!< (@ 0x400000B0) OPA1 Structure                                             */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) Control register0                                          */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t MODE       : 2;            /*!< [2..1] desc MODE                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t INP1EN     : 1;            /*!< [4..4] desc PCH1EN                                                        */
      __IOM uint32_t INP2EN     : 1;            /*!< [5..5] desc PCH2EN                                                        */
      __IOM uint32_t INP3EN     : 1;            /*!< [6..6] desc PCH3EN                                                        */
      __IOM uint32_t INP4EN     : 1;            /*!< [7..7] desc PCH4EN                                                        */
      __IOM uint32_t INN1EN     : 1;            /*!< [8..8] desc NCH1EN                                                        */
      __IOM uint32_t INN2EN     : 1;            /*!< [9..9] desc NCH2EN                                                        */
      __IOM uint32_t AMP       : 3;            /*!< [12..10] desc GAIN                                                        */
      __IOM uint32_t BIAS       : 3;            /*!< [15..13] desc BIAS                                                        */
    } CR_f;
  } ;
  
  union {
    __IOM uint32_t CAL;                         /*!< (@ 0x00000004) Control register1                                          */
    
    struct {
      __IOM uint32_t CALEN      : 1;            /*!< [0..0] desc AZEN                                                          */
      __IOM uint32_t CALMODE    : 1;            /*!< [1..1] desc MODE                                                          */
      __IOM uint32_t START      : 1;            /*!< [2..2] desc START                                                         */
      __IOM uint32_t SOFTTRIG   : 1;            /*!< [3..3] desc SOFTTRIG                                                      */
      __IOM uint32_t CALPERIOD  : 4;            /*!< [7..4] desc PERIOD                                                        */
      __IOM uint32_t ADCSTART   : 1;            /*!< desc ADCSTART                                                             */
            uint32_t            : 1;
      __IM  uint32_t AZRUN      : 1;            /*!< [10..10] desc AZRUN                                                       */
      __IOM uint32_t CLKDIV     : 3;            /*!< [13..11] desc CLKDIV                                                      */
      __IOM uint32_t ADC1START1 : 1;            /*!< [14..14] desc ADC1START1                                                  */
      __IOM uint32_t ADC2START1 : 1;            /*!< [15..15] desc ADC2START1                                                  */
      __IOM uint32_t ATIM1TRGO  : 1;            /*!< [16..16] desc ATIM1TRGO                                                   */
      __IOM uint32_t ATIM1OC4   : 1;          /*!< [17..17] desc ATIM1OC4REFC                                                */
      __IOM uint32_t ATIM1OC5   : 1;          /*!< [18..18] desc ATIM1OC5REFC                                                */
      __IOM uint32_t ATIM1OC6   : 1;          /*!< [19..19] desc ATIM1OC6REFC                                                */
      __IOM uint32_t GTIM1TRGO  : 1;            /*!< [20..20] desc GTIM1TRGO                                                   */
      __IOM uint32_t GTIM1OC1   : 1;          /*!< [21..21] desc GTIM1OC1REFC                                                */
      __IOM uint32_t GTIM1OC2   : 1;          /*!< [22..22] desc GTIM1OC2REFC                                                */
      __IOM uint32_t GTIM2TRGO  : 1;            /*!< [23..23] desc GTIM2TRGO                                                   */
      __IOM uint32_t GTIM2OC1   : 1;          /*!< [24..24] desc GTIM2OC1REFC                                                */
      __IOM uint32_t GTIM2OC2   : 1;          /*!< [25..25] desc GTIM2OC2REFC                                                */
      __IOM uint32_t GTIM3TRGO  : 1;            /*!< [26..26] desc GTIM3TRGO                                                   */
      __IOM uint32_t GTIM3OC1   : 1;          /*!< [27..27] desc GTIM3OC1REFC                                                */
      __IOM uint32_t GTIM3OC2   : 1;          /*!< [28..28] desc GTIM3OC2REFC                                                */
      __IOM uint32_t GTIM4TRGO  : 1;            /*!< [29..29] desc GTIM4TRGO                                                   */
      __IOM uint32_t GTIM4OC1   : 1;          /*!< [30..30] desc GTIM4OC1REFC                                                */
      __IOM uint32_t GTIM4OC2   : 1;          /*!< [31..31] desc GTIM4OC2REFC                                                */
    } CAL_f;
  } ;
} OPA_TypeDef;                                     /*!< Size = 8 (0x8)                                                            */


/* =========================================================================================================================== */
/* ================                                            RAM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc RAM (RAM)
  */

typedef struct {                                /*!< (@ 0x40022400) RAM Structure                                              */
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000000) Interrupt enable register                                  */
    
