damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t PARITY     : 1;            /*!< [0..0] desc PARITY                                                        */
    } IER_f;
  } ;
  
  union {
    __IM  uint32_t ADDR;                        /*!< (@ 0x00000004) Error address register                                     */
    
    struct {
      __IM  uint32_t ADDR       : 32;           /*!< [31..0] desc ADDR                                                         */
    } ADDR_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000008) Interrupt status register                                  */
    
    struct {
      __IM  uint32_t PARITY     : 1;            /*!< [0..0] desc PARITY                                                        */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x0000000C) Interrupt flag clear register                              */
    
    struct {
      __IOM uint32_t PARITY     : 1;            /*!< [0..0] desc PARITY                                                        */
    } ICR_f;
  } ;
} RAM_TypeDef;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc RTC (RTC)
  */

typedef struct {                                /*!< (@ 0x40004400) RTC Structure                                              */
  
  union {
    __OM  uint32_t KEY;                         /*!< (@ 0x00000000) desc KEY                                                   */
    
    struct {
      __OM  uint32_t KEY        : 8;            /*!< [7..0] desc KEY                                                           */
    } KEY_f;
  } ;
  
  union {
    __IOM uint32_t CR0;                         /*!< (@ 0x00000004) desc CR0                                                   */
    
    struct {
      __IOM uint32_t INTERVAL   : 3;            /*!< [2..0] desc INTERVAL                                                      */
      __IOM uint32_t H24        : 1;            /*!< [3..3] desc H24                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t RTC1HZ     : 2;            /*!< [6..5] desc RTC1HZ                                                        */
      __IOM uint32_t START      : 1;            /*!< [7..7] desc START                                                         */
    } CR0_f;
  } ;
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000008) desc CR1                                                   */
    
    struct {
      __IM  uint32_t            : 2;
      __IM  uint32_t WAIT       : 1;            /*!< [2..2] desc WAIT                                                          */
      __IM  uint32_t            : 5;
      __IOM uint32_t SOURCE     : 3;            /*!< [10..8] desc SOURCE                                                       */
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x0000000C) desc CR2                                                   */
    
    struct {
      __IOM uint32_t AWTPRS     : 2;            /*!< [1..0] desc AWTPRS                                                        */
      __IOM uint32_t AWTSRC     : 1;            /*!< [2..2] desc AWTSRC                                                        */
      __IOM uint32_t TAMPEDGE   : 1;            /*!< [3..3] desc TAMPEDGE                                                      */
      __IOM uint32_t RTCOUT     : 2;            /*!< [5..4] desc RTCOUT                                                        */
      __IOM uint32_t TAMPEN     : 1;            /*!< [6..6] desc TAMPEN                                                        */
      __IOM uint32_t AWTEN      : 1;            /*!< [7..7] desc AWTEN                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t ALARMAEN   : 1;            /*!< [9..9] desc ALARMAEN                                                      */
      __IOM uint32_t ALARMBEN   : 1;            /*!< [10..10] desc ALARMBEN                                                    */
    } CR2_f;
  } ;
  
  union {
    __IOM uint32_t COMPCFR1;                    /*!< (@ 0x00000010) desc COMPCFR1                                              */
    
    struct {
      __IOM uint32_t COMP       : 12;           /*!< [11..0] desc COMP                                                         */
      __IOM uint32_t PERIOD     : 2;            /*!< [13..12] desc PERIOD                                                      */
      __IOM uint32_t SIGN       : 1;            /*!< [14..14] desc SIGN                                                        */
      __IOM uint32_t EN         : 1;            /*!< [15..15] desc EN                                                          */
    } COMPCFR1_f;
  } ;
  
  union {
    __IOM uint32_t DATE;                        /*!< (@ 0x00000014) desc DATE                                                  */
    
    struct {
      __IOM uint32_t DAY        : 6;            /*!< [7..0] desc DAY                                                           */
            uint32_t            : 2;
      __IOM uint32_t MONTH      : 5;            /*!< [15..8] desc MONTH                                                        */
            uint32_t            : 3;
      __IOM uint32_t YEAR       : 8;            /*!< [23..16] desc YEAR                                                        */
      __IOM uint32_t WEEK       : 3;            /*!< [26..24] desc WEEK                                                        */
    } DATE_f;
  } ;
  
  union {
    __IOM uint32_t TIME;                        /*!< (@ 0x00000018) desc TIME                                                  */
    
