damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t ALARMA     : 1;            /*!< [0..0] desc ALARMA                                                        */
      __IOM uint32_t ALARMB     : 1;            /*!< [1..1] desc ALARMB                                                        */
      __IOM uint32_t AWTIMER    : 1;            /*!< [2..2] desc AWTIMER                                                       */
      __IOM uint32_t TAMP       : 1;            /*!< [3..3] desc TAMP                                                          */
      __IOM uint32_t TAMPOV     : 1;            /*!< [4..4] desc TAMPOV                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t INTERVAL   : 1;            /*!< [6..6] desc INTERVAL                                                      */
    } ICR_f;
  } ;
  
  union {
    __IM  uint32_t AWTCNT;                      /*!< (@ 0x0000003C) desc AWTCNT                                                */
    
    struct {
      __IM  uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
    } AWTCNT_f;
  } ;
  
  union {
    __IOM uint32_t PSC;                         /*!< (@ 0x00000040) desc PSC                                                   */
    
    struct {
      __IOM uint32_t PSC2       : 20;           /*!< [19..0] desc PSC2                                                         */
      __IOM uint32_t PSC1       : 8;            /*!< [27..20] desc PSC1                                                        */
    } PSC_f;
  } ;
  
  union {
    __IM  uint32_t SSCNT;                       /*!< (@ 0x00000044) desc SSCNT                                                 */
    
    struct {
      __IM  uint32_t SSCNT0     : 20;           /*!< [19..0] desc SSCNT0                                                       */
      __IM  uint32_t SSCNT1     : 1;            /*!< [20..20] desc SSCNT1                                                      */
    } SSCNT_f;
  } ;
} RTC_TypeDef;                                  /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc SPI1 (SPI1)
  */

typedef struct {                                /*!< (@ 0x40000800) SPI1 Structure                                             */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register1                                          */
    
    struct {
      __IOM uint32_t MSTR       : 1;            /*!< [0..0] desc MSTR                                                          */
      __IOM uint32_t SSM        : 1;            /*!< [1..1] desc SSM                                                           */
      __IOM uint32_t CPHA       : 1;            /*!< [2..2] desc CPHA                                                          */
      __IOM uint32_t CPOL       : 1;            /*!< [3..3] desc CPOL                                                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t LSBF       : 1;            /*!< [7..7] desc LSBF                                                          */
      __IOM uint32_t WIDTH      : 4;            /*!< [11..8] desc WIDTH                                                        */
      __IOM uint32_t GAP        : 4;            /*!< [15..12] desc GAP                                                         */
      __IOM uint32_t MODE       : 2;            /*!< [17..16] desc MODE                                                        */
      __IOM uint32_t FLTEN      : 1;            /*!< [18..18] desc FLTEN                                                       */
      __IOM uint32_t MISOHD     : 1;            /*!< [19..19] desc MISOHD                                                      */
      __IOM uint32_t SMP        : 1;            /*!< [20..20] desc SMP                                                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t BR         : 7;            /*!< [30..24] desc BR                                                          */
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control register2                                          */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t DMARX      : 1;            /*!< [1..1] desc DMARX                                                         */
      __IOM uint32_t DMATX      : 1;            /*!< [2..2] desc DMATX                                                         */
    } CR2_f;
  } ;
  
  union {
    __IOM uint32_t CR3;                         /*!< (@ 0x00000008) desc CR3                                                   */
    
    struct {
      __IOM uint32_t HDOE       : 1;            /*!< [0..0] desc HDOE                                                          */
    } CR3_f;
  } ;
  
  union {
    __IOM uint32_t SSI;                         /*!< (@ 0x0000000C) Slave slect register                                       */
    
    struct {
      __IOM uint32_t SSI        : 1;            /*!< [0..0] desc SSI                                                           */
    } SSI_f;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000010) Interrupt enable register                                  */
    
    struct {
      __IOM uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IOM uint32_t RXNE       : 1;            /*!< [1..1] desc RXNE                                                          */
      __IOM uint32_t SSF        : 1;            /*!< [2..2] desc SSF                                                           */
      __IOM uint32_t SSR        : 1;            /*!< [3..3] desc SSR                                                           */
      __IOM uint32_t UD         : 1;            /*!< [4..4] desc UD                                                            */
      __IOM uint32_t OV         : 1;            /*!< [5..5] desc OV                                                            */
      __IOM uint32_t SSERR      : 1;            /*!< [6..6] desc SSERR                                                         */
      __IOM uint32_t MODF       : 1;            /*!< [7..7] desc MODF                                                          */
    } IER_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000014) Interrupt status register                                  */
    
