damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t TRIM       : 9;            /*!< [8..0] desc TRIM                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t WAITCYCLE  : 2;            /*!< [11..10] desc WAITCYCLE                                                   */
      __IM  uint32_t            : 3;
      __IM  uint32_t STABLE     : 1;            /*!< [15..15] desc STABLE                                                      */
    } LSI_f;
  } ;
  
  union {
    __IOM uint32_t LSE;                         /*!< (@ 0x00000024) LSE Control Reg                                            */
    
    struct {
      __IOM uint32_t DRIVER     : 4;            /*!< [3..0] desc DRIVER                                                        */
      __IOM uint32_t WAITCYCLE  : 2;            /*!< [5..4] desc WAITCYCLE                                                     */
      __IOM uint32_t MODE       : 1;            /*!< [6..6] desc MODE                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t PDRIVER    : 4;            /*!< [11..8] desc PDRIVER                                                      */
      __IM  uint32_t            : 5;
      __IOM uint32_t PINLOCK    : 1;            /*!< [17..17] desc PINLOCK                                                     */
      __IM  uint32_t STABLE     : 1;            /*!< [18..18] desc STABLE                                                      */
    } LSE_f;
  } ;
  
  union {
    __IOM uint32_t PLL;                         /*!< (@ 0x00000028) PLL Control Reg                                            */
    
    struct {
      __IOM uint32_t SOURCE     : 1;            /*!< [0..0] desc SOURCE                                                        */
      __IOM uint32_t DIV        : 4;            /*!< [4..1] desc DIV                                                           */
      __IOM uint32_t WAITCYCLE  : 3;            /*!< [7..5] desc WAITCYCLE                                                     */
      __IOM uint32_t MUL        : 8;            /*!< [15..8] desc MUL                                                          */
      __IM  uint32_t STABLE     : 1;            /*!< [16..16] desc STABLE                                                      */
    } PLL_f;
  } ;
  
  union {
    __IOM uint32_t DEBUG;                       /*!< (@ 0x0000002C) Debug Control Reg                                          */
    
    struct {
      __IOM uint32_t ATIM       : 1;            /*!< [0..0] desc ATIM                                                          */
      __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
      __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
      __IOM uint32_t GTIM3      : 1;            /*!< [3..3] desc GTIM3                                                         */
      __IOM uint32_t GTIM4      : 1;            /*!< [4..4] desc GTIM4                                                         */
      __IOM uint32_t BTIM123    : 1;            /*!< [5..5] desc BTIM123                                                       */
      __IOM uint32_t LPTIM      : 1;            /*!< [6..6] desc LPTIM                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t RTC        : 1;            /*!< [8..8] desc RTC                                                           */
      __IOM uint32_t IWDT       : 1;            /*!< [9..9] desc IWDT                                                          */
      __IOM uint32_t WWDT       : 1;            /*!< [10..10] desc WWDT                                                        */
      __IOM uint32_t HALLTIM    : 1;            /*!< [11..11] desc HALLTIM                                                     */
    } DEBUG_f;
  } ;
  
  union {
    __IOM uint32_t AHBEN;                       /*!< (@ 0x00000030) AHB Clock Control Reg                                      */
    
    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] desc DMA                                                           */
      __IOM uint32_t FLASH      : 1;            /*!< [1..1] desc FLASH                                                         */
      __IOM uint32_t CRC        : 1;            /*!< [2..2] desc CRC                                                           */
      __IOM uint32_t EAU        : 1;            /*!< [3..3] desc EAU                                                           */
      __IOM uint32_t GPIOA      : 1;            /*!< [4..4] desc GPIOA                                                         */
      __IOM uint32_t GPIOB      : 1;            /*!< [5..5] desc GPIOB                                                         */
      __IOM uint32_t GPIOC      : 1;            /*!< [6..6] desc GPIOC                                                         */
      __IOM uint32_t GPIOF      : 1;            /*!< [7..7] desc GPIOF                                                         */
      __IOM uint32_t CORDIC     : 1;            /*!< [8..8] desc CORDIC                                                        */
      __IM  uint32_t            : 7;
      __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
    } AHBEN_f;
  } ;
  
  union {
    __IOM uint32_t APBEN2;                      /*!< (@ 0x00000034) APB Clock Control Reg2                                     */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t RTC        : 1;            /*!< [1..1] desc RTC                                                           */
      __IOM uint32_t BTIM123    : 1;            /*!< [2..2] desc BTIM123                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t IWDT       : 1;            /*!< [4..4] desc IWDT                                                          */
      __IOM uint32_t WWDT       : 1;            /*!< [5..5] desc WWDT                                                          */
      __IOM uint32_t I2C1       : 1;            /*!< [6..6] desc I2C1                                                          */
      __IOM uint32_t LPTIM      : 1;            /*!< [7..7] desc LPTIM                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t OPA        : 1;            /*!< [9..9] desc OPA                                                           */
      __IOM uint32_t DAC        : 1;            /*!< [10..10] desc DAC                                                         */
      __IOM uint32_t I2C2       : 1;            /*!< [11..11] desc I2C2                                                        */
      __IOM uint32_t HALLTIM    : 1;            /*!< [12..12] desc HALLTIM                                                     */
      __IM  uint32_t            : 3;
      __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
    } APBEN2_f;
  } ;
  
  union {
    __IOM uint32_t APBEN1;                      /*!< (@ 0x00000038) APB Clock Control Reg1                                     */
    
