damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t ADC        : 1;            /*!< [0..0] desc ADC                                                           */
      __IOM uint32_t VC         : 1;            /*!< [1..1] desc VC                                                            */
      __IOM uint32_t SPI1       : 1;            /*!< [2..2] desc SPI1                                                          */
      __IOM uint32_t UART1      : 1;            /*!< [3..3] desc UART1                                                         */
      __IOM uint32_t UART2      : 1;            /*!< [4..4] desc UART2                                                         */
      __IOM uint32_t ATIM       : 1;            /*!< [5..5] desc ATIM                                                          */
      __IOM uint32_t GTIM1      : 1;            /*!< [6..6] desc GTIM1                                                         */
      __IOM uint32_t GTIM2      : 1;            /*!< [7..7] desc GTIM2                                                         */
      __IOM uint32_t UART3      : 1;            /*!< [8..8] desc UART3                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t GTIM3      : 1;            /*!< [11..11] desc GTIM3                                                       */
      __IOM uint32_t GTIM4      : 1;            /*!< [12..12] desc GTIM4                                                       */
      __IOM uint32_t SPI2       : 1;            /*!< [13..13] desc SPI2                                                        */
      __IOM uint32_t SPI3       : 1;            /*!< [14..14] desc SPI3                                                        */
      __IM  uint32_t            : 1;
      __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
    } APBEN1_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t AHBRST;                      /*!< (@ 0x00000040) AHB Reset Control Reg                                      */
    
    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] desc DMA                                                           */
      __IOM uint32_t FLASH      : 1;            /*!< [1..1] desc FLASH                                                         */
      __IOM uint32_t CRC        : 1;            /*!< [2..2] desc CRC                                                           */
      __IOM uint32_t EAU        : 1;            /*!< [3..3] desc EAU                                                           */
      __IOM uint32_t GPIOA      : 1;            /*!< [4..4] desc GPIOA                                                         */
      __IOM uint32_t GPIOB      : 1;            /*!< [5..5] desc GPIOB                                                         */
      __IOM uint32_t GPIOC      : 1;            /*!< [6..6] desc GPIOC                                                         */
      __IOM uint32_t GPIOF      : 1;            /*!< [7..7] desc GPIOF                                                         */
      __IOM uint32_t CORDIC     : 1;            /*!< [8..8] desc CORDIC                                                        */
    } AHBRST_f;
  } ;
  
  union {
    __IOM uint32_t APBRST2;                     /*!< (@ 0x00000044) APB Reset Control Reg2                                     */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t RTC        : 1;            /*!< [1..1] desc RTC                                                           */
      __IOM uint32_t BTIM123    : 1;            /*!< [2..2] desc BTIM123                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t IWDT       : 1;            /*!< [4..4] desc IWDT                                                          */
      __IOM uint32_t WWDT       : 1;            /*!< [5..5] desc WWDT                                                          */
      __IOM uint32_t I2C1       : 1;            /*!< [6..6] desc I2C1                                                          */
      __IOM uint32_t LPTIM      : 1;            /*!< [7..7] desc LPTIM                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t OPA        : 1;            /*!< [9..9] desc OPA                                                           */
      __IOM uint32_t DAC        : 1;            /*!< [10..10] desc DAC                                                         */
      __IOM uint32_t I2C2       : 1;            /*!< [11..11] desc I2C2                                                        */
      __IOM uint32_t HALLTIM    : 1;            /*!< [12..12] desc HALLTIM                                                     */      
    } APBRST2_f;
  } ;
  
  union {
    __IOM uint32_t APBRST1;                     /*!< (@ 0x00000048) APB Reset Control Reg1                                     */
    
    struct {
      __IOM uint32_t ADC        : 1;            /*!< [0..0] desc ADC                                                           */
      __IOM uint32_t VC         : 1;            /*!< [1..1] desc VC                                                            */
      __IOM uint32_t SPI1       : 1;            /*!< [2..2] desc SPI1                                                          */
      __IOM uint32_t UART1      : 1;            /*!< [3..3] desc UART1                                                         */
      __IOM uint32_t UART2      : 1;            /*!< [4..4] desc UART2                                                         */
      __IOM uint32_t ATIM       : 1;            /*!< [5..5] desc ATIM                                                          */
      __IOM uint32_t GTIM1      : 1;            /*!< [6..6] desc GTIM1                                                         */
      __IOM uint32_t GTIM2      : 1;            /*!< [7..7] desc GTIM2                                                         */
      __IOM uint32_t UART3      : 1;            /*!< [8..8] desc UART3                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t GTIM3      : 1;            /*!< [11..11] desc GTIM3                                                       */
      __IOM uint32_t GTIM4      : 1;            /*!< [12..12] desc GTIM4                                                       */
      __IOM uint32_t SPI2       : 1;            /*!< [13..13] desc SPI2                                                        */
      __IOM uint32_t SPI3       : 1;            /*!< [14..14] desc SPI3                                                        */
    } APBRST1_f;
  } ;
  
  union {
    __IOM uint32_t RESETFLAG;                   /*!< (@ 0x0000004C) Reset Status Reg                                           */
    
