damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t POR        : 1;            /*!< [0..0] desc POR                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t LVD        : 1;            /*!< [3..3] desc LVD                                                           */
      __IOM uint32_t IWDT       : 1;            /*!< [4..4] desc IWDT                                                          */
      __IOM uint32_t WWDT       : 1;            /*!< [5..5] desc WWDT                                                          */
      __IOM uint32_t RSTB       : 1;            /*!< [6..6] desc RSTB                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t LOCKUP     : 1;            /*!< [8..8] desc LOCKUP                                                        */
      __IOM uint32_t SYSRESETREQ : 1;           /*!< [9..9] desc SYSRESETREQ                                                   */
    } RESETFLAG_f;
  } ;
  __IM  uint32_t  RESERVED1[8];
  
  union {
    __IOM uint32_t MCO;                         /*!< (@ 0x00000070) Master Clock Output Control Reg                            */
    
    struct {
      __IOM uint32_t SOURCE     : 4;            /*!< [3..0] desc SOURCE                                                        */
      __IOM uint32_t DIV        : 4;            /*!< [7..4] desc DIV                                                           */
    } MCO_f;
  } ;
} SYSCTRL_TypeDef;                                 /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                            VC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc VC1 (VC1)
  */

typedef struct {                                /*!< (@ 0x40000084) VC1 Structure                                              */
  
  union {
    __IOM uint32_t CR0;                         /*!< (@ 0x00000000) Control register0                                          */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t RESP       : 1;            /*!< [1..1] desc RESP                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYS        : 1;            /*!< [3..3] desc HYS                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t IE         : 1;            /*!< [5..5] desc IE                                                            */
      __IOM uint32_t POL        : 1;            /*!< [6..6] desc POL                                                           */
      __IOM uint32_t WINDOW     : 1;            /*!< [7..7] desc WINDOW                                                        */
      __IOM uint32_t INN        : 2;            /*!< [9..8] desc INN                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t INP        : 2;            /*!< [13..12] desc INP                                                         */
    } CR0_f;
  } ;
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000004) Control register1                                          */
    
    struct {
      __IOM uint32_t FLTTIME    : 4;            /*!< [3..0] desc FLTTIME                                                       */
      __IOM uint32_t FLTCLK     : 1;            /*!< [4..4] desc FLTCLK                                                        */
      __IOM uint32_t FALLIE     : 1;            /*!< [5..5] desc FALLIE                                                        */
      __IOM uint32_t RISEIE     : 1;            /*!< [6..6] desc RISEIE                                                        */
      __IOM uint32_t HIGHIE     : 1;            /*!< [7..7] desc HIGHIE                                                        */
      __IOM uint32_t BLANKTIME  : 3;            /*!< [10..8] desc BLANKTIME                                                    */
      __IOM uint32_t BLANKLVL   : 1;            /*!< [11..11] desc BLANKLVL                                                    */
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000008) Control register1                                          */
    
    struct {
      __IOM uint32_t ATIMTRGO     : 1;          /*!< [0..0] desc ATIM1TRGO                                                     */
      __IOM uint32_t ATIMTRGO2    : 1;          /*!< [1..1] desc ATIM1TRGO2                                                    */
      __IOM uint32_t ATIMOC1REFC  : 1;          /*!< [2..2] desc ATIM1OC1REFC                                                  */
      __IOM uint32_t ATIMOC2REFC  : 1;          /*!< [3..3] desc ATIM1OC2REFC                                                  */
      __IOM uint32_t ATIMOC3REFC  : 1;          /*!< [4..4] desc ATIM1OC3REFC                                                  */
      __IOM uint32_t ATIMOC4REFC  : 1;          /*!< [5..5] desc ATIM1OC4REFC                                                  */
      __IOM uint32_t ATIMOC5REFC  : 1;          /*!< [6..6] desc ATIM1OC5REFC                                                  */
      __IOM uint32_t ATIMOC6REFC  : 1;          /*!< [7..7] desc ATIM1OC6REFC                                                  */
      __IOM uint32_t GTIM1TRGO    : 1;          /*!< [8..8] desc GTIM1TRGO                                                     */
      __IOM uint32_t GTIM1OC1REFC : 1;          /*!< [9..9] desc GTIM1OC1REFC                                                  */
      __IOM uint32_t GTIM1OC2REFC : 1;          /*!< [10..10] desc GTIM1OC2REFC                                                */
      __IOM uint32_t GTIM1OC3REFC : 1;          /*!< [11..11] desc GTIM1OC3REFC                                                */
      __IOM uint32_t GTIM1OC4REFC : 1;          /*!< [12..12] desc GTIM1OC4REFC                                                */
      __IOM uint32_t GTIM2TRGO    : 1;          /*!< [13..13] desc GTIM2TRGO                                                   */
      __IOM uint32_t GTIM2OC1REFC : 1;          /*!< [14..14] desc GTIM2OC1REFC                                                */
      __IOM uint32_t GTIM2OC2REFC : 1;          /*!< [15..15] desc GTIM2OC2REFC                                                */
      __IOM uint32_t GTIM2OC3REFC : 1;          /*!< [16..16] desc GTIM2OC3REFC                                                */
      __IOM uint32_t GTIM2OC4REFC : 1;          /*!< [17..17] desc GTIM2OC4REFC                                                */
      __IOM uint32_t GTIM3TRGO    : 1;          /*!< [18..18] desc GTIM3TRGO                                                   */
      __IOM uint32_t GTIM3OC1REFC : 1;          /*!< [19..19] desc GTIM3OC1REFC                                                */
      __IOM uint32_t GTIM3OC2REFC : 1;          /*!< [20..20] desc GTIM3OC2REFC                                                */
      __IOM uint32_t GTIM3OC3REFC : 1;          /*!< [21..21] desc GTIM3OC3REFC                                                */
      __IOM uint32_t GTIM3OC4REFC : 1;          /*!< [22..22] desc GTIM3OC4REFC                                                */
      __IOM uint32_t GTIM4TRGO    : 1;          /*!< [23..23] desc GTIM4TRGO                                                   */
      __IOM uint32_t GTIM4OC1REFC : 1;          /*!< [24..24] desc GTIM4OC1REFC                                                */
      __IOM uint32_t GTIM4OC2REFC : 1;          /*!< [25..25] desc GTIM4OC2REFC                                                */
      __IOM uint32_t GTIM4OC3REFC : 1;          /*!< [26..26] desc GTIM4OC3REFC                                                */
      __IOM uint32_t GTIM4OC4REFC : 1;          /*!< [27..27] desc GTIM4OC4REFC                                                */
      __IOM uint32_t BTIM1TRGO    : 1;          /*!< [28..28] desc BTIM1TRGO                                                   */
      __IOM uint32_t BTIM2TRGO    : 1;          /*!< [29..29] desc BTIM2TRGO                                                   */
      __IOM uint32_t BTIM3TRGO    : 1;          /*!< [30..30] desc BTIM3TRGO                                                   */
      __IOM uint32_t HALLTIM1TRGO : 1;          /*!< [31..31] desc HALLTIM1TRGO                                                */
    } CR2_f;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< (@ 0x0000000C) Status register                                            */
    
