damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
    struct {
      __IOM uint32_t INTF       : 1;            /*!< [0..0] desc INTF                                                          */
      __IM  uint32_t FLTV       : 1;            /*!< [1..1] desc FLTV                                                          */
    } SR_f;
  } ;
} VC_TypeDef;                                      /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                          VC12REF                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief desc VC12REF (VC12REF)
  */

typedef struct {                                /*!< (@ 0x40000080) VC12REF Structure                                          */
  
  union {
    __IOM uint32_t REF;                         /*!< (@ 0x00000000) VCREF Control register                                     */
    
    struct {
      __IOM uint32_t DIV        : 3;            /*!< [2..0] desc DIV                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t EN         : 1;            /*!< [4..4] desc EN                                                            */
      __IOM uint32_t VIN        : 1;            /*!< [5..5] desc VIN                                                           */
    } REF_f;
  } ;
} VCREF_TypeDef;                                  /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           WWDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc WWDT (WWDT)
  */

typedef struct {                                /*!< WWDT Structure                                                            */
  
  union {
    __IOM uint32_t CR0;                         /*!< Control register0                                                         */
    
    struct {
      __IOM uint32_t WCNT       : 7;            /*!< desc WCNT                                                                 */
      __IOM uint32_t EN         : 1;            /*!< desc EN                                                                   */
    } CR0_f;
  } ;
  
  union {
    __IOM uint32_t CR1;                         /*!< Control register1                                                         */
    
    struct {
      __IOM uint32_t WINR       : 7;            /*!< desc WINR                                                                 */
      __IOM uint32_t PRS        : 3;            /*!< desc PRESCALE                                                             */
      __IOM uint32_t IE         : 1;            /*!< desc IE                                                                   */
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< status register                                                           */
    
    struct {
      __IOM uint32_t POV        : 1;            /*!< desc POV                                                                  */
    } SR_f;
  } ;
} WWDT_TypeDef;                                  /*!< Size = 12 (0xc)                                                           */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define ADC1_BASE                   0x40000000UL
#define ADC2_BASE                   0x40000100UL
#define ATIM_BASE                   0x40001400UL
#define BGR_BASE                    0x400000FCUL
#define BTIM1_BASE                  0x40004800UL
#define BTIM2_BASE                  0x40004840UL
#define BTIM3_BASE                  0x40004880UL
#define CORDIC_BASE                 0x40023400UL
#define CRC_BASE                    0x40023000UL
#define DAC_BASE                    0x400000C0UL
#define DMA_BASE                    0x40020000UL
#define DMACHANNEL1_BASE            0x40020020UL
#define DMACHANNEL2_BASE            0x40020040UL
#define DMACHANNEL3_BASE            0x40020060UL
#define DMACHANNEL4_BASE            0x40020080UL
#define EAU_BASE                    0x40023200UL
#define FLASH_BASE                  0x40022000UL
#define GPIOA_BASE                  0x48000000UL
#define GPIOB_BASE                  0x48000100UL
#define GPIOC_BASE                  0x48000200UL
#define GPIOF_BASE                  0x48000300UL
#define GTIM1_BASE                  0x40001800UL
#define GTIM2_BASE                  0x40001C00UL
#define GTIM3_BASE                  0x40002400UL
#define GTIM4_BASE                  0x40002800UL
#define HALLTIM_BASE                0x40006400UL
#define I2C1_BASE                   0x40005800UL
#define I2C2_BASE                   0x40005C00UL
#define IRMOD_BASE                  0x40004080UL
#define IWDT_BASE                   0x40005000UL
#define LPTIM_BASE                  0x40006000UL
#define UART1_BASE                  0x40000C00UL
#define UART2_BASE                  0x40001000UL
#define UART3_BASE                  0x40002000UL
#define LVD_BASE                    0x400000A4UL
#define OPA1_BASE                   0x400000B0UL
#define OPA2_BASE                   0x400000B8UL
#define RAM_BASE                    0x40022400UL
#define RTC_BASE                    0x40004400UL
#define SPI1_BASE                   0x40000800UL
#define SPI2_BASE                   0x40000400UL
#define SPI3_BASE                   0x40003400UL
#define SYSCTRL_BASE                0x40004000UL
#define VC1_BASE                    0x40000084UL
#define VC12REF_BASE                0x40000080UL
#define VC2_BASE                    0x40000094UL
#define VC3_BASE                    0x40000184UL
#define VC34REF_BASE                0x40000180UL
#define VC4_BASE                    0x40000194UL
#define WWDT_BASE                   0x40005400UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define CW_ADC1                        ((ADC_TypeDef*)               ADC1_BASE)
#define CW_ADC2                        ((ADC_TypeDef*)               ADC2_BASE)
#define CW_ATIM                        ((ATIM_TypeDef*)              ATIM_BASE)
#define CW_BGR                         ((BGR_TypeDef*)               BGR_BASE)
#define CW_BTIM1                       ((BTIM_TypeDef*)              BTIM1_BASE)
#define CW_BTIM2                       ((BTIM_TypeDef*)              BTIM2_BASE)
#define CW_BTIM3                       ((BTIM_TypeDef*)              BTIM3_BASE)
#define CW_CORDIC                      ((CORDIC_TypeDef*)            CORDIC_BASE)
#define CW_CRC                         ((CRC_TypeDef*)               CRC_BASE)
#define CW_DAC                         ((DAC_TypeDef*)               DAC_BASE)
#define CW_DMA                         ((DMA_TypeDef*)               DMA_BASE)
#define CW_DMACHANNEL1                 ((DMACHANNEL_TypeDef*)        DMACHANNEL1_BASE)
#define CW_DMACHANNEL2                 ((DMACHANNEL_TypeDef*)        DMACHANNEL2_BASE)
#define CW_DMACHANNEL3                 ((DMACHANNEL_TypeDef*)        DMACHANNEL3_BASE)
#define CW_DMACHANNEL4                 ((DMACHANNEL_TypeDef*)        DMACHANNEL4_BASE)
#define CW_EAU                         ((EAU_TypeDef*)               EAU_BASE)
#define CW_FLASH                       ((FLASH_TypeDef*)             FLASH_BASE)
#define CW_GPIOA                       ((GPIO_TypeDef*)              GPIOA_BASE)
#define CW_GPIOB                       ((GPIO_TypeDef*)              GPIOB_BASE)
#define CW_GPIOC                       ((GPIO_TypeDef*)              GPIOC_BASE)
#define CW_GPIOF                       ((GPIO_TypeDef*)              GPIOF_BASE)
#define CW_GTIM1                       ((GTIM_TypeDef*)              GTIM1_BASE)
#define CW_GTIM2                       ((GTIM_TypeDef*)              GTIM2_BASE)
#define CW_GTIM3                       ((GTIM_TypeDef*)              GTIM3_BASE)
#define CW_GTIM4                       ((GTIM_TypeDef*)              GTIM4_BASE)
#define CW_HALLTIM                     ((HALLTIM_TypeDef*)           HALLTIM_BASE)
#define CW_I2C1                        ((I2C_TypeDef*)               I2C1_BASE)
#define CW_I2C2                        ((I2C_TypeDef*)               I2C2_BASE)
#define CW_IRMOD                       ((IRMOD_TypeDef*)             IRMOD_BASE)
#define CW_IWDT                        ((IWDT_TypeDef*)              IWDT_BASE)
#define CW_LPTIM                       ((LPTIM_TypeDef*)             LPTIM_BASE)
#define CW_UART1                       ((UART_TypeDef*)              UART1_BASE)
#define CW_UART2                       ((UART_TypeDef*)              UART2_BASE)
#define CW_UART3                       ((UART_TypeDef*)              UART3_BASE)
#define CW_LVD                         ((LVD_TypeDef*)               LVD_BASE)
#define CW_OPA1                        ((OPA_TypeDef*)               OPA1_BASE)
#define CW_OPA2                        ((OPA_TypeDef*)               OPA2_BASE)
#define CW_RAM                         ((RAM_TypeDef*)               RAM_BASE)
#define CW_RTC                         ((RTC_TypeDef*)               RTC_BASE)
#define CW_SPI1                        ((SPI_TypeDef*)               SPI1_BASE)
#define CW_SPI2                        ((SPI_TypeDef*)               SPI2_BASE)
#define CW_SPI3                        ((SPI_TypeDef*)               SPI3_BASE)
#define CW_SYSCTRL                     ((SYSCTRL_TypeDef*)           SYSCTRL_BASE)
#define CW_VC1                         ((VC_TypeDef*)                VC1_BASE)
#define CW_VC12REF                     ((VCREF_TypeDef*)            VC12REF_BASE)
#define CW_VC2                         ((VC_TypeDef*)                VC2_BASE)
#define CW_VC3                         ((VC_TypeDef*)                VC3_BASE)
#define CW_VC34REF                     ((VCREF_TypeDef*)            VC34REF_BASE)
#define CW_VC4                         ((VC_TypeDef*)                VC4_BASE)
#define CW_WWDT                        ((WWDT_TypeDef*)              WWDT_BASE)

