damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define ADCx_CR_SLAVE_Pos                 (7UL)                     /*!< SLAVE (Bit 7)                                         */
#define ADCx_CR_SLAVE_Msk                 (0x80UL)                  /*!< SLAVE (Bitfield-Mask: 0x01)                           */
#define ADCx_CR_ENS_Pos                   (4UL)                     /*!< ENS (Bit 4)                                           */
#define ADCx_CR_ENS_Msk                   (0x70UL)                  /*!< ENS (Bitfield-Mask: 0x07)                             */
#define ADCx_CR_CLK_Pos                   (2UL)                     /*!< CLKSRC (Bit 2)                                        */
#define ADCx_CR_CLK_Msk                   (0xcUL)                   /*!< CLKSRC (Bitfield-Mask: 0x03)                          */
#define ADCx_CR_CONT_Pos                  (1UL)                     /*!< CONT (Bit 1)                                          */
#define ADCx_CR_CONT_Msk                  (0x2UL)                   /*!< CONT (Bitfield-Mask: 0x01)                            */
#define ADCx_CR_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define ADCx_CR_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  START  ========================================================= */
#define ADCx_START_START_Pos              (0UL)                     /*!< START (Bit 0)                                         */
#define ADCx_START_START_Msk              (0x1UL)                   /*!< START (Bitfield-Mask: 0x01)                           */
/* =========================================================  AWDTR  ========================================================= */
#define ADCx_AWDTR_VTH_Pos                (16UL)                    /*!< VTH (Bit 16)                                          */
#define ADCx_AWDTR_VTH_Msk                (0xfff0000UL)             /*!< VTH (Bitfield-Mask: 0xfff)                            */
#define ADCx_AWDTR_VTL_Pos                (0UL)                     /*!< VTL (Bit 0)                                           */
#define ADCx_AWDTR_VTL_Msk                (0xfffUL)                 /*!< VTL (Bitfield-Mask: 0xfff)                            */
/* =========================================================  AWDCR  ========================================================= */
#define ADCx_AWDCR_IN15_Pos               (15UL)                    /*!< IN15 (Bit 15)                                         */
#define ADCx_AWDCR_IN15_Msk               (0x8000UL)                /*!< IN15 (Bitfield-Mask: 0x01)                            */
#define ADCx_AWDCR_IN14_Pos               (14UL)                    /*!< IN14 (Bit 14)                                         */
#define ADCx_AWDCR_IN14_Msk               (0x4000UL)                /*!< IN14 (Bitfield-Mask: 0x01)                            */
#define ADCx_AWDCR_IN13_Pos               (13UL)                    /*!< IN13 (Bit 13)                                         */
#define ADCx_AWDCR_IN13_Msk               (0x2000UL)                /*!< IN13 (Bitfield-Mask: 0x01)                            */
#define ADCx_AWDCR_IN12_Pos               (12UL)                    /*!< IN12 (Bit 12)                                         */
#define ADCx_AWDCR_IN12_Msk               (0x1000UL)                /*!< IN12 (Bitfield-Mask: 0x01)                            */
#define ADCx_AWDCR_IN11_Pos               (11UL)                    /*!< IN11 (Bit 11)                                         */
#define ADCx_AWDCR_IN11_Msk               (0x800UL)                 /*!< IN11 (Bitfield-Mask: 0x01)                            */
#define ADCx_AWDCR_IN10_Pos               (10UL)                    /*!< IN10 (Bit 10)                                         */
#define ADCx_AWDCR_IN10_Msk               (0x400UL)                 /*!< IN10 (Bitfield-Mask: 0x01)                            */
#define ADCx_AWDCR_IN9_Pos                (9UL)                     /*!< IN9 (Bit 9)                                           */
#define ADCx_AWDCR_IN9_Msk                (0x200UL)                 /*!< IN9 (Bitfield-Mask: 0x01)                             */
#define ADCx_AWDCR_IN8_Pos                (8UL)                     /*!< IN8 (Bit 8)                                           */
#define ADCx_AWDCR_IN8_Msk                (0x100UL)                 /*!< IN8 (Bitfield-Mask: 0x01)                             */
#define ADCx_AWDCR_IN7_Pos                (7UL)                     /*!< IN7 (Bit 7)                                           */
#define ADCx_AWDCR_IN7_Msk                (0x80UL)                  /*!< IN7 (Bitfield-Mask: 0x01)                             */
#define ADCx_AWDCR_IN6_Pos                (6UL)                     /*!< IN6 (Bit 6)                                           */
#define ADCx_AWDCR_IN6_Msk                (0x40UL)                  /*!< IN6 (Bitfield-Mask: 0x01)                             */
#define ADCx_AWDCR_IN5_Pos                (5UL)                     /*!< IN5 (Bit 5)                                           */
#define ADCx_AWDCR_IN5_Msk                (0x20UL)                  /*!< IN5 (Bitfield-Mask: 0x01)                             */
#define ADCx_AWDCR_IN4_Pos                (4UL)                     /*!< IN4 (Bit 4)                                           */
#define ADCx_AWDCR_IN4_Msk                (0x10UL)                  /*!< IN4 (Bitfield-Mask: 0x01)                             */
#define ADCx_AWDCR_IN3_Pos                (3UL)                     /*!< IN3 (Bit 3)                                           */
#define ADCx_AWDCR_IN3_Msk                (0x8UL)                   /*!< IN3 (Bitfield-Mask: 0x01)                             */
#define ADCx_AWDCR_IN2_Pos                (2UL)                     /*!< IN2 (Bit 2)                                           */
#define ADCx_AWDCR_IN2_Msk                (0x4UL)                   /*!< IN2 (Bitfield-Mask: 0x01)                             */
#define ADCx_AWDCR_IN1_Pos                (1UL)                     /*!< IN1 (Bit 1)                                           */
#define ADCx_AWDCR_IN1_Msk                (0x2UL)                   /*!< IN1 (Bitfield-Mask: 0x01)                             */
#define ADCx_AWDCR_IN0_Pos                (0UL)                     /*!< IN0 (Bit 0)                                           */
#define ADCx_AWDCR_IN0_Msk                (0x1UL)                   /*!< IN0 (Bitfield-Mask: 0x01)                             */
/* ========================================================  TRIGGER  ======================================================== */
#define ADCx_TRIGGER_HALLTIMTRGO_Pos      (31UL)                    /*!< HALLTIMTRGO (Bit 31)                                  */
#define ADCx_TRIGGER_HALLTIMTRGO_Msk      (0x80000000UL)            /*!< HALLTIMTRGO (Bitfield-Mask: 0x01)                     */
#define ADCx_TRIGGER_BTIM3TRGO_Pos        (30UL)                    /*!< BTIM3TRGO (Bit 30)                                    */
#define ADCx_TRIGGER_BTIM3TRGO_Msk        (0x40000000UL)            /*!< BTIM3TRGO (Bitfield-Mask: 0x01)                       */
#define ADCx_TRIGGER_BTIM2TRGO_Pos        (29UL)                    /*!< BTIM2TRGO (Bit 29)                                    */
#define ADCx_TRIGGER_BTIM2TRGO_Msk        (0x20000000UL)            /*!< BTIM2TRGO (Bitfield-Mask: 0x01)                       */
#define ADCx_TRIGGER_BTIM1TRGO_Pos        (28UL)                    /*!< BTIM1TRGO (Bit 28)                                    */
#define ADCx_TRIGGER_BTIM1TRGO_Msk        (0x10000000UL)            /*!< BTIM1TRGO (Bitfield-Mask: 0x01)                       */
#define ADCx_TRIGGER_GTIM4OC4REFC_Pos     (27UL)                    /*!< GTIM4OC4REFC (Bit 27)                                 */
#define ADCx_TRIGGER_GTIM4OC4REFC_Msk     (0x8000000UL)             /*!< GTIM4OC4REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM4OC3REFC_Pos     (26UL)                    /*!< GTIM4OC3REFC (Bit 26)                                 */
#define ADCx_TRIGGER_GTIM4OC3REFC_Msk     (0x4000000UL)             /*!< GTIM4OC3REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM4OC2REFC_Pos     (25UL)                    /*!< GTIM4OC2REFC (Bit 25)                                 */
#define ADCx_TRIGGER_GTIM4OC2REFC_Msk     (0x2000000UL)             /*!< GTIM4OC2REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM4OC1REFC_Pos     (24UL)                    /*!< GTIM4OC1REFC (Bit 24)                                 */
#define ADCx_TRIGGER_GTIM4OC1REFC_Msk     (0x1000000UL)             /*!< GTIM4OC1REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM4TRGO_Pos        (23UL)                    /*!< GTIM4TRGO (Bit 23)                                    */
#define ADCx_TRIGGER_GTIM4TRGO_Msk        (0x800000UL)              /*!< GTIM4TRGO (Bitfield-Mask: 0x01)                       */
#define ADCx_TRIGGER_GTIM3OC4REFC_Pos     (22UL)                    /*!< GTIM3OC4REFC (Bit 22)                                 */
#define ADCx_TRIGGER_GTIM3OC4REFC_Msk     (0x400000UL)              /*!< GTIM3OC4REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM3OC3REFC_Pos     (21UL)                    /*!< GTIM3OC3REFC (Bit 21)                                 */
#define ADCx_TRIGGER_GTIM3OC3REFC_Msk     (0x200000UL)              /*!< GTIM3OC3REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM3OC2REFC_Pos     (20UL)                    /*!< GTIM3OC2REFC (Bit 20)                                 */
#define ADCx_TRIGGER_GTIM3OC2REFC_Msk     (0x100000UL)              /*!< GTIM3OC2REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM3OC1REFC_Pos     (19UL)                    /*!< GTIM3OC1REFC (Bit 19)                                 */
#define ADCx_TRIGGER_GTIM3OC1REFC_Msk     (0x80000UL)               /*!< GTIM3OC1REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM3TRGO_Pos        (18UL)                    /*!< GTIM3TRGO (Bit 18)                                    */
#define ADCx_TRIGGER_GTIM3TRGO_Msk        (0x40000UL)               /*!< GTIM3TRGO (Bitfield-Mask: 0x01)                       */
#define ADCx_TRIGGER_GTIM2OC4REFC_Pos     (17UL)                    /*!< GTIM2OC4REFC (Bit 17)                                 */
#define ADCx_TRIGGER_GTIM2OC4REFC_Msk     (0x20000UL)               /*!< GTIM2OC4REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM2OC3REFC_Pos     (16UL)                    /*!< GTIM2OC3REFC (Bit 16)                                 */
#define ADCx_TRIGGER_GTIM2OC3REFC_Msk     (0x10000UL)               /*!< GTIM2OC3REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM2OC2REFC_Pos     (15UL)                    /*!< GTIM2OC2REFC (Bit 15)                                 */
#define ADCx_TRIGGER_GTIM2OC2REFC_Msk     (0x8000UL)                /*!< GTIM2OC2REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM2OC1REFC_Pos     (14UL)                    /*!< GTIM2OC1REFC (Bit 14)                                 */
#define ADCx_TRIGGER_GTIM2OC1REFC_Msk     (0x4000UL)                /*!< GTIM2OC1REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM2TRGO_Pos        (13UL)                    /*!< GTIM2TRGO (Bit 13)                                    */
#define ADCx_TRIGGER_GTIM2TRGO_Msk        (0x2000UL)                /*!< GTIM2TRGO (Bitfield-Mask: 0x01)                       */
#define ADCx_TRIGGER_GTIM1OC4REFC_Pos     (12UL)                    /*!< GTIM1OC4REFC (Bit 12)                                 */
#define ADCx_TRIGGER_GTIM1OC4REFC_Msk     (0x1000UL)                /*!< GTIM1OC4REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM1OC3REFC_Pos     (11UL)                    /*!< GTIM1OC3REFC (Bit 11)                                 */
#define ADCx_TRIGGER_GTIM1OC3REFC_Msk     (0x800UL)                 /*!< GTIM1OC3REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM1OC2REFC_Pos     (10UL)                    /*!< GTIM1OC2REFC (Bit 10)                                 */
#define ADCx_TRIGGER_GTIM1OC2REFC_Msk     (0x400UL)                 /*!< GTIM1OC2REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM1OC1REFC_Pos     (9UL)                     /*!< GTIM1OC1REFC (Bit 9)                                  */
#define ADCx_TRIGGER_GTIM1OC1REFC_Msk     (0x200UL)                 /*!< GTIM1OC1REFC (Bitfield-Mask: 0x01)                    */
#define ADCx_TRIGGER_GTIM1TRGO_Pos        (8UL)                     /*!< GTIM1TRGO (Bit 8)                                     */
#define ADCx_TRIGGER_GTIM1TRGO_Msk        (0x100UL)                 /*!< GTIM1TRGO (Bitfield-Mask: 0x01)                       */
#define ADCx_TRIGGER_ATIMOC6REFC_Pos      (7UL)                     /*!< ATIMOC6REFC (Bit 7)                                   */
#define ADCx_TRIGGER_ATIMOC6REFC_Msk      (0x80UL)                  /*!< ATIMOC6REFC (Bitfield-Mask: 0x01)                     */
#define ADCx_TRIGGER_ATIMOC5REFC_Pos      (6UL)                     /*!< ATIMOC5REFC (Bit 6)                                   */
#define ADCx_TRIGGER_ATIMOC5REFC_Msk      (0x40UL)                  /*!< ATIMOC5REFC (Bitfield-Mask: 0x01)                     */
#define ADCx_TRIGGER_ATIMOC4REFC_Pos      (5UL)                     /*!< ATIMOC4REFC (Bit 5)                                   */
#define ADCx_TRIGGER_ATIMOC4REFC_Msk      (0x20UL)                  /*!< ATIMOC4REFC (Bitfield-Mask: 0x01)                     */
#define ADCx_TRIGGER_ATIMOC3REFC_Pos      (4UL)                     /*!< ATIMOC3REFC (Bit 4)                                   */
#define ADCx_TRIGGER_ATIMOC3REFC_Msk      (0x10UL)                  /*!< ATIMOC3REFC (Bitfield-Mask: 0x01)                     */
#define ADCx_TRIGGER_ATIMOC2REFC_Pos      (3UL)                     /*!< ATIMOC2REFC (Bit 3)                                   */
#define ADCx_TRIGGER_ATIMOC2REFC_Msk      (0x8UL)                   /*!< ATIMOC2REFC (Bitfield-Mask: 0x01)                     */
#define ADCx_TRIGGER_ATIMOC1REFC_Pos      (2UL)                     /*!< ATIMOC1REFC (Bit 2)                                   */
#define ADCx_TRIGGER_ATIMOC1REFC_Msk      (0x4UL)                   /*!< ATIMOC1REFC (Bitfield-Mask: 0x01)                     */
#define ADCx_TRIGGER_ATIMTRGO2_Pos        (1UL)                     /*!< ATIMTRGO2 (Bit 1)                                     */
#define ADCx_TRIGGER_ATIMTRGO2_Msk        (0x2UL)                   /*!< ATIMTRGO2 (Bitfield-Mask: 0x01)                       */
#define ADCx_TRIGGER_ATIMTRGO_Pos         (0UL)                     /*!< ATIMTRGO (Bit 0)                                      */
#define ADCx_TRIGGER_ATIMTRGO_Msk         (0x1UL)                   /*!< ATIMTRGO (Bitfield-Mask: 0x01)                        */
/* ========================================================  SAMPLE  ========================================================= */
#define ADCx_SAMPLE_SQRCH7_Pos            (28UL)                    /*!< SQRCH7 (Bit 28)                                       */
#define ADCx_SAMPLE_SQRCH7_Msk            (0xf0000000UL)            /*!< SQRCH7 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SAMPLE_SQRCH6_Pos            (24UL)                    /*!< SQRCH6 (Bit 24)                                       */
#define ADCx_SAMPLE_SQRCH6_Msk            (0xf000000UL)             /*!< SQRCH6 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SAMPLE_SQRCH5_Pos            (20UL)                    /*!< SQRCH5 (Bit 20)                                       */
#define ADCx_SAMPLE_SQRCH5_Msk            (0xf00000UL)              /*!< SQRCH5 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SAMPLE_SQRCH4_Pos            (16UL)                    /*!< SQRCH4 (Bit 16)                                       */
#define ADCx_SAMPLE_SQRCH4_Msk            (0xf0000UL)               /*!< SQRCH4 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SAMPLE_SQRCH3_Pos            (12UL)                    /*!< SQRCH3 (Bit 12)                                       */
#define ADCx_SAMPLE_SQRCH3_Msk            (0xf000UL)                /*!< SQRCH3 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SAMPLE_SQRCH2_Pos            (8UL)                     /*!< SQRCH2 (Bit 8)                                        */
#define ADCx_SAMPLE_SQRCH2_Msk            (0xf00UL)                 /*!< SQRCH2 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SAMPLE_SQRCH1_Pos            (4UL)                     /*!< SQRCH1 (Bit 4)                                        */
#define ADCx_SAMPLE_SQRCH1_Msk            (0xf0UL)                  /*!< SQRCH1 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SAMPLE_SQRCH0_Pos            (0UL)                     /*!< SQRCH0 (Bit 0)                                        */
#define ADCx_SAMPLE_SQRCH0_Msk            (0xfUL)                   /*!< SQRCH0 (Bitfield-Mask: 0x0f)                          */
/* ========================================================  SQRCFR  ========================================================= */
#define ADCx_SQRCFR_SQRCH7_Pos            (28UL)                    /*!< SQRCH7 (Bit 28)                                       */
#define ADCx_SQRCFR_SQRCH7_Msk            (0xf0000000UL)            /*!< SQRCH7 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SQRCFR_SQRCH6_Pos            (24UL)                    /*!< SQRCH6 (Bit 24)                                       */
#define ADCx_SQRCFR_SQRCH6_Msk            (0xf000000UL)             /*!< SQRCH6 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SQRCFR_SQRCH5_Pos            (20UL)                    /*!< SQRCH5 (Bit 20)                                       */
#define ADCx_SQRCFR_SQRCH5_Msk            (0xf00000UL)              /*!< SQRCH5 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SQRCFR_SQRCH4_Pos            (16UL)                    /*!< SQRCH4 (Bit 16)                                       */
#define ADCx_SQRCFR_SQRCH4_Msk            (0xf0000UL)               /*!< SQRCH4 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SQRCFR_SQRCH3_Pos            (12UL)                    /*!< SQRCH3 (Bit 12)                                       */
#define ADCx_SQRCFR_SQRCH3_Msk            (0xf000UL)                /*!< SQRCH3 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SQRCFR_SQRCH2_Pos            (8UL)                     /*!< SQRCH2 (Bit 8)                                        */
#define ADCx_SQRCFR_SQRCH2_Msk            (0xf00UL)                 /*!< SQRCH2 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SQRCFR_SQRCH1_Pos            (4UL)                     /*!< SQRCH1 (Bit 4)                                        */
#define ADCx_SQRCFR_SQRCH1_Msk            (0xf0UL)                  /*!< SQRCH1 (Bitfield-Mask: 0x0f)                          */
#define ADCx_SQRCFR_SQRCH0_Pos            (0UL)                     /*!< SQRCH0 (Bit 0)                                        */
#define ADCx_SQRCFR_SQRCH0_Msk            (0xfUL)                   /*!< SQRCH0 (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  IER  ========================================================== */
#define ADCx_IER_DMAEOS_Pos               (6UL)                     /*!< DMAEOS (Bit 6)                                        */
#define ADCx_IER_DMAEOS_Msk               (0x40UL)                  /*!< DMAEOS (Bitfield-Mask: 0x01)                          */
#define ADCx_IER_DMAEOC_Pos               (5UL)                     /*!< DMAEOC (Bit 5)                                        */
#define ADCx_IER_DMAEOC_Msk               (0x20UL)                  /*!< DMAEOC (Bitfield-Mask: 0x01)                          */
#define ADCx_IER_AWDH_Pos                 (4UL)                     /*!< AWDH (Bit 4)                                          */
#define ADCx_IER_AWDH_Msk                 (0x10UL)                  /*!< AWDH (Bitfield-Mask: 0x01)                            */
#define ADCx_IER_AWDL_Pos                 (3UL)                     /*!< AWDL (Bit 3)                                          */
#define ADCx_IER_AWDL_Msk                 (0x8UL)                   /*!< AWDL (Bitfield-Mask: 0x01)                            */
#define ADCx_IER_EOS_Pos                  (1UL)                     /*!< EOS (Bit 1)                                           */
#define ADCx_IER_EOS_Msk                  (0x2UL)                   /*!< EOS (Bitfield-Mask: 0x01)                             */
#define ADCx_IER_EOC_Pos                  (0UL)                     /*!< EOC (Bit 0)                                           */
#define ADCx_IER_EOC_Msk                  (0x1UL)                   /*!< EOC (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define ADCx_ISR_AWDH_Pos                 (4UL)                     /*!< AWDH (Bit 4)                                          */
#define ADCx_ISR_AWDH_Msk                 (0x10UL)                  /*!< AWDH (Bitfield-Mask: 0x01)                            */
#define ADCx_ISR_AWDL_Pos                 (3UL)                     /*!< AWDL (Bit 3)                                          */
#define ADCx_ISR_AWDL_Msk                 (0x8UL)                   /*!< AWDL (Bitfield-Mask: 0x01)                            */
#define ADCx_ISR_EOS_Pos                  (1UL)                     /*!< EOS (Bit 1)                                           */
#define ADCx_ISR_EOS_Msk                  (0x2UL)                   /*!< EOS (Bitfield-Mask: 0x01)                             */
#define ADCx_ISR_EOC_Pos                  (0UL)                     /*!< EOC (Bit 0)                                           */
#define ADCx_ISR_EOC_Msk                  (0x1UL)                   /*!< EOC (Bitfield-Mask: 0x01)                             */
