damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
#define ATIM_CCER_CC4NE_Msk               (0x4000UL)                /*!< CC4NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC4P_Pos                (13UL)                    /*!< CC4P (Bit 13)                                         */
#define ATIM_CCER_CC4P_Msk                (0x2000UL)                /*!< CC4P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC4E_Pos                (12UL)                    /*!< CC4E (Bit 12)                                         */
#define ATIM_CCER_CC4E_Msk                (0x1000UL)                /*!< CC4E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC3NP_Pos               (11UL)                    /*!< CC3NP (Bit 11)                                        */
#define ATIM_CCER_CC3NP_Msk               (0x800UL)                 /*!< CC3NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC3NE_Pos               (10UL)                    /*!< CC3NE (Bit 10)                                        */
#define ATIM_CCER_CC3NE_Msk               (0x400UL)                 /*!< CC3NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC3P_Pos                (9UL)                     /*!< CC3P (Bit 9)                                          */
#define ATIM_CCER_CC3P_Msk                (0x200UL)                 /*!< CC3P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC3E_Pos                (8UL)                     /*!< CC3E (Bit 8)                                          */
#define ATIM_CCER_CC3E_Msk                (0x100UL)                 /*!< CC3E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC2NP_Pos               (7UL)                     /*!< CC2NP (Bit 7)                                         */
#define ATIM_CCER_CC2NP_Msk               (0x80UL)                  /*!< CC2NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC2NE_Pos               (6UL)                     /*!< CC2NE (Bit 6)                                         */
#define ATIM_CCER_CC2NE_Msk               (0x40UL)                  /*!< CC2NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC2P_Pos                (5UL)                     /*!< CC2P (Bit 5)                                          */
#define ATIM_CCER_CC2P_Msk                (0x20UL)                  /*!< CC2P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC2E_Pos                (4UL)                     /*!< CC2E (Bit 4)                                          */
#define ATIM_CCER_CC2E_Msk                (0x10UL)                  /*!< CC2E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC1NP_Pos               (3UL)                     /*!< CC1NP (Bit 3)                                         */
#define ATIM_CCER_CC1NP_Msk               (0x8UL)                   /*!< CC1NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC1NE_Pos               (2UL)                     /*!< CC1NE (Bit 2)                                         */
#define ATIM_CCER_CC1NE_Msk               (0x4UL)                   /*!< CC1NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC1P_Pos                (1UL)                     /*!< CC1P (Bit 1)                                          */
#define ATIM_CCER_CC1P_Msk                (0x2UL)                   /*!< CC1P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC1E_Pos                (0UL)                     /*!< CC1E (Bit 0)                                          */
#define ATIM_CCER_CC1E_Msk                (0x1UL)                   /*!< CC1E (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CNT  ========================================================== */
#define ATIM_CNT_UIFCPY_Pos               (31UL)                    /*!< UIFCPY (Bit 31)                                       */
#define ATIM_CNT_UIFCPY_Msk               (0x80000000UL)            /*!< UIFCPY (Bitfield-Mask: 0x01)                          */
#define ATIM_CNT_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define ATIM_CNT_CNT_Msk                  (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define ATIM_PSC_PSC_Pos                  (0UL)                     /*!< PSC (Bit 0)                                           */
#define ATIM_PSC_PSC_Msk                  (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  ARR  ========================================================== */
#define ATIM_ARR_ARR_Pos                  (0UL)                     /*!< ARR (Bit 0)                                           */
#define ATIM_ARR_ARR_Msk                  (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  RCR  ========================================================== */
#define ATIM_RCR_REP_Pos                  (0UL)                     /*!< REP (Bit 0)                                           */
#define ATIM_RCR_REP_Msk                  (0xffffUL)                /*!< REP (Bitfield-Mask: 0xffff)                           */
/* =========================================================  CCR1  ========================================================== */
#define ATIM_CCR1_CCR1_Pos                (0UL)                     /*!< CCR1 (Bit 0)                                          */
#define ATIM_CCR1_CCR1_Msk                (0xffffUL)                /*!< CCR1 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR2  ========================================================== */
#define ATIM_CCR2_CCR2_Pos                (0UL)                     /*!< CCR2 (Bit 0)                                          */
#define ATIM_CCR2_CCR2_Msk                (0xffffUL)                /*!< CCR2 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR3  ========================================================== */
#define ATIM_CCR3_CCR3_Pos                (0UL)                     /*!< CCR3 (Bit 0)                                          */
#define ATIM_CCR3_CCR3_Msk                (0xffffUL)                /*!< CCR3 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR4  ========================================================== */
#define ATIM_CCR4_CCR4_Pos                (0UL)                     /*!< CCR4 (Bit 0)                                          */
#define ATIM_CCR4_CCR4_Msk                (0xffffUL)                /*!< CCR4 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR5  ========================================================== */
#define ATIM_CCR5_GC5C6_Pos               (31UL)                    /*!< GC5C6 (Bit 31)                                        */
#define ATIM_CCR5_GC5C6_Msk               (0x80000000UL)            /*!< GC5C6 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C5_Pos               (30UL)                    /*!< GC5C5 (Bit 30)                                        */
#define ATIM_CCR5_GC5C5_Msk               (0x40000000UL)            /*!< GC5C5 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C4_Pos               (29UL)                    /*!< GC5C4 (Bit 29)                                        */
#define ATIM_CCR5_GC5C4_Msk               (0x20000000UL)            /*!< GC5C4 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C3_Pos               (28UL)                    /*!< GC5C3 (Bit 28)                                        */
#define ATIM_CCR5_GC5C3_Msk               (0x10000000UL)            /*!< GC5C3 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C2_Pos               (27UL)                    /*!< GC5C2 (Bit 27)                                        */
#define ATIM_CCR5_GC5C2_Msk               (0x8000000UL)             /*!< GC5C2 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C1_Pos               (26UL)                    /*!< GC5C1 (Bit 26)                                        */
#define ATIM_CCR5_GC5C1_Msk               (0x4000000UL)             /*!< GC5C1 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_CCR5_Pos                (0UL)                     /*!< CCR5 (Bit 0)                                          */
#define ATIM_CCR5_CCR5_Msk                (0xffffUL)                /*!< CCR5 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR6  ========================================================== */
#define ATIM_CCR6_GC6C6_Pos               (31UL)                    /*!< GC6C6 (Bit 31)                                        */
#define ATIM_CCR6_GC6C6_Msk               (0x80000000UL)            /*!< GC6C6 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C5_Pos               (30UL)                    /*!< GC6C5 (Bit 30)                                        */
#define ATIM_CCR6_GC6C5_Msk               (0x40000000UL)            /*!< GC6C5 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C4_Pos               (29UL)                    /*!< GC6C4 (Bit 29)                                        */
#define ATIM_CCR6_GC6C4_Msk               (0x20000000UL)            /*!< GC6C4 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C3_Pos               (28UL)                    /*!< GC6C3 (Bit 28)                                        */
#define ATIM_CCR6_GC6C3_Msk               (0x10000000UL)            /*!< GC6C3 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C2_Pos               (27UL)                    /*!< GC6C2 (Bit 27)                                        */
#define ATIM_CCR6_GC6C2_Msk               (0x8000000UL)             /*!< GC6C2 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C1_Pos               (26UL)                    /*!< GC6C1 (Bit 26)                                        */
#define ATIM_CCR6_GC6C1_Msk               (0x4000000UL)             /*!< GC6C1 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_CCR6_Pos                (0UL)                     /*!< CCR6 (Bit 0)                                          */
#define ATIM_CCR6_CCR6_Msk                (0xffffUL)                /*!< CCR6 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  BDTR  ========================================================== */
#define ATIM_BDTR_BK2P_Pos                (25UL)                    /*!< BK2P (Bit 25)                                         */
#define ATIM_BDTR_BK2P_Msk                (0x2000000UL)             /*!< BK2P (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_BK2E_Pos                (24UL)                    /*!< BK2E (Bit 24)                                         */
#define ATIM_BDTR_BK2E_Msk                (0x1000000UL)             /*!< BK2E (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_BK2F_Pos                (20UL)                    /*!< BK2F (Bit 20)                                         */
#define ATIM_BDTR_BK2F_Msk                (0xf00000UL)              /*!< BK2F (Bitfield-Mask: 0x0f)                            */
#define ATIM_BDTR_BKF_Pos                 (16UL)                    /*!< BKF (Bit 16)                                          */
#define ATIM_BDTR_BKF_Msk                 (0xf0000UL)               /*!< BKF (Bitfield-Mask: 0x0f)                             */
#define ATIM_BDTR_MOE_Pos                 (15UL)                    /*!< MOE (Bit 15)                                          */
#define ATIM_BDTR_MOE_Msk                 (0x8000UL)                /*!< MOE (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_AOE_Pos                 (14UL)                    /*!< AOE (Bit 14)                                          */
#define ATIM_BDTR_AOE_Msk                 (0x4000UL)                /*!< AOE (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_BKP_Pos                 (13UL)                    /*!< BKP (Bit 13)                                          */
#define ATIM_BDTR_BKP_Msk                 (0x2000UL)                /*!< BKP (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_BKE_Pos                 (12UL)                    /*!< BKE (Bit 12)                                          */
#define ATIM_BDTR_BKE_Msk                 (0x1000UL)                /*!< BKE (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_OSSR_Pos                (11UL)                    /*!< OSSR (Bit 11)                                         */
#define ATIM_BDTR_OSSR_Msk                (0x800UL)                 /*!< OSSR (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_OSSI_Pos                (10UL)                    /*!< OSSI (Bit 10)                                         */
#define ATIM_BDTR_OSSI_Msk                (0x400UL)                 /*!< OSSI (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_LOCK_Pos                (8UL)                     /*!< LOCK (Bit 8)                                          */
#define ATIM_BDTR_LOCK_Msk                (0x300UL)                 /*!< LOCK (Bitfield-Mask: 0x03)                            */
#define ATIM_BDTR_DTG_Pos                 (0UL)                     /*!< DTG (Bit 0)                                           */
#define ATIM_BDTR_DTG_Msk                 (0xffUL)                  /*!< DTG (Bitfield-Mask: 0xff)                             */
/* =========================================================  DTR2  ========================================================== */
#define ATIM_DTR2_DTPE_Pos                (17UL)                    /*!< DTPE (Bit 17)                                         */
#define ATIM_DTR2_DTPE_Msk                (0x20000UL)               /*!< DTPE (Bitfield-Mask: 0x01)                            */
#define ATIM_DTR2_DTAE_Pos                (16UL)                    /*!< DTAE (Bit 16)                                         */
#define ATIM_DTR2_DTAE_Msk                (0x10000UL)               /*!< DTAE (Bitfield-Mask: 0x01)                            */
#define ATIM_DTR2_DTGF_Pos                (0UL)                     /*!< DTGF (Bit 0)                                          */
#define ATIM_DTR2_DTGF_Msk                (0xffUL)                  /*!< DTGF (Bitfield-Mask: 0xff)                            */
/* ==========================================================  ECR  ========================================================== */
#define ATIM_ECR_IPOS_Pos                 (6UL)                     /*!< IPOS (Bit 6)                                          */
#define ATIM_ECR_IPOS_Msk                 (0xc0UL)                  /*!< IPOS (Bitfield-Mask: 0x03)                            */
#define ATIM_ECR_FIDX_Pos                 (5UL)                     /*!< FIDX (Bit 5)                                          */
#define ATIM_ECR_FIDX_Msk                 (0x20UL)                  /*!< FIDX (Bitfield-Mask: 0x01)                            */
#define ATIM_ECR_IDIR_Pos                 (1UL)                     /*!< IDIR (Bit 1)                                          */
#define ATIM_ECR_IDIR_Msk                 (0x6UL)                   /*!< IDIR (Bitfield-Mask: 0x03)                            */
#define ATIM_ECR_IE_Pos                   (0UL)                     /*!< IE (Bit 0)                                            */
#define ATIM_ECR_IE_Msk                   (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ========================================================  TISEL1  ========================================================= */
#define ATIM_TISEL1_TI4SEL_Pos            (24UL)                    /*!< TI4SEL (Bit 24)                                       */
#define ATIM_TISEL1_TI4SEL_Msk            (0xf000000UL)             /*!< TI4SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL1_TI3SEL_Pos            (16UL)                    /*!< TI3SEL (Bit 16)                                       */
#define ATIM_TISEL1_TI3SEL_Msk            (0xf0000UL)               /*!< TI3SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL1_TI2SEL_Pos            (8UL)                     /*!< TI2SEL (Bit 8)                                        */
#define ATIM_TISEL1_TI2SEL_Msk            (0xf00UL)                 /*!< TI2SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL1_TI1SEL_Pos            (0UL)                     /*!< TI1SEL (Bit 0)                                        */
#define ATIM_TISEL1_TI1SEL_Msk            (0xfUL)                   /*!< TI1SEL (Bitfield-Mask: 0x0f)                          */
/* ========================================================  TISEL2  ========================================================= */
#define ATIM_TISEL2_TI6SEL_Pos            (8UL)                     /*!< TI6SEL (Bit 8)                                        */
#define ATIM_TISEL2_TI6SEL_Msk            (0xf00UL)                 /*!< TI6SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL2_TI5SEL_Pos            (0UL)                     /*!< TI5SEL (Bit 0)                                        */
#define ATIM_TISEL2_TI5SEL_Msk            (0xfUL)                   /*!< TI5SEL (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  AF1  ========================================================== */
#define ATIM_AF1_ETRSEL_Pos               (16UL)                    /*!< ETRSEL (Bit 16)                                       */
#define ATIM_AF1_ETRSEL_Msk               (0xf0000UL)               /*!< ETRSEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_AF1_BKVC4P_Pos               (13UL)                    /*!< BKVC4P (Bit 13)                                       */
#define ATIM_AF1_BKVC4P_Msk               (0x2000UL)                /*!< BKVC4P (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKVC3P_Pos               (12UL)                    /*!< BKVC3P (Bit 12)                                       */
#define ATIM_AF1_BKVC3P_Msk               (0x1000UL)                /*!< BKVC3P (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKVC2P_Pos               (11UL)                    /*!< BKVC2P (Bit 11)                                       */
#define ATIM_AF1_BKVC2P_Msk               (0x800UL)                 /*!< BKVC2P (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKVC1P_Pos               (10UL)                    /*!< BKVC1P (Bit 10)                                       */
#define ATIM_AF1_BKVC1P_Msk               (0x400UL)                 /*!< BKVC1P (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKINP_Pos                (9UL)                     /*!< BKINP (Bit 9)                                         */
#define ATIM_AF1_BKINP_Msk                (0x200UL)                 /*!< BKINP (Bitfield-Mask: 0x01)                           */
#define ATIM_AF1_BKVC4E_Pos               (4UL)                     /*!< BKVC4E (Bit 4)                                        */
#define ATIM_AF1_BKVC4E_Msk               (0x10UL)                  /*!< BKVC4E (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKVC3E_Pos               (3UL)                     /*!< BKVC3E (Bit 3)                                        */
#define ATIM_AF1_BKVC3E_Msk               (0x8UL)                   /*!< BKVC3E (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKVC2E_Pos               (2UL)                     /*!< BKVC2E (Bit 2)                                        */
#define ATIM_AF1_BKVC2E_Msk               (0x4UL)                   /*!< BKVC2E (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKVC1E_Pos               (1UL)                     /*!< BKVC1E (Bit 1)                                        */
#define ATIM_AF1_BKVC1E_Msk               (0x2UL)                   /*!< BKVC1E (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKINE_Pos                (0UL)                     /*!< BKINE (Bit 0)                                         */
#define ATIM_AF1_BKINE_Msk                (0x1UL)                   /*!< BKINE (Bitfield-Mask: 0x01)                           */
/* ==========================================================  AF2  ========================================================== */
#define ATIM_AF2_OCRSEL_Pos               (16UL)                    /*!< OCRSEL (Bit 16)                                       */
#define ATIM_AF2_OCRSEL_Msk               (0xf0000UL)               /*!< OCRSEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_AF2_BK2VC4P_Pos              (13UL)                    /*!< BK2VC4P (Bit 13)                                      */
#define ATIM_AF2_BK2VC4P_Msk              (0x2000UL)                /*!< BK2VC4P (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2VC3P_Pos              (12UL)                    /*!< BK2VC3P (Bit 12)                                      */
#define ATIM_AF2_BK2VC3P_Msk              (0x1000UL)                /*!< BK2VC3P (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2VC2P_Pos              (11UL)                    /*!< BK2VC2P (Bit 11)                                      */
#define ATIM_AF2_BK2VC2P_Msk              (0x800UL)                 /*!< BK2VC2P (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2VC1P_Pos              (10UL)                    /*!< BK2VC1P (Bit 10)                                      */
#define ATIM_AF2_BK2VC1P_Msk              (0x400UL)                 /*!< BK2VC1P (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2INP_Pos               (9UL)                     /*!< BK2INP (Bit 9)                                        */
#define ATIM_AF2_BK2INP_Msk               (0x200UL)                 /*!< BK2INP (Bitfield-Mask: 0x01)                          */
#define ATIM_AF2_BK2VC4E_Pos              (4UL)                     /*!< BK2VC4E (Bit 4)                                       */
#define ATIM_AF2_BK2VC4E_Msk              (0x10UL)                  /*!< BK2VC4E (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2VC3E_Pos              (3UL)                     /*!< BK2VC3E (Bit 3)                                       */
#define ATIM_AF2_BK2VC3E_Msk              (0x8UL)                   /*!< BK2VC3E (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2VC2E_Pos              (2UL)                     /*!< BK2VC2E (Bit 2)                                       */
#define ATIM_AF2_BK2VC2E_Msk              (0x4UL)                   /*!< BK2VC2E (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2VC1E_Pos              (1UL)                     /*!< BK2VC1E (Bit 1)                                       */
#define ATIM_AF2_BK2VC1E_Msk              (0x2UL)                   /*!< BK2VC1E (Bitfield-Mask: 0x01)                         */
