damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
#define ATIM_AF2_BK2INE_Pos               (0UL)                     /*!< BK2INE (Bit 0)                                        */
#define ATIM_AF2_BK2INE_Msk               (0x1UL)                   /*!< BK2INE (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define ATIM_ICR_TERRF_Pos                (23UL)                    /*!< TERRF (Bit 23)                                        */
#define ATIM_ICR_TERRF_Msk                (0x800000UL)              /*!< TERRF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_IERRF_Pos                (22UL)                    /*!< IERRF (Bit 22)                                        */
#define ATIM_ICR_IERRF_Msk                (0x400000UL)              /*!< IERRF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_DIRF_Pos                 (21UL)                    /*!< DIRF (Bit 21)                                         */
#define ATIM_ICR_DIRF_Msk                 (0x200000UL)              /*!< DIRF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_IDXF_Pos                 (20UL)                    /*!< IDXF (Bit 20)                                         */
#define ATIM_ICR_IDXF_Msk                 (0x100000UL)              /*!< IDXF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_CC6OF_Pos                (19UL)                    /*!< CC6OF (Bit 19)                                        */
#define ATIM_ICR_CC6OF_Msk                (0x80000UL)               /*!< CC6OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC5OF_Pos                (18UL)                    /*!< CC5OF (Bit 18)                                        */
#define ATIM_ICR_CC5OF_Msk                (0x40000UL)               /*!< CC5OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC6IF_Pos                (17UL)                    /*!< CC6IF (Bit 17)                                        */
#define ATIM_ICR_CC6IF_Msk                (0x20000UL)               /*!< CC6IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC5IF_Pos                (16UL)                    /*!< CC5IF (Bit 16)                                        */
#define ATIM_ICR_CC5IF_Msk                (0x10000UL)               /*!< CC5IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_SBIF_Pos                 (13UL)                    /*!< SBIF (Bit 13)                                         */
#define ATIM_ICR_SBIF_Msk                 (0x2000UL)                /*!< SBIF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_CC4OF_Pos                (12UL)                    /*!< CC4OF (Bit 12)                                        */
#define ATIM_ICR_CC4OF_Msk                (0x1000UL)                /*!< CC4OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC3OF_Pos                (11UL)                    /*!< CC3OF (Bit 11)                                        */
#define ATIM_ICR_CC3OF_Msk                (0x800UL)                 /*!< CC3OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC2OF_Pos                (10UL)                    /*!< CC2OF (Bit 10)                                        */
#define ATIM_ICR_CC2OF_Msk                (0x400UL)                 /*!< CC2OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC1OF_Pos                (9UL)                     /*!< CC1OF (Bit 9)                                         */
#define ATIM_ICR_CC1OF_Msk                (0x200UL)                 /*!< CC1OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_B2IF_Pos                 (8UL)                     /*!< B2IF (Bit 8)                                          */
#define ATIM_ICR_B2IF_Msk                 (0x100UL)                 /*!< B2IF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_BIF_Pos                  (7UL)                     /*!< BIF (Bit 7)                                           */
#define ATIM_ICR_BIF_Msk                  (0x80UL)                  /*!< BIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_TIF_Pos                  (6UL)                     /*!< TIF (Bit 6)                                           */
#define ATIM_ICR_TIF_Msk                  (0x40UL)                  /*!< TIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_COMIF_Pos                (5UL)                     /*!< COMIF (Bit 5)                                         */
#define ATIM_ICR_COMIF_Msk                (0x20UL)                  /*!< COMIF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC4IF_Pos                (4UL)                     /*!< CC4IF (Bit 4)                                         */
#define ATIM_ICR_CC4IF_Msk                (0x10UL)                  /*!< CC4IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC3IF_Pos                (3UL)                     /*!< CC3IF (Bit 3)                                         */
#define ATIM_ICR_CC3IF_Msk                (0x8UL)                   /*!< CC3IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC2IF_Pos                (2UL)                     /*!< CC2IF (Bit 2)                                         */
#define ATIM_ICR_CC2IF_Msk                (0x4UL)                   /*!< CC2IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC1IF_Pos                (1UL)                     /*!< CC1IF (Bit 1)                                         */
#define ATIM_ICR_CC1IF_Msk                (0x2UL)                   /*!< CC1IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_UIF_Pos                  (0UL)                     /*!< UIF (Bit 0)                                           */
#define ATIM_ICR_UIF_Msk                  (0x1UL)                   /*!< UIF (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                            BGR                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define BGR_CR_TSEN_Pos                   (1UL)                     /*!< TSEN (Bit 1)                                          */
#define BGR_CR_TSEN_Msk                   (0x2UL)                   /*!< TSEN (Bitfield-Mask: 0x01)                            */
#define BGR_CR_BGREN_Pos                  (0UL)                     /*!< BGREN (Bit 0)                                         */
#define BGR_CR_BGREN_Msk                  (0x1UL)                   /*!< BGREN (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                           BTIM                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR1  ========================================================== */
#define BTIMx_CR1_TOGEN_Pos               (15UL)                    /*!< TOGEN (Bit 15)                                        */
#define BTIMx_CR1_TOGEN_Msk               (0x8000UL)                /*!< TOGEN (Bitfield-Mask: 0x01)                           */
#define BTIMx_CR1_UIFREMAP_Pos            (11UL)                    /*!< UIFREMAP (Bit 11)                                     */
#define BTIMx_CR1_UIFREMAP_Msk            (0x800UL)                 /*!< UIFREMAP (Bitfield-Mask: 0x01)                        */
#define BTIMx_CR1_ONESHOT_Pos             (3UL)                     /*!< ONESHOT (Bit 3)                                       */
#define BTIMx_CR1_ONESHOT_Msk             (0x8UL)                   /*!< ONESHOT (Bitfield-Mask: 0x01)                         */
#define BTIMx_CR1_URS_Pos                 (2UL)                     /*!< URS (Bit 2)                                           */
#define BTIMx_CR1_URS_Msk                 (0x4UL)                   /*!< URS (Bitfield-Mask: 0x01)                             */
#define BTIMx_CR1_UDIS_Pos                (1UL)                     /*!< UDIS (Bit 1)                                          */
#define BTIMx_CR1_UDIS_Msk                (0x2UL)                   /*!< UDIS (Bitfield-Mask: 0x01)                            */
#define BTIMx_CR1_EN_Pos                  (0UL)                     /*!< EN (Bit 0)                                            */
#define BTIMx_CR1_EN_Msk                  (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR2  ========================================================== */
#define BTIMx_CR2_MMS_Pos                 (4UL)                     /*!< MMS (Bit 4)                                           */
#define BTIMx_CR2_MMS_Msk                 (0x70UL)                  /*!< MMS (Bitfield-Mask: 0x07)                             */
/* =========================================================  SMCR  ========================================================== */
#define BTIMx_SMCR_TRGIPOL_Pos            (17UL)                    /*!< TRGIPOL (Bit 17)                                      */
#define BTIMx_SMCR_TRGIPOL_Msk            (0x20000UL)               /*!< TRGIPOL (Bitfield-Mask: 0x01)                         */
#define BTIMx_SMCR_RSTIPOL_Pos            (16UL)                    /*!< RSTIPOL (Bit 16)                                      */
#define BTIMx_SMCR_RSTIPOL_Msk            (0x10000UL)               /*!< RSTIPOL (Bitfield-Mask: 0x01)                         */
#define BTIMx_SMCR_TRGIFLT_Pos            (12UL)                    /*!< TRGIFLT (Bit 12)                                      */
#define BTIMx_SMCR_TRGIFLT_Msk            (0x7000UL)                /*!< TRGIFLT (Bitfield-Mask: 0x07)                         */
#define BTIMx_SMCR_MSM_Pos                (11UL)                    /*!< MSM (Bit 11)                                          */
#define BTIMx_SMCR_MSM_Msk                (0x800UL)                 /*!< MSM (Bitfield-Mask: 0x01)                             */
#define BTIMx_SMCR_TRGISRC_Pos            (7UL)                     /*!< TRGISRC (Bit 7)                                       */
#define BTIMx_SMCR_TRGISRC_Msk            (0x780UL)                 /*!< TRGISRC (Bitfield-Mask: 0x0f)                         */
#define BTIMx_SMCR_RSTISRC_Pos            (3UL)                     /*!< RSTISRC (Bit 3)                                       */
#define BTIMx_SMCR_RSTISRC_Msk            (0x78UL)                  /*!< RSTISRC (Bitfield-Mask: 0x0f)                         */
#define BTIMx_SMCR_SMS_Pos                (0UL)                     /*!< SMS (Bit 0)                                           */
#define BTIMx_SMCR_SMS_Msk                (0x7UL)                   /*!< SMS (Bitfield-Mask: 0x07)                             */
/* =========================================================  DIER  ========================================================== */
#define BTIMx_DIER_TDE_Pos                 (14UL)                   /*!< TDE (Bit 14)                                          */
#define BTIMx_DIER_TDE_Msk                 (0x4000UL)               /*!< TDE (Bitfield-Mask: 0x01)                             */
#define BTIMx_DIER_UDE_Pos                 (8UL)                    /*!< UDE (Bit 8)                                           */
#define BTIMx_DIER_UDE_Msk                 (0x100UL)                /*!< UDE (Bitfield-Mask: 0x01)                             */
#define BTIMx_DIER_TIE_Pos                 (6UL)                    /*!< TIE (Bit 6)                                           */
#define BTIMx_DIER_TIE_Msk                 (0x40UL)                 /*!< TIE (Bitfield-Mask: 0x01)                             */
#define BTIMx_DIER_UIE_Pos                 (0UL)                    /*!< UIE (Bit 0)                                           */
#define BTIMx_DIER_UIE_Msk                 (0x1UL)                  /*!< UIE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define BTIMx_ISR_TIF_Pos                 (6UL)                     /*!< TIF (Bit 6)                                           */
#define BTIMx_ISR_TIF_Msk                 (0x40UL)                  /*!< TIF (Bitfield-Mask: 0x01)                             */
#define BTIMx_ISR_UIF_Pos                 (0UL)                     /*!< UIF (Bit 0)                                           */
#define BTIMx_ISR_UIF_Msk                 (0x1UL)                   /*!< UIF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define BTIMx_ICR_TIF_Pos                 (6UL)                     /*!< TIF (Bit 6)                                           */
#define BTIMx_ICR_TIF_Msk                 (0x40UL)                  /*!< TIF (Bitfield-Mask: 0x01)                             */
#define BTIMx_ICR_UIF_Pos                 (0UL)                     /*!< UIF (Bit 0)                                           */
#define BTIMx_ICR_UIF_Msk                 (0x1UL)                   /*!< UIF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  EGR  ========================================================== */
#define BTIMx_EGR_TG_Pos                  (6UL)                     /*!< TG (Bit 6)                                            */
#define BTIMx_EGR_TG_Msk                  (0x40UL)                  /*!< TG (Bitfield-Mask: 0x01)                              */
#define BTIMx_EGR_UG_Pos                  (0UL)                     /*!< UG (Bit 0)                                            */
#define BTIMx_EGR_UG_Msk                  (0x1UL)                   /*!< UG (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CNT  ========================================================== */
#define BTIMx_CNT_UIFCPY_Pos              (31UL)                    /*!< UIFCPY (Bit 31)                                       */
#define BTIMx_CNT_UIFCPY_Msk              (0x80000000UL)            /*!< UIFCPY (Bitfield-Mask: 0x01)                          */
#define BTIMx_CNT_CNT_Pos                 (0UL)                     /*!< CNT (Bit 0)                                           */
#define BTIMx_CNT_CNT_Msk                 (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define BTIMx_PSC_PSC_Pos                 (0UL)                     /*!< PSC (Bit 0)                                           */
#define BTIMx_PSC_PSC_Msk                 (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  ARR  ========================================================== */
#define BTIMx_ARR_ARR_Pos                 (0UL)                     /*!< ARR (Bit 0)                                           */
#define BTIMx_ARR_ARR_Msk                 (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */


/* =========================================================================================================================== */
/* ================                                          CORDIC                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CSR  ========================================================== */
#define CORDIC_CSR_BUSY_Pos               (17UL)                    /*!< BUSY (Bit 17)                                         */
#define CORDIC_CSR_BUSY_Msk               (0x20000UL)               /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define CORDIC_CSR_EOC_Pos                (16UL)                    /*!< EOC (Bit 16)                                          */
#define CORDIC_CSR_EOC_Msk                (0x10000UL)               /*!< EOC (Bitfield-Mask: 0x01)                             */
#define CORDIC_CSR_DMAIDLE_Pos            (15UL)                    /*!< DMAIDLE (Bit 15)                                      */
#define CORDIC_CSR_DMAIDLE_Msk            (0x8000UL)                /*!< DMAIDLE (Bitfield-Mask: 0x01)                         */
#define CORDIC_CSR_DMAEOC_Pos             (14UL)                    /*!< DMAEOC (Bit 14)                                       */
#define CORDIC_CSR_DMAEOC_Msk             (0x4000UL)                /*!< DMAEOC (Bitfield-Mask: 0x01)                          */
#define CORDIC_CSR_IE_Pos                 (13UL)                    /*!< IE (Bit 13)                                           */
#define CORDIC_CSR_IE_Msk                 (0x2000UL)                /*!< IE (Bitfield-Mask: 0x01)                              */
#define CORDIC_CSR_COMP_Pos               (12UL)                    /*!< COMP (Bit 12)                                         */
#define CORDIC_CSR_COMP_Msk               (0x1000UL)                /*!< COMP (Bitfield-Mask: 0x01)                            */
#define CORDIC_CSR_ITER_Pos               (8UL)                     /*!< ITER (Bit 8)                                          */
#define CORDIC_CSR_ITER_Msk               (0xf00UL)                 /*!< ITER (Bitfield-Mask: 0x0f)                            */
#define CORDIC_CSR_FORMAT_Pos             (7UL)                     /*!< SIZE (Bit 7)                                          */
#define CORDIC_CSR_FORMAT_Msk             (0x80UL)                  /*!< SIZE (Bitfield-Mask: 0x01)                            */
#define CORDIC_CSR_SCALE_Pos              (4UL)                     /*!< SCALE (Bit 4)                                         */
#define CORDIC_CSR_SCALE_Msk              (0x70UL)                  /*!< SCALE (Bitfield-Mask: 0x07)                           */
#define CORDIC_CSR_FUNC_Pos               (0UL)                     /*!< FUNC (Bit 0)                                          */
#define CORDIC_CSR_FUNC_Msk               (0xfUL)                   /*!< FUNC (Bitfield-Mask: 0x0f)                            */
/* ==========================================================  DRX  ========================================================== */
#define CORDIC_X_X_Pos                    (0UL)                     /*!< DATA (Bit 0)                                          */
#define CORDIC_X_X_Msk                    (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* ==========================================================  DRY  ========================================================== */
#define CORDIC_Y_Y_Pos                    (0UL)                     /*!< DATA (Bit 0)                                          */
#define CORDIC_Y_Y_Msk                    (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */
/* ==========================================================  DRZ  ========================================================== */
#define CORDIC_Z_Z_Pos                    (0UL)                     /*!< DATA (Bit 0)                                          */
#define CORDIC_Z_Z_Msk                    (0xffffffffUL)            /*!< DATA (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define CRC_CR_MODE_Pos                   (0UL)                     /*!< MODE (Bit 0)                                          */
#define CRC_CR_MODE_Msk                   (0xfUL)                   /*!< MODE (Bitfield-Mask: 0x0f)                            */
/* ==========================================================  DR  =========================================================== */
#define CRC_DR_DR_Pos                     (0UL)                     /*!< DR (Bit 0)                                            */
#define CRC_DR_DR_Msk                     (0xffUL)                  /*!< DR (Bitfield-Mask: 0xff)                              */
/* ========================================================  RESULT  ========================================================= */
#define CRC_RESULT_RESULT_Pos             (0UL)                     /*!< RESULT (Bit 0)                                        */
#define CRC_RESULT_RESULT_Msk             (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */


/* =========================================================================================================================== */
/* ================                                            DAC                                            ================ */
/* =========================================================================================================================== */

