damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* ==========================================================  CR0  ========================================================== */
#define DAC_CR0_DMAUDRIE2_Pos             (29UL)                    /*!< DMAUDRIE2 (Bit 29)                                    */
#define DAC_CR0_DMAUDRIE2_Msk             (0x20000000UL)            /*!< DMAUDRIE2 (Bitfield-Mask: 0x01)                       */
#define DAC_CR0_DMAEN2_Pos                (28UL)                    /*!< DMAEN2 (Bit 28)                                       */
#define DAC_CR0_DMAEN2_Msk                (0x10000000UL)            /*!< DMAEN2 (Bitfield-Mask: 0x01)                          */
#define DAC_CR0_MAMP2_Pos                 (24UL)                    /*!< MAMP2 (Bit 24)                                        */
#define DAC_CR0_MAMP2_Msk                 (0xf000000UL)             /*!< MAMP2 (Bitfield-Mask: 0x0f)                           */
#define DAC_CR0_WAVE2_Pos                 (22UL)                    /*!< WAVE2 (Bit 22)                                        */
#define DAC_CR0_WAVE2_Msk                 (0xc00000UL)              /*!< WAVE2 (Bitfield-Mask: 0x03)                           */
#define DAC_CR0_TSEL2_Pos                 (18UL)                    /*!< TSEL2 (Bit 18)                                        */
#define DAC_CR0_TSEL2_Msk                 (0x3c0000UL)              /*!< TSEL2 (Bitfield-Mask: 0x0f)                           */
#define DAC_CR0_TEN2_Pos                  (17UL)                    /*!< TEN2 (Bit 17)                                         */
#define DAC_CR0_TEN2_Msk                  (0x20000UL)               /*!< TEN2 (Bitfield-Mask: 0x01)                            */
#define DAC_CR0_EN2_Pos                   (16UL)                    /*!< EN2 (Bit 16)                                          */
#define DAC_CR0_EN2_Msk                   (0x10000UL)               /*!< EN2 (Bitfield-Mask: 0x01)                             */
#define DAC_CR0_DMAUDRIE1_Pos             (13UL)                    /*!< DMAUDRIE1 (Bit 13)                                    */
#define DAC_CR0_DMAUDRIE1_Msk             (0x2000UL)                /*!< DMAUDRIE1 (Bitfield-Mask: 0x01)                       */
#define DAC_CR0_DMAEN1_Pos                (12UL)                    /*!< DMAEN1 (Bit 12)                                       */
#define DAC_CR0_DMAEN1_Msk                (0x1000UL)                /*!< DMAEN1 (Bitfield-Mask: 0x01)                          */
#define DAC_CR0_MAMP1_Pos                 (8UL)                     /*!< MAMP1 (Bit 8)                                         */
#define DAC_CR0_MAMP1_Msk                 (0xf00UL)                 /*!< MAMP1 (Bitfield-Mask: 0x0f)                           */
#define DAC_CR0_WAVE1_Pos                 (6UL)                     /*!< WAVE1 (Bit 6)                                         */
#define DAC_CR0_WAVE1_Msk                 (0xc0UL)                  /*!< WAVE1 (Bitfield-Mask: 0x03)                           */
#define DAC_CR0_TSEL1_Pos                 (2UL)                     /*!< TSEL1 (Bit 2)                                         */
#define DAC_CR0_TSEL1_Msk                 (0x3cUL)                  /*!< TSEL1 (Bitfield-Mask: 0x0f)                           */
#define DAC_CR0_TEN1_Pos                  (1UL)                     /*!< TEN1 (Bit 1)                                          */
#define DAC_CR0_TEN1_Msk                  (0x2UL)                   /*!< TEN1 (Bitfield-Mask: 0x01)                            */
#define DAC_CR0_EN1_Pos                   (0UL)                     /*!< EN1 (Bit 0)                                           */
#define DAC_CR0_EN1_Msk                   (0x1UL)                   /*!< EN1 (Bitfield-Mask: 0x01)                             */
/* ========================================================  SWTRGR  ========================================================= */
#define DAC_SWTRGR_SWTRIG2_Pos            (1UL)                     /*!< SWTRIG2 (Bit 1)                                       */
#define DAC_SWTRGR_SWTRIG2_Msk            (0x2UL)                   /*!< SWTRIG2 (Bitfield-Mask: 0x01)                         */
#define DAC_SWTRGR_SWTRIG1_Pos            (0UL)                     /*!< SWTRIG1 (Bit 0)                                       */
#define DAC_SWTRGR_SWTRIG1_Msk            (0x1UL)                   /*!< SWTRIG1 (Bitfield-Mask: 0x01)                         */
/* ========================================================  DHR12R1  ======================================================== */
#define DAC_DHR12R1_DATA_Pos              (0UL)                     /*!< DATA (Bit 0)                                          */
#define DAC_DHR12R1_DATA_Msk              (0xfffUL)                 /*!< DATA (Bitfield-Mask: 0xfff)                           */
/* ========================================================  DHR12L1  ======================================================== */
#define DAC_DHR12L1_DATA_Pos              (4UL)                     /*!< DATA (Bit 4)                                          */
#define DAC_DHR12L1_DATA_Msk              (0xfff0UL)                /*!< DATA (Bitfield-Mask: 0xfff)                           */
/* ========================================================  DHR8R1  ========================================================= */
#define DAC_DHR8R1_DATA_Pos               (4UL)                     /*!< DATA (Bit 4)                                          */
#define DAC_DHR8R1_DATA_Msk               (0xf0UL)                  /*!< DATA (Bitfield-Mask: 0x0f)                            */
/* ========================================================  DHR12R2  ======================================================== */
#define DAC_DHR12R2_DATA_Pos              (0UL)                     /*!< DATA (Bit 0)                                          */
#define DAC_DHR12R2_DATA_Msk              (0xfffUL)                 /*!< DATA (Bitfield-Mask: 0xfff)                           */
/* ========================================================  DHR12L2  ======================================================== */
#define DAC_DHR12L2_DATA_Pos              (4UL)                     /*!< DATA (Bit 4)                                          */
#define DAC_DHR12L2_DATA_Msk              (0xfff0UL)                /*!< DATA (Bitfield-Mask: 0xfff)                           */
/* ========================================================  DHR8R2  ========================================================= */
#define DAC_DHR8R2_DATA_Pos               (4UL)                     /*!< DATA (Bit 4)                                          */
#define DAC_DHR8R2_DATA_Msk               (0xf0UL)                  /*!< DATA (Bitfield-Mask: 0x0f)                            */
/* ========================================================  DHR12RD  ======================================================== */
#define DAC_DHR12RD_C2DATA_Pos            (16UL)                    /*!< C2DATA (Bit 16)                                       */
#define DAC_DHR12RD_C2DATA_Msk            (0xfff0000UL)             /*!< C2DATA (Bitfield-Mask: 0xfff)                         */
#define DAC_DHR12RD_C1DATA_Pos            (0UL)                     /*!< C1DATA (Bit 0)                                        */
#define DAC_DHR12RD_C1DATA_Msk            (0xfffUL)                 /*!< C1DATA (Bitfield-Mask: 0xfff)                         */
/* ========================================================  DHR12LD  ======================================================== */
#define DAC_DHR12LD_C2DATA_Pos            (20UL)                    /*!< C2DATA (Bit 20)                                       */
#define DAC_DHR12LD_C2DATA_Msk            (0xfff00000UL)            /*!< C2DATA (Bitfield-Mask: 0xfff)                         */
#define DAC_DHR12LD_C1DATA_Pos            (4UL)                     /*!< C1DATA (Bit 4)                                        */
#define DAC_DHR12LD_C1DATA_Msk            (0xfff0UL)                /*!< C1DATA (Bitfield-Mask: 0xfff)                         */
/* ========================================================  DHR8RD  ========================================================= */
#define DAC_DHR8RD_C2DATA_Pos             (8UL)                     /*!< C2DATA (Bit 8)                                        */
#define DAC_DHR8RD_C2DATA_Msk             (0xff00UL)                /*!< C2DATA (Bitfield-Mask: 0xff)                          */
#define DAC_DHR8RD_C1DATA_Pos             (0UL)                     /*!< C1DATA (Bit 0)                                        */
#define DAC_DHR8RD_C1DATA_Msk             (0xffUL)                  /*!< C1DATA (Bitfield-Mask: 0xff)                          */
/* =========================================================  DOR1  ========================================================== */
#define DAC_DOR1_DMAUDR_Pos               (15UL)                    /*!< DMAUDR (Bit 15)                                       */
#define DAC_DOR1_DMAUDR_Msk               (0x8000UL)                /*!< DMAUDR (Bitfield-Mask: 0x01)                          */
#define DAC_DOR1_DATA_Pos                 (0UL)                     /*!< DATA (Bit 0)                                          */
#define DAC_DOR1_DATA_Msk                 (0xfffUL)                 /*!< DATA (Bitfield-Mask: 0xfff)                           */
/* =========================================================  DOR2  ========================================================== */
#define DAC_DOR2_DMAUDR_Pos               (15UL)                    /*!< DMAUDR (Bit 15)                                       */
#define DAC_DOR2_DMAUDR_Msk               (0x8000UL)                /*!< DMAUDR (Bitfield-Mask: 0x01)                          */
#define DAC_DOR2_DATA_Pos                 (0UL)                     /*!< DATA (Bit 0)                                          */
#define DAC_DOR2_DATA_Msk                 (0xfffUL)                 /*!< DATA (Bitfield-Mask: 0xfff)                           */
/* ==========================================================  CR1  ========================================================== */
#define DAC_CR1_C2OUT_Pos                 (1UL)                     /*!< C2OUT (Bit 1)                                         */
#define DAC_CR1_C2OUT_Msk                 (0x2UL)                   /*!< C2OUT (Bitfield-Mask: 0x01)                           */
#define DAC_CR1_C1OUT_Pos                 (0UL)                     /*!< C1OUT (Bit 0)                                         */
#define DAC_CR1_C1OUT_Msk                 (0x1UL)                   /*!< C1OUT (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */

