damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* ==========================================================  ISR  ========================================================== */
#define DMA_ISR_TE4_Pos                   (13UL)                    /*!< TE4 (Bit 13)                                          */
#define DMA_ISR_TE4_Msk                   (0x2000UL)                /*!< TE4 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TC4_Pos                   (12UL)                    /*!< TC4 (Bit 12)                                          */
#define DMA_ISR_TC4_Msk                   (0x1000UL)                /*!< TC4 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TE3_Pos                   (9UL)                     /*!< TE3 (Bit 9)                                           */
#define DMA_ISR_TE3_Msk                   (0x200UL)                 /*!< TE3 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TC3_Pos                   (8UL)                     /*!< TC3 (Bit 8)                                           */
#define DMA_ISR_TC3_Msk                   (0x100UL)                 /*!< TC3 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TE2_Pos                   (5UL)                     /*!< TE2 (Bit 5)                                           */
#define DMA_ISR_TE2_Msk                   (0x20UL)                  /*!< TE2 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TC2_Pos                   (4UL)                     /*!< TC2 (Bit 4)                                           */
#define DMA_ISR_TC2_Msk                   (0x10UL)                  /*!< TC2 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TE1_Pos                   (1UL)                     /*!< TE1 (Bit 1)                                           */
#define DMA_ISR_TE1_Msk                   (0x2UL)                   /*!< TE1 (Bitfield-Mask: 0x01)                             */
#define DMA_ISR_TC1_Pos                   (0UL)                     /*!< TC1 (Bit 0)                                           */
#define DMA_ISR_TC1_Msk                   (0x1UL)                   /*!< TC1 (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define DMA_ICR_TE4_Pos                   (13UL)                    /*!< TE4 (Bit 13)                                          */
#define DMA_ICR_TE4_Msk                   (0x2000UL)                /*!< TE4 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TC4_Pos                   (12UL)                    /*!< TC4 (Bit 12)                                          */
#define DMA_ICR_TC4_Msk                   (0x1000UL)                /*!< TC4 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TE3_Pos                   (9UL)                     /*!< TE3 (Bit 9)                                           */
#define DMA_ICR_TE3_Msk                   (0x200UL)                 /*!< TE3 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TC3_Pos                   (8UL)                     /*!< TC3 (Bit 8)                                           */
#define DMA_ICR_TC3_Msk                   (0x100UL)                 /*!< TC3 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TE2_Pos                   (5UL)                     /*!< TE2 (Bit 5)                                           */
#define DMA_ICR_TE2_Msk                   (0x20UL)                  /*!< TE2 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TC2_Pos                   (4UL)                     /*!< TC2 (Bit 4)                                           */
#define DMA_ICR_TC2_Msk                   (0x10UL)                  /*!< TC2 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TE1_Pos                   (1UL)                     /*!< TE1 (Bit 1)                                           */
#define DMA_ICR_TE1_Msk                   (0x2UL)                   /*!< TE1 (Bitfield-Mask: 0x01)                             */
#define DMA_ICR_TC1_Pos                   (0UL)                     /*!< TC1 (Bit 0)                                           */
#define DMA_ICR_TC1_Msk                   (0x1UL)                   /*!< TC1 (Bitfield-Mask: 0x01)                             */
/* =========================================================  CSR1  ========================================================== */
#define DMA_CSR1_DSTLOAD_Pos              (15UL)                    /*!< DSTLOAD (Bit 15)                                      */
#define DMA_CSR1_DSTLOAD_Msk              (0x8000UL)                /*!< DSTLOAD (Bitfield-Mask: 0x01)                         */
#define DMA_CSR1_SRCLOAD_Pos              (14UL)                    /*!< SRCLOAD (Bit 14)                                      */
#define DMA_CSR1_SRCLOAD_Msk              (0x4000UL)                /*!< SRCLOAD (Bitfield-Mask: 0x01)                         */
#define DMA_CSR1_TE_Pos                   (13UL)                    /*!< TE (Bit 13)                                           */
#define DMA_CSR1_TE_Msk                   (0x2000UL)                /*!< TE (Bitfield-Mask: 0x01)                              */
#define DMA_CSR1_TC_Pos                   (12UL)                    /*!< TC (Bit 12)                                           */
#define DMA_CSR1_TC_Msk                   (0x1000UL)                /*!< TC (Bitfield-Mask: 0x01)                              */
#define DMA_CSR1_RESTART_Pos              (11UL)                    /*!< RESTART (Bit 11)                                      */
#define DMA_CSR1_RESTART_Msk              (0x800UL)                 /*!< RESTART (Bitfield-Mask: 0x01)                         */
#define DMA_CSR1_STATUS_Pos               (8UL)                     /*!< STATUS (Bit 8)                                        */
#define DMA_CSR1_STATUS_Msk               (0x700UL)                 /*!< STATUS (Bitfield-Mask: 0x07)                          */
#define DMA_CSR1_SIZE_Pos                 (6UL)                     /*!< SIZE (Bit 6)                                          */
#define DMA_CSR1_SIZE_Msk                 (0xc0UL)                  /*!< SIZE (Bitfield-Mask: 0x03)                            */
#define DMA_CSR1_DSTINC_Pos               (5UL)                     /*!< DSTINC (Bit 5)                                        */
#define DMA_CSR1_DSTINC_Msk               (0x20UL)                  /*!< DSTINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR1_SRCINC_Pos               (4UL)                     /*!< SRCINC (Bit 4)                                        */
#define DMA_CSR1_SRCINC_Msk               (0x10UL)                  /*!< SRCINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR1_TRANS_Pos                (3UL)                     /*!< TRANS (Bit 3)                                         */
#define DMA_CSR1_TRANS_Msk                (0x8UL)                   /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define DMA_CSR1_TEIE_Pos                 (2UL)                     /*!< TEIE (Bit 2)                                          */
#define DMA_CSR1_TEIE_Msk                 (0x4UL)                   /*!< TEIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR1_TCIE_Pos                 (1UL)                     /*!< TCIE (Bit 1)                                          */
#define DMA_CSR1_TCIE_Msk                 (0x2UL)                   /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR1_EN_Pos                   (0UL)                     /*!< EN (Bit 0)                                            */
#define DMA_CSR1_EN_Msk                   (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  TRIG1  ========================================================= */
#define DMA_TRIG1_HARDSRC_Pos             (2UL)                     /*!< HARDSRC (Bit 2)                                       */
#define DMA_TRIG1_HARDSRC_Msk             (0xfcUL)                  /*!< HARDSRC (Bitfield-Mask: 0x3f)                         */
#define DMA_TRIG1_SOFTSRC_Pos             (1UL)                     /*!< SOFTSRC (Bit 1)                                       */
#define DMA_TRIG1_SOFTSRC_Msk             (0x2UL)                   /*!< SOFTSRC (Bitfield-Mask: 0x01)                         */
#define DMA_TRIG1_TYPE_Pos                (0UL)                     /*!< TYPE (Bit 0)                                          */
#define DMA_TRIG1_TYPE_Msk                (0x1UL)                   /*!< TYPE (Bitfield-Mask: 0x01)                            */
/* =========================================================  CNT1  ========================================================== */
#define DMA_CNT1_REPEAT_Pos               (16UL)                    /*!< REPEAT (Bit 16)                                       */
#define DMA_CNT1_REPEAT_Msk               (0xf0000UL)               /*!< REPEAT (Bitfield-Mask: 0x0f)                          */
#define DMA_CNT1_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA_CNT1_CNT_Msk                  (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  SRCADDR1  ======================================================== */
#define DMA_SRCADDR1_SRCADDR_Pos          (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define DMA_SRCADDR1_SRCADDR_Msk          (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  DSTADDR1  ======================================================== */
#define DMA_DSTADDR1_DSTADDR_Pos          (0UL)                     /*!< DSTADDR (Bit 0)                                       */
#define DMA_DSTADDR1_DSTADDR_Msk          (0xffffffffUL)            /*!< DSTADDR (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  CCNT1  ========================================================= */
#define DMA_CCNT1_CREPEAT_Pos             (16UL)                    /*!< CREPEAT (Bit 16)                                      */
#define DMA_CCNT1_CREPEAT_Msk             (0xf0000UL)               /*!< CREPEAT (Bitfield-Mask: 0x0f)                         */
#define DMA_CCNT1_CCNT_Pos                (0UL)                     /*!< CCNT (Bit 0)                                          */
#define DMA_CCNT1_CCNT_Msk                (0xffffUL)                /*!< CCNT (Bitfield-Mask: 0xffff)                          */
/* =======================================================  CSRCADDR1  ======================================================= */
#define DMA_CSRCADDR1_CSRCADDR_Pos        (0UL)                     /*!< CSRCADDR (Bit 0)                                      */
#define DMA_CSRCADDR1_CSRCADDR_Msk        (0xffffffffUL)            /*!< CSRCADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  CDSTADDR1  ======================================================= */
#define DMA_CDSTADDR1_CDSTADDR_Pos        (0UL)                     /*!< CDSTADDR (Bit 0)                                      */
#define DMA_CDSTADDR1_CDSTADDR_Msk        (0xffffffffUL)            /*!< CDSTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  CSR2  ========================================================== */
#define DMA_CSR2_DSTLOAD_Pos              (15UL)                    /*!< DSTLOAD (Bit 15)                                      */
#define DMA_CSR2_DSTLOAD_Msk              (0x8000UL)                /*!< DSTLOAD (Bitfield-Mask: 0x01)                         */
#define DMA_CSR2_SRCLOAD_Pos              (14UL)                    /*!< SRCLOAD (Bit 14)                                      */
#define DMA_CSR2_SRCLOAD_Msk              (0x4000UL)                /*!< SRCLOAD (Bitfield-Mask: 0x01)                         */
#define DMA_CSR2_TE_Pos                   (13UL)                    /*!< TE (Bit 13)                                           */
#define DMA_CSR2_TE_Msk                   (0x2000UL)                /*!< TE (Bitfield-Mask: 0x01)                              */
#define DMA_CSR2_TC_Pos                   (12UL)                    /*!< TC (Bit 12)                                           */
#define DMA_CSR2_TC_Msk                   (0x1000UL)                /*!< TC (Bitfield-Mask: 0x01)                              */
#define DMA_CSR2_RESTART_Pos              (11UL)                    /*!< RESTART (Bit 11)                                      */
#define DMA_CSR2_RESTART_Msk              (0x800UL)                 /*!< RESTART (Bitfield-Mask: 0x01)                         */
#define DMA_CSR2_STATUS_Pos               (8UL)                     /*!< STATUS (Bit 8)                                        */
#define DMA_CSR2_STATUS_Msk               (0x700UL)                 /*!< STATUS (Bitfield-Mask: 0x07)                          */
#define DMA_CSR2_SIZE_Pos                 (6UL)                     /*!< SIZE (Bit 6)                                          */
#define DMA_CSR2_SIZE_Msk                 (0xc0UL)                  /*!< SIZE (Bitfield-Mask: 0x03)                            */
#define DMA_CSR2_DSTINC_Pos               (5UL)                     /*!< DSTINC (Bit 5)                                        */
#define DMA_CSR2_DSTINC_Msk               (0x20UL)                  /*!< DSTINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR2_SRCINC_Pos               (4UL)                     /*!< SRCINC (Bit 4)                                        */
#define DMA_CSR2_SRCINC_Msk               (0x10UL)                  /*!< SRCINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR2_TRANS_Pos                (3UL)                     /*!< TRANS (Bit 3)                                         */
#define DMA_CSR2_TRANS_Msk                (0x8UL)                   /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define DMA_CSR2_TEIE_Pos                 (2UL)                     /*!< TEIE (Bit 2)                                          */
#define DMA_CSR2_TEIE_Msk                 (0x4UL)                   /*!< TEIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR2_TCIE_Pos                 (1UL)                     /*!< TCIE (Bit 1)                                          */
#define DMA_CSR2_TCIE_Msk                 (0x2UL)                   /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR2_EN_Pos                   (0UL)                     /*!< EN (Bit 0)                                            */
#define DMA_CSR2_EN_Msk                   (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  CNT2  ========================================================== */
#define DMA_CNT2_REPEAT_Pos               (16UL)                    /*!< REPEAT (Bit 16)                                       */
#define DMA_CNT2_REPEAT_Msk               (0xf0000UL)               /*!< REPEAT (Bitfield-Mask: 0x0f)                          */
#define DMA_CNT2_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA_CNT2_CNT_Msk                  (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  SRCADDR2  ======================================================== */
#define DMA_SRCADDR2_SRCADDR_Pos          (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define DMA_SRCADDR2_SRCADDR_Msk          (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  DSTADDR2  ======================================================== */
#define DMA_DSTADDR2_DSTADDR_Pos          (0UL)                     /*!< DSTADDR (Bit 0)                                       */
#define DMA_DSTADDR2_DSTADDR_Msk          (0xffffffffUL)            /*!< DSTADDR (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  TRIG2  ========================================================= */
#define DMA_TRIG2_HARDSRC_Pos             (2UL)                     /*!< HARDSRC (Bit 2)                                       */
#define DMA_TRIG2_HARDSRC_Msk             (0xfcUL)                  /*!< HARDSRC (Bitfield-Mask: 0x3f)                         */
#define DMA_TRIG2_SOFTSRC_Pos             (1UL)                     /*!< SOFTSRC (Bit 1)                                       */
#define DMA_TRIG2_SOFTSRC_Msk             (0x2UL)                   /*!< SOFTSRC (Bitfield-Mask: 0x01)                         */
#define DMA_TRIG2_TYPE_Pos                (0UL)                     /*!< TYPE (Bit 0)                                          */
#define DMA_TRIG2_TYPE_Msk                (0x1UL)                   /*!< TYPE (Bitfield-Mask: 0x01)                            */
/* =========================================================  CCNT2  ========================================================= */
#define DMA_CCNT2_CREPEAT_Pos             (16UL)                    /*!< CREPEAT (Bit 16)                                      */
#define DMA_CCNT2_CREPEAT_Msk             (0xf0000UL)               /*!< CREPEAT (Bitfield-Mask: 0x0f)                         */
#define DMA_CCNT2_CCNT_Pos                (0UL)                     /*!< CCNT (Bit 0)                                          */
#define DMA_CCNT2_CCNT_Msk                (0xffffUL)                /*!< CCNT (Bitfield-Mask: 0xffff)                          */
/* =======================================================  CSRCADDR2  ======================================================= */
#define DMA_CSRCADDR2_CSRCADDR_Pos        (0UL)                     /*!< CSRCADDR (Bit 0)                                      */
#define DMA_CSRCADDR2_CSRCADDR_Msk        (0xffffffffUL)            /*!< CSRCADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  CDSTADDR2  ======================================================= */
#define DMA_CDSTADDR2_CDSTADDR_Pos        (0UL)                     /*!< CDSTADDR (Bit 0)                                      */
#define DMA_CDSTADDR2_CDSTADDR_Msk        (0xffffffffUL)            /*!< CDSTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  CSR3  ========================================================== */
#define DMA_CSR3_DSTLOAD_Pos              (15UL)                    /*!< DSTLOAD (Bit 15)                                      */
#define DMA_CSR3_DSTLOAD_Msk              (0x8000UL)                /*!< DSTLOAD (Bitfield-Mask: 0x01)                         */
#define DMA_CSR3_SRCLOAD_Pos              (14UL)                    /*!< SRCLOAD (Bit 14)                                      */
#define DMA_CSR3_SRCLOAD_Msk              (0x4000UL)                /*!< SRCLOAD (Bitfield-Mask: 0x01)                         */
#define DMA_CSR3_TE_Pos                   (13UL)                    /*!< TE (Bit 13)                                           */
#define DMA_CSR3_TE_Msk                   (0x2000UL)                /*!< TE (Bitfield-Mask: 0x01)                              */
#define DMA_CSR3_TC_Pos                   (12UL)                    /*!< TC (Bit 12)                                           */
#define DMA_CSR3_TC_Msk                   (0x1000UL)                /*!< TC (Bitfield-Mask: 0x01)                              */
#define DMA_CSR3_RESTART_Pos              (11UL)                    /*!< RESTART (Bit 11)                                      */
#define DMA_CSR3_RESTART_Msk              (0x800UL)                 /*!< RESTART (Bitfield-Mask: 0x01)                         */
#define DMA_CSR3_STATUS_Pos               (8UL)                     /*!< STATUS (Bit 8)                                        */
#define DMA_CSR3_STATUS_Msk               (0x700UL)                 /*!< STATUS (Bitfield-Mask: 0x07)                          */
#define DMA_CSR3_SIZE_Pos                 (6UL)                     /*!< SIZE (Bit 6)                                          */
#define DMA_CSR3_SIZE_Msk                 (0xc0UL)                  /*!< SIZE (Bitfield-Mask: 0x03)                            */
#define DMA_CSR3_DSTINC_Pos               (5UL)                     /*!< DSTINC (Bit 5)                                        */
#define DMA_CSR3_DSTINC_Msk               (0x20UL)                  /*!< DSTINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR3_SRCINC_Pos               (4UL)                     /*!< SRCINC (Bit 4)                                        */
#define DMA_CSR3_SRCINC_Msk               (0x10UL)                  /*!< SRCINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR3_TRANS_Pos                (3UL)                     /*!< TRANS (Bit 3)                                         */
#define DMA_CSR3_TRANS_Msk                (0x8UL)                   /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define DMA_CSR3_TEIE_Pos                 (2UL)                     /*!< TEIE (Bit 2)                                          */
#define DMA_CSR3_TEIE_Msk                 (0x4UL)                   /*!< TEIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR3_TCIE_Pos                 (1UL)                     /*!< TCIE (Bit 1)                                          */
#define DMA_CSR3_TCIE_Msk                 (0x2UL)                   /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR3_EN_Pos                   (0UL)                     /*!< EN (Bit 0)                                            */
#define DMA_CSR3_EN_Msk                   (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  CNT3  ========================================================== */
#define DMA_CNT3_REPEAT_Pos               (16UL)                    /*!< REPEAT (Bit 16)                                       */
#define DMA_CNT3_REPEAT_Msk               (0xf0000UL)               /*!< REPEAT (Bitfield-Mask: 0x0f)                          */
#define DMA_CNT3_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA_CNT3_CNT_Msk                  (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  SRCADDR3  ======================================================== */
#define DMA_SRCADDR3_SRCADDR_Pos          (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define DMA_SRCADDR3_SRCADDR_Msk          (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  DSTADDR3  ======================================================== */
#define DMA_DSTADDR3_DSTADDR_Pos          (0UL)                     /*!< DSTADDR (Bit 0)                                       */
#define DMA_DSTADDR3_DSTADDR_Msk          (0xffffffffUL)            /*!< DSTADDR (Bitfield-Mask: 0xffffffff)                   */
