damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* =========================================================  TRIG3  ========================================================= */
#define DMA_TRIG3_HARDSRC_Pos             (2UL)                     /*!< HARDSRC (Bit 2)                                       */
#define DMA_TRIG3_HARDSRC_Msk             (0xfcUL)                  /*!< HARDSRC (Bitfield-Mask: 0x3f)                         */
#define DMA_TRIG3_SOFTSRC_Pos             (1UL)                     /*!< SOFTSRC (Bit 1)                                       */
#define DMA_TRIG3_SOFTSRC_Msk             (0x2UL)                   /*!< SOFTSRC (Bitfield-Mask: 0x01)                         */
#define DMA_TRIG3_TYPE_Pos                (0UL)                     /*!< TYPE (Bit 0)                                          */
#define DMA_TRIG3_TYPE_Msk                (0x1UL)                   /*!< TYPE (Bitfield-Mask: 0x01)                            */
/* =========================================================  CCNT3  ========================================================= */
#define DMA_CCNT3_CREPEAT_Pos             (16UL)                    /*!< CREPEAT (Bit 16)                                      */
#define DMA_CCNT3_CREPEAT_Msk             (0xf0000UL)               /*!< CREPEAT (Bitfield-Mask: 0x0f)                         */
#define DMA_CCNT3_CCNT_Pos                (0UL)                     /*!< CCNT (Bit 0)                                          */
#define DMA_CCNT3_CCNT_Msk                (0xffffUL)                /*!< CCNT (Bitfield-Mask: 0xffff)                          */
/* =======================================================  CSRCADDR3  ======================================================= */
#define DMA_CSRCADDR3_CSRCADDR_Pos        (0UL)                     /*!< CSRCADDR (Bit 0)                                      */
#define DMA_CSRCADDR3_CSRCADDR_Msk        (0xffffffffUL)            /*!< CSRCADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  CDSTADDR3  ======================================================= */
#define DMA_CDSTADDR3_CDSTADDR_Pos        (0UL)                     /*!< CDSTADDR (Bit 0)                                      */
#define DMA_CDSTADDR3_CDSTADDR_Msk        (0xffffffffUL)            /*!< CDSTADDR (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  CSR4  ========================================================== */
#define DMA_CSR4_DSTLOAD_Pos              (15UL)                    /*!< DSTLOAD (Bit 15)                                      */
#define DMA_CSR4_DSTLOAD_Msk              (0x8000UL)                /*!< DSTLOAD (Bitfield-Mask: 0x01)                         */
#define DMA_CSR4_SRCLOAD_Pos              (14UL)                    /*!< SRCLOAD (Bit 14)                                      */
#define DMA_CSR4_SRCLOAD_Msk              (0x4000UL)                /*!< SRCLOAD (Bitfield-Mask: 0x01)                         */
#define DMA_CSR4_TE_Pos                   (13UL)                    /*!< TE (Bit 13)                                           */
#define DMA_CSR4_TE_Msk                   (0x2000UL)                /*!< TE (Bitfield-Mask: 0x01)                              */
#define DMA_CSR4_TC_Pos                   (12UL)                    /*!< TC (Bit 12)                                           */
#define DMA_CSR4_TC_Msk                   (0x1000UL)                /*!< TC (Bitfield-Mask: 0x01)                              */
#define DMA_CSR4_RESTART_Pos              (11UL)                    /*!< RESTART (Bit 11)                                      */
#define DMA_CSR4_RESTART_Msk              (0x800UL)                 /*!< RESTART (Bitfield-Mask: 0x01)                         */
#define DMA_CSR4_STATUS_Pos               (8UL)                     /*!< STATUS (Bit 8)                                        */
#define DMA_CSR4_STATUS_Msk               (0x700UL)                 /*!< STATUS (Bitfield-Mask: 0x07)                          */
#define DMA_CSR4_SIZE_Pos                 (6UL)                     /*!< SIZE (Bit 6)                                          */
#define DMA_CSR4_SIZE_Msk                 (0xc0UL)                  /*!< SIZE (Bitfield-Mask: 0x03)                            */
#define DMA_CSR4_DSTINC_Pos               (5UL)                     /*!< DSTINC (Bit 5)                                        */
#define DMA_CSR4_DSTINC_Msk               (0x20UL)                  /*!< DSTINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR4_SRCINC_Pos               (4UL)                     /*!< SRCINC (Bit 4)                                        */
#define DMA_CSR4_SRCINC_Msk               (0x10UL)                  /*!< SRCINC (Bitfield-Mask: 0x01)                          */
#define DMA_CSR4_TRANS_Pos                (3UL)                     /*!< TRANS (Bit 3)                                         */
#define DMA_CSR4_TRANS_Msk                (0x8UL)                   /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define DMA_CSR4_TEIE_Pos                 (2UL)                     /*!< TEIE (Bit 2)                                          */
#define DMA_CSR4_TEIE_Msk                 (0x4UL)                   /*!< TEIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR4_TCIE_Pos                 (1UL)                     /*!< TCIE (Bit 1)                                          */
#define DMA_CSR4_TCIE_Msk                 (0x2UL)                   /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define DMA_CSR4_EN_Pos                   (0UL)                     /*!< EN (Bit 0)                                            */
#define DMA_CSR4_EN_Msk                   (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  CNT4  ========================================================== */
#define DMA_CNT4_REPEAT_Pos               (16UL)                    /*!< REPEAT (Bit 16)                                       */
#define DMA_CNT4_REPEAT_Msk               (0xf0000UL)               /*!< REPEAT (Bitfield-Mask: 0x0f)                          */
#define DMA_CNT4_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMA_CNT4_CNT_Msk                  (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  SRCADDR4  ======================================================== */
#define DMA_SRCADDR4_SRCADDR_Pos          (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define DMA_SRCADDR4_SRCADDR_Msk          (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  DSTADDR4  ======================================================== */
#define DMA_DSTADDR4_DSTADDR_Pos          (0UL)                     /*!< DSTADDR (Bit 0)                                       */
#define DMA_DSTADDR4_DSTADDR_Msk          (0xffffffffUL)            /*!< DSTADDR (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  TRIG4  ========================================================= */
#define DMA_TRIG4_HARDSRC_Pos             (2UL)                     /*!< HARDSRC (Bit 2)                                       */
#define DMA_TRIG4_HARDSRC_Msk             (0xfcUL)                  /*!< HARDSRC (Bitfield-Mask: 0x3f)                         */
#define DMA_TRIG4_SOFTSRC_Pos             (1UL)                     /*!< SOFTSRC (Bit 1)                                       */
#define DMA_TRIG4_SOFTSRC_Msk             (0x2UL)                   /*!< SOFTSRC (Bitfield-Mask: 0x01)                         */
#define DMA_TRIG4_TYPE_Pos                (0UL)                     /*!< TYPE (Bit 0)                                          */
#define DMA_TRIG4_TYPE_Msk                (0x1UL)                   /*!< TYPE (Bitfield-Mask: 0x01)                            */
/* =========================================================  CCNT4  ========================================================= */
#define DMA_CCNT4_CREPEAT_Pos             (16UL)                    /*!< CREPEAT (Bit 16)                                      */
#define DMA_CCNT4_CREPEAT_Msk             (0xf0000UL)               /*!< CREPEAT (Bitfield-Mask: 0x0f)                         */
#define DMA_CCNT4_CCNT_Pos                (0UL)                     /*!< CCNT (Bit 0)                                          */
#define DMA_CCNT4_CCNT_Msk                (0xffffUL)                /*!< CCNT (Bitfield-Mask: 0xffff)                          */
/* =======================================================  CSRCADDR4  ======================================================= */
#define DMA_CSRCADDR4_CSRCADDR_Pos        (0UL)                     /*!< CSRCADDR (Bit 0)                                      */
#define DMA_CSRCADDR4_CSRCADDR_Msk        (0xffffffffUL)            /*!< CSRCADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  CDSTADDR4  ======================================================= */
#define DMA_CDSTADDR4_CDSTADDR_Pos        (0UL)                     /*!< CDSTADDR (Bit 0)                                      */
#define DMA_CDSTADDR4_CDSTADDR_Msk        (0xffffffffUL)            /*!< CDSTADDR (Bitfield-Mask: 0xffffffff)                  */


/* =========================================================================================================================== */
/* ================                                        DMACHANNEL                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  CSR  ========================================================== */
#define DMACHx_CSR_DSTLOAD_Pos       (15UL)                    /*!< DSTLOAD (Bit 15)                                      */
#define DMACHx_CSR_DSTLOAD_Msk       (0x8000UL)                /*!< DSTLOAD (Bitfield-Mask: 0x01)                         */
#define DMACHx_CSR_SRCLOAD_Pos       (14UL)                    /*!< SRCLOAD (Bit 14)                                      */
#define DMACHx_CSR_SRCLOAD_Msk       (0x4000UL)                /*!< SRCLOAD (Bitfield-Mask: 0x01)                         */
#define DMACHx_CSR_TE_Pos            (13UL)                    /*!< TE (Bit 13)                                           */
#define DMACHx_CSR_TE_Msk            (0x2000UL)                /*!< TE (Bitfield-Mask: 0x01)                              */
#define DMACHx_CSR_TC_Pos            (12UL)                    /*!< TC (Bit 12)                                           */
#define DMACHx_CSR_TC_Msk            (0x1000UL)                /*!< TC (Bitfield-Mask: 0x01)                              */
#define DMACHx_CSR_RESTART_Pos       (11UL)                    /*!< RESTART (Bit 11)                                      */
#define DMACHx_CSR_RESTART_Msk       (0x800UL)                 /*!< RESTART (Bitfield-Mask: 0x01)                         */
#define DMACHx_CSR_STATUS_Pos        (8UL)                     /*!< STATUS (Bit 8)                                        */
#define DMACHx_CSR_STATUS_Msk        (0x700UL)                 /*!< STATUS (Bitfield-Mask: 0x07)                          */
#define DMACHx_CSR_SIZE_Pos          (6UL)                     /*!< SIZE (Bit 6)                                          */
#define DMACHx_CSR_SIZE_Msk          (0xc0UL)                  /*!< SIZE (Bitfield-Mask: 0x03)                            */
#define DMACHx_CSR_DSTINC_Pos        (5UL)                     /*!< DSTINC (Bit 5)                                        */
#define DMACHx_CSR_DSTINC_Msk        (0x20UL)                  /*!< DSTINC (Bitfield-Mask: 0x01)                          */
#define DMACHx_CSR_SRCINC_Pos        (4UL)                     /*!< SRCINC (Bit 4)                                        */
#define DMACHx_CSR_SRCINC_Msk        (0x10UL)                  /*!< SRCINC (Bitfield-Mask: 0x01)                          */
#define DMACHx_CSR_TRANS_Pos         (3UL)                     /*!< TRANS (Bit 3)                                         */
#define DMACHx_CSR_TRANS_Msk         (0x8UL)                   /*!< TRANS (Bitfield-Mask: 0x01)                           */
#define DMACHx_CSR_TEIE_Pos          (2UL)                     /*!< TEIE (Bit 2)                                          */
#define DMACHx_CSR_TEIE_Msk          (0x4UL)                   /*!< TEIE (Bitfield-Mask: 0x01)                            */
#define DMACHx_CSR_TCIE_Pos          (1UL)                     /*!< TCIE (Bit 1)                                          */
#define DMACHx_CSR_TCIE_Msk          (0x2UL)                   /*!< TCIE (Bitfield-Mask: 0x01)                            */
#define DMACHx_CSR_EN_Pos            (0UL)                     /*!< EN (Bit 0)                                            */
#define DMACHx_CSR_EN_Msk            (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CNT  ========================================================== */
#define DMACHx_CNT_REPEAT_Pos        (16UL)                    /*!< REPEAT (Bit 16)                                       */
#define DMACHx_CNT_REPEAT_Msk        (0xf0000UL)               /*!< REPEAT (Bitfield-Mask: 0x0f)                          */
#define DMACHx_CNT_CNT_Pos           (0UL)                     /*!< CNT (Bit 0)                                           */
#define DMACHx_CNT_CNT_Msk           (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ========================================================  SRCADDR  ======================================================== */
#define DMACHx_SRCADDR_SRCADDR_Pos   (0UL)                     /*!< SRCADDR (Bit 0)                                       */
#define DMACHx_SRCADDR_SRCADDR_Msk   (0xffffffffUL)            /*!< SRCADDR (Bitfield-Mask: 0xffffffff)                   */
/* ========================================================  DSTADDR  ======================================================== */
#define DMACHx_DSTADDR_DSTADDR_Pos   (0UL)                     /*!< DSTADDR (Bit 0)                                       */
#define DMACHx_DSTADDR_DSTADDR_Msk   (0xffffffffUL)            /*!< DSTADDR (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  TRIG  ========================================================== */
#define DMACHx_TRIG_HARDSRC_Pos      (2UL)                     /*!< HARDSRC (Bit 2)                                       */
#define DMACHx_TRIG_HARDSRC_Msk      (0xfcUL)                  /*!< HARDSRC (Bitfield-Mask: 0x3f)                         */
#define DMACHx_TRIG_SOFTSRC_Pos      (1UL)                     /*!< SOFTSRC (Bit 1)                                       */
#define DMACHx_TRIG_SOFTSRC_Msk      (0x2UL)                   /*!< SOFTSRC (Bitfield-Mask: 0x01)                         */
#define DMACHx_TRIG_TYPE_Pos         (0UL)                     /*!< TYPE (Bit 0)                                          */
#define DMACHx_TRIG_TYPE_Msk         (0x1UL)                   /*!< TYPE (Bitfield-Mask: 0x01)                            */
/* =========================================================  CCNT  ========================================================== */
#define DMACHx_CCNT_CREPEAT_Pos      (16UL)                    /*!< CREPEAT (Bit 16)                                      */
#define DMACHx_CCNT_CREPEAT_Msk      (0xf0000UL)               /*!< CREPEAT (Bitfield-Mask: 0x0f)                         */
#define DMACHx_CCNT_CCNT_Pos         (0UL)                     /*!< CCNT (Bit 0)                                          */
#define DMACHx_CCNT_CCNT_Msk         (0xffffUL)                /*!< CCNT (Bitfield-Mask: 0xffff)                          */
/* =======================================================  CSRCADDR  ======================================================== */
#define DMACHx_CSRCADDR_CSRCADDR_Pos (0UL)                     /*!< CSRCADDR (Bit 0)                                      */
#define DMACHx_CSRCADDR_CSRCADDR_Msk (0xffffffffUL)            /*!< CSRCADDR (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  CDSTADDR  ======================================================== */
#define DMACHx_CDSTADDR_CDSTADDR_Pos (0UL)                     /*!< CDSTADDR (Bit 0)                                      */
#define DMACHx_CDSTADDR_CDSTADDR_Msk (0xffffffffUL)            /*!< CDSTADDR (Bitfield-Mask: 0xffffffff)                  */


/* =========================================================================================================================== */
/* ================                                            EAU                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CSR  ========================================================== */
#define EAU_CSR_BUSY_Pos                  (4UL)                     /*!< BUSY (Bit 4)                                          */
#define EAU_CSR_BUSY_Msk                  (0x10UL)                  /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define EAU_CSR_ZERO_Pos                  (3UL)                     /*!< ZERO (Bit 3)                                          */
#define EAU_CSR_ZERO_Msk                  (0x8UL)                   /*!< ZERO (Bitfield-Mask: 0x01)                            */
#define EAU_CSR_OVR_Pos                   (2UL)                     /*!< OVR (Bit 2)                                           */
#define EAU_CSR_OVR_Msk                   (0x4UL)                   /*!< OVR (Bitfield-Mask: 0x01)                             */
#define EAU_CSR_MODE_Pos                  (0UL)                     /*!< MODE (Bit 0)                                          */
#define EAU_CSR_MODE_Msk                  (0x3UL)                   /*!< MODE (Bitfield-Mask: 0x03)                            */
/* =======================================================  DIVIDEND  ======================================================== */
#define EAU_DIVIDEND_DIVIDEND_Pos         (0UL)                     /*!< DIVIDEND (Bit 0)                                      */
#define EAU_DIVIDEND_DIVIDEND_Msk         (0xffffffffUL)            /*!< DIVIDEND (Bitfield-Mask: 0xffffffff)                  */
/* ========================================================  DIVISOR  ======================================================== */
#define EAU_DIVISOR_DIVISOR_Pos           (0UL)                     /*!< DIVISOR (Bit 0)                                       */
#define EAU_DIVISOR_DIVISOR_Msk           (0xffffffffUL)            /*!< DIVISOR (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  QUOTIENT  ======================================================== */
#define EAU_QUOTIENT_QUOTIENT_Pos         (0UL)                     /*!< QUOTIENT (Bit 0)                                      */
#define EAU_QUOTIENT_QUOTIENT_Msk         (0xffffffffUL)            /*!< QUOTIENT (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  REMAINDER  ======================================================= */
#define EAU_REMAINDER_REMAINDER_Pos       (0UL)                     /*!< REMAINDER (Bit 0)                                     */
#define EAU_REMAINDER_REMAINDER_Msk       (0xffffffffUL)            /*!< REMAINDER (Bitfield-Mask: 0xffffffff)                 */


/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */

