damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* ==========================================================  CR1  ========================================================== */
#define GTIMx_CR1_UIFREMAP_Pos            (11UL)                    /*!< UIFREMAP (Bit 11)                                     */
#define GTIMx_CR1_UIFREMAP_Msk            (0x800UL)                 /*!< UIFREMAP (Bitfield-Mask: 0x01)                        */
#define GTIMx_CR1_CKD_Pos                 (8UL)                     /*!< CKD (Bit 8)                                           */
#define GTIMx_CR1_CKD_Msk                 (0x300UL)                 /*!< CKD (Bitfield-Mask: 0x03)                             */
#define GTIMx_CR1_ARPE_Pos                (7UL)                     /*!< ARPE (Bit 7)                                          */
#define GTIMx_CR1_ARPE_Msk                (0x80UL)                  /*!< ARPE (Bitfield-Mask: 0x01)                            */
#define GTIMx_CR1_CMS_Pos                 (5UL)                     /*!< CMS (Bit 5)                                           */
#define GTIMx_CR1_CMS_Msk                 (0x60UL)                  /*!< CMS (Bitfield-Mask: 0x03)                             */
#define GTIMx_CR1_DIR_Pos                 (4UL)                     /*!< DIR (Bit 4)                                           */
#define GTIMx_CR1_DIR_Msk                 (0x10UL)                  /*!< DIR (Bitfield-Mask: 0x01)                             */
#define GTIMx_CR1_OPM_Pos                 (3UL)                     /*!< OPM (Bit 3)                                           */
#define GTIMx_CR1_OPM_Msk                 (0x8UL)                   /*!< OPM (Bitfield-Mask: 0x01)                             */
#define GTIMx_CR1_URS_Pos                 (2UL)                     /*!< URS (Bit 2)                                           */
#define GTIMx_CR1_URS_Msk                 (0x4UL)                   /*!< URS (Bitfield-Mask: 0x01)                             */
#define GTIMx_CR1_UDIS_Pos                (1UL)                     /*!< UDIS (Bit 1)                                          */
#define GTIMx_CR1_UDIS_Msk                (0x2UL)                   /*!< UDIS (Bitfield-Mask: 0x01)                            */
#define GTIMx_CR1_CEN_Pos                 (0UL)                     /*!< CEN (Bit 0)                                           */
#define GTIMx_CR1_CEN_Msk                 (0x1UL)                   /*!< CEN (Bitfield-Mask: 0x01)                             */
/* ==========================================================  CR2  ========================================================== */
#define GTIMx_CR2_MMSH_Pos                (25UL)                    /*!< MMSH (Bit 25)                                         */
#define GTIMx_CR2_MMSH_Msk                (0x6000000UL)             /*!< MMSH (Bitfield-Mask: 0x03)                            */
#define GTIMx_CR2_TI1S_Pos                (7UL)                     /*!< TI1S (Bit 7)                                          */
#define GTIMx_CR2_TI1S_Msk                (0x80UL)                  /*!< TI1S (Bitfield-Mask: 0x01)                            */
#define GTIMx_CR2_MMS_Pos                 (4UL)                     /*!< MMS (Bit 4)                                           */
#define GTIMx_CR2_MMS_Msk                 (0x70UL)                  /*!< MMS (Bitfield-Mask: 0x07)                             */
#define GTIMx_CR2_CCDS_Pos                (3UL)                     /*!< CCDS (Bit 3)                                          */
#define GTIMx_CR2_CCDS_Msk                (0x8UL)                   /*!< CCDS (Bitfield-Mask: 0x01)                            */
/* =========================================================  SMCR  ========================================================== */
#define GTIMx_SMCR_SMSPS_Pos              (25UL)                    /*!< SMSPS (Bit 25)                                        */
#define GTIMx_SMCR_SMSPS_Msk              (0x2000000UL)             /*!< SMSPS (Bitfield-Mask: 0x01)                           */
#define GTIMx_SMCR_SMSPE_Pos              (24UL)                    /*!< SMSPE (Bit 24)                                        */
#define GTIMx_SMCR_SMSPE_Msk              (0x1000000UL)             /*!< SMSPE (Bitfield-Mask: 0x01)                           */
#define GTIMx_SMCR_TSH_Pos                (20UL)                    /*!< TSH (Bit 20)                                          */
#define GTIMx_SMCR_TSH_Msk                (0x300000UL)              /*!< TSH (Bitfield-Mask: 0x03)                             */
#define GTIMx_SMCR_SMSH_Pos               (16UL)                    /*!< SMSH (Bit 16)                                         */
#define GTIMx_SMCR_SMSH_Msk               (0x10000UL)               /*!< SMSH (Bitfield-Mask: 0x01)                            */
#define GTIMx_SMCR_ETP_Pos                (15UL)                    /*!< ETP (Bit 15)                                          */
#define GTIMx_SMCR_ETP_Msk                (0x8000UL)                /*!< ETP (Bitfield-Mask: 0x01)                             */
#define GTIMx_SMCR_ECE_Pos                (14UL)                    /*!< ECE (Bit 14)                                          */
#define GTIMx_SMCR_ECE_Msk                (0x4000UL)                /*!< ECE (Bitfield-Mask: 0x01)                             */
#define GTIMx_SMCR_ETPS_Pos               (12UL)                    /*!< ETPS (Bit 12)                                         */
#define GTIMx_SMCR_ETPS_Msk               (0x3000UL)                /*!< ETPS (Bitfield-Mask: 0x03)                            */
#define GTIMx_SMCR_ETF_Pos                (8UL)                     /*!< ETF (Bit 8)                                           */
#define GTIMx_SMCR_ETF_Msk                (0xf00UL)                 /*!< ETF (Bitfield-Mask: 0x0f)                             */
#define GTIMx_SMCR_MSM_Pos                (7UL)                     /*!< MSM (Bit 7)                                           */
#define GTIMx_SMCR_MSM_Msk                (0x80UL)                  /*!< MSM (Bitfield-Mask: 0x01)                             */
#define GTIMx_SMCR_TS_Pos                 (4UL)                     /*!< TS (Bit 4)                                            */
#define GTIMx_SMCR_TS_Msk                 (0x70UL)                  /*!< TS (Bitfield-Mask: 0x07)                              */
#define GTIMx_SMCR_OCCS_Pos               (3UL)                     /*!< OCCS (Bit 3)                                          */
#define GTIMx_SMCR_OCCS_Msk               (0x8UL)                   /*!< OCCS (Bitfield-Mask: 0x01)                            */
#define GTIMx_SMCR_SMS_Pos                (0UL)                     /*!< SMS (Bit 0)                                           */
#define GTIMx_SMCR_SMS_Msk                (0x7UL)                   /*!< SMS (Bitfield-Mask: 0x07)                             */
/* ==========================================================  IER  ========================================================== */
#define GTIMx_IER_TERRIE_Pos              (23UL)                    /*!< TERRIE (Bit 23)                                       */
#define GTIMx_IER_TERRIE_Msk              (0x800000UL)              /*!< TERRIE (Bitfield-Mask: 0x01)                          */
#define GTIMx_IER_IERRIE_Pos              (22UL)                    /*!< IERRIE (Bit 22)                                       */
#define GTIMx_IER_IERRIE_Msk              (0x400000UL)              /*!< IERRIE (Bitfield-Mask: 0x01)                          */
#define GTIMx_IER_DIRIE_Pos               (21UL)                    /*!< DIRIE (Bit 21)                                        */
#define GTIMx_IER_DIRIE_Msk               (0x200000UL)              /*!< DIRIE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_IDXIE_Pos               (20UL)                    /*!< IDXIE (Bit 20)                                        */
#define GTIMx_IER_IDXIE_Msk               (0x100000UL)              /*!< IDXIE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_TDE_Pos                 (14UL)                    /*!< TDE (Bit 14)                                          */
#define GTIMx_IER_TDE_Msk                 (0x4000UL)                /*!< TDE (Bitfield-Mask: 0x01)                             */
#define GTIMx_IER_CC4DE_Pos               (12UL)                    /*!< CC4DE (Bit 12)                                        */
#define GTIMx_IER_CC4DE_Msk               (0x1000UL)                /*!< CC4DE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_CC3DE_Pos               (11UL)                    /*!< CC3DE (Bit 11)                                        */
#define GTIMx_IER_CC3DE_Msk               (0x800UL)                 /*!< CC3DE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_CC2DE_Pos               (10UL)                    /*!< CC2DE (Bit 10)                                        */
#define GTIMx_IER_CC2DE_Msk               (0x400UL)                 /*!< CC2DE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_CC1DE_Pos               (9UL)                     /*!< CC1DE (Bit 9)                                         */
#define GTIMx_IER_CC1DE_Msk               (0x200UL)                 /*!< CC1DE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_UDE_Pos                 (8UL)                     /*!< UDE (Bit 8)                                           */
#define GTIMx_IER_UDE_Msk                 (0x100UL)                 /*!< UDE (Bitfield-Mask: 0x01)                             */
#define GTIMx_IER_TIE_Pos                 (6UL)                     /*!< TIE (Bit 6)                                           */
#define GTIMx_IER_TIE_Msk                 (0x40UL)                  /*!< TIE (Bitfield-Mask: 0x01)                             */
#define GTIMx_IER_CC4IE_Pos               (4UL)                     /*!< CC4IE (Bit 4)                                         */
#define GTIMx_IER_CC4IE_Msk               (0x10UL)                  /*!< CC4IE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_CC3IE_Pos               (3UL)                     /*!< CC3IE (Bit 3)                                         */
#define GTIMx_IER_CC3IE_Msk               (0x8UL)                   /*!< CC3IE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_CC2IE_Pos               (2UL)                     /*!< CC2IE (Bit 2)                                         */
#define GTIMx_IER_CC2IE_Msk               (0x4UL)                   /*!< CC2IE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_CC1IE_Pos               (1UL)                     /*!< CC1IE (Bit 1)                                         */
#define GTIMx_IER_CC1IE_Msk               (0x2UL)                   /*!< CC1IE (Bitfield-Mask: 0x01)                           */
#define GTIMx_IER_UIE_Pos                 (0UL)                     /*!< UIE (Bit 0)                                           */
#define GTIMx_IER_UIE_Msk                 (0x1UL)                   /*!< UIE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define GTIMx_ISR_TERRF_Pos               (23UL)                    /*!< TERRF (Bit 23)                                        */
#define GTIMx_ISR_TERRF_Msk               (0x800000UL)              /*!< TERRF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_IERRF_Pos               (22UL)                    /*!< IERRF (Bit 22)                                        */
#define GTIMx_ISR_IERRF_Msk               (0x400000UL)              /*!< IERRF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_DIRF_Pos                (21UL)                    /*!< DIRF (Bit 21)                                         */
#define GTIMx_ISR_DIRF_Msk                (0x200000UL)              /*!< DIRF (Bitfield-Mask: 0x01)                            */
#define GTIMx_ISR_IDXF_Pos                (20UL)                    /*!< IDXF (Bit 20)                                         */
#define GTIMx_ISR_IDXF_Msk                (0x100000UL)              /*!< IDXF (Bitfield-Mask: 0x01)                            */
#define GTIMx_ISR_CC4OF_Pos               (12UL)                    /*!< CC4OF (Bit 12)                                        */
#define GTIMx_ISR_CC4OF_Msk               (0x1000UL)                /*!< CC4OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC3OF_Pos               (11UL)                    /*!< CC3OF (Bit 11)                                        */
#define GTIMx_ISR_CC3OF_Msk               (0x800UL)                 /*!< CC3OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC2OF_Pos               (10UL)                    /*!< CC2OF (Bit 10)                                        */
#define GTIMx_ISR_CC2OF_Msk               (0x400UL)                 /*!< CC2OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC1OF_Pos               (9UL)                     /*!< CC1OF (Bit 9)                                         */
#define GTIMx_ISR_CC1OF_Msk               (0x200UL)                 /*!< CC1OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_TIF_Pos                 (6UL)                     /*!< TIF (Bit 6)                                           */
#define GTIMx_ISR_TIF_Msk                 (0x40UL)                  /*!< TIF (Bitfield-Mask: 0x01)                             */
#define GTIMx_ISR_CC4IF_Pos               (4UL)                     /*!< CC4IF (Bit 4)                                         */
#define GTIMx_ISR_CC4IF_Msk               (0x10UL)                  /*!< CC4IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC3IF_Pos               (3UL)                     /*!< CC3IF (Bit 3)                                         */
#define GTIMx_ISR_CC3IF_Msk               (0x8UL)                   /*!< CC3IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC2IF_Pos               (2UL)                     /*!< CC2IF (Bit 2)                                         */
#define GTIMx_ISR_CC2IF_Msk               (0x4UL)                   /*!< CC2IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_CC1IF_Pos               (1UL)                     /*!< CC1IF (Bit 1)                                         */
#define GTIMx_ISR_CC1IF_Msk               (0x2UL)                   /*!< CC1IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ISR_UIF_Pos                 (0UL)                     /*!< UIF (Bit 0)                                           */
#define GTIMx_ISR_UIF_Msk                 (0x1UL)                   /*!< UIF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define GTIMx_ICR_TERRF_Pos               (23UL)                    /*!< TERRF (Bit 23)                                        */
#define GTIMx_ICR_TERRF_Msk               (0x800000UL)              /*!< TERRF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_IERRF_Pos               (22UL)                    /*!< IERRF (Bit 22)                                        */
#define GTIMx_ICR_IERRF_Msk               (0x400000UL)              /*!< IERRF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_DIRF_Pos                (21UL)                    /*!< DIRF (Bit 21)                                         */
#define GTIMx_ICR_DIRF_Msk                (0x200000UL)              /*!< DIRF (Bitfield-Mask: 0x01)                            */
#define GTIMx_ICR_IDXF_Pos                (20UL)                    /*!< IDXF (Bit 20)                                         */
#define GTIMx_ICR_IDXF_Msk                (0x100000UL)              /*!< IDXF (Bitfield-Mask: 0x01)                            */
#define GTIMx_ICR_CC4OF_Pos               (12UL)                    /*!< CC4OF (Bit 12)                                        */
#define GTIMx_ICR_CC4OF_Msk               (0x1000UL)                /*!< CC4OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC3OF_Pos               (11UL)                    /*!< CC3OF (Bit 11)                                        */
#define GTIMx_ICR_CC3OF_Msk               (0x800UL)                 /*!< CC3OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC2OF_Pos               (10UL)                    /*!< CC2OF (Bit 10)                                        */
#define GTIMx_ICR_CC2OF_Msk               (0x400UL)                 /*!< CC2OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC1OF_Pos               (9UL)                     /*!< CC1OF (Bit 9)                                         */
#define GTIMx_ICR_CC1OF_Msk               (0x200UL)                 /*!< CC1OF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_TIF_Pos                 (6UL)                     /*!< TIF (Bit 6)                                           */
#define GTIMx_ICR_TIF_Msk                 (0x40UL)                  /*!< TIF (Bitfield-Mask: 0x01)                             */
#define GTIMx_ICR_CC4IF_Pos               (4UL)                     /*!< CC4IF (Bit 4)                                         */
#define GTIMx_ICR_CC4IF_Msk               (0x10UL)                  /*!< CC4IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC3IF_Pos               (3UL)                     /*!< CC3IF (Bit 3)                                         */
#define GTIMx_ICR_CC3IF_Msk               (0x8UL)                   /*!< CC3IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC2IF_Pos               (2UL)                     /*!< CC2IF (Bit 2)                                         */
#define GTIMx_ICR_CC2IF_Msk               (0x4UL)                   /*!< CC2IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_CC1IF_Pos               (1UL)                     /*!< CC1IF (Bit 1)                                         */
#define GTIMx_ICR_CC1IF_Msk               (0x2UL)                   /*!< CC1IF (Bitfield-Mask: 0x01)                           */
#define GTIMx_ICR_UIF_Pos                 (0UL)                     /*!< UIF (Bit 0)                                           */
#define GTIMx_ICR_UIF_Msk                 (0x1UL)                   /*!< UIF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  EGR  ========================================================== */
#define GTIMx_EGR_TG_Pos                  (6UL)                     /*!< TG (Bit 6)                                            */
#define GTIMx_EGR_TG_Msk                  (0x40UL)                  /*!< TG (Bitfield-Mask: 0x01)                              */
#define GTIMx_EGR_CC4G_Pos                (4UL)                     /*!< CC4G (Bit 4)                                          */
#define GTIMx_EGR_CC4G_Msk                (0x10UL)                  /*!< CC4G (Bitfield-Mask: 0x01)                            */
#define GTIMx_EGR_CC3G_Pos                (3UL)                     /*!< CC3G (Bit 3)                                          */
#define GTIMx_EGR_CC3G_Msk                (0x8UL)                   /*!< CC3G (Bitfield-Mask: 0x01)                            */
#define GTIMx_EGR_CC2G_Pos                (2UL)                     /*!< CC2G (Bit 2)                                          */
#define GTIMx_EGR_CC2G_Msk                (0x4UL)                   /*!< CC2G (Bitfield-Mask: 0x01)                            */
#define GTIMx_EGR_CC1G_Pos                (1UL)                     /*!< CC1G (Bit 1)                                          */
#define GTIMx_EGR_CC1G_Msk                (0x2UL)                   /*!< CC1G (Bitfield-Mask: 0x01)                            */
#define GTIMx_EGR_UG_Pos                  (0UL)                     /*!< UG (Bit 0)                                            */
#define GTIMx_EGR_UG_Msk                  (0x1UL)                   /*!< UG (Bitfield-Mask: 0x01)                              */
/* =======================================================  CCMR1CAP  ======================================================== */
#define GTIMx_CCMR1CAP_IC2F_Pos           (12UL)                    /*!< IC2F (Bit 12)                                         */
#define GTIMx_CCMR1CAP_IC2F_Msk           (0xf000UL)                /*!< IC2F (Bitfield-Mask: 0x0f)                            */
#define GTIMx_CCMR1CAP_IC2PSC_Pos         (10UL)                    /*!< IC2PSC (Bit 10)                                       */
#define GTIMx_CCMR1CAP_IC2PSC_Msk         (0xc00UL)                 /*!< IC2PSC (Bitfield-Mask: 0x03)                          */
#define GTIMx_CCMR1CAP_CC2S_Pos           (8UL)                     /*!< CC2S (Bit 8)                                          */
#define GTIMx_CCMR1CAP_CC2S_Msk           (0x300UL)                 /*!< CC2S (Bitfield-Mask: 0x03)                            */
#define GTIMx_CCMR1CAP_IC1F_Pos           (4UL)                     /*!< IC1F (Bit 4)                                          */
#define GTIMx_CCMR1CAP_IC1F_Msk           (0xf0UL)                  /*!< IC1F (Bitfield-Mask: 0x0f)                            */
#define GTIMx_CCMR1CAP_IC1PSC_Pos         (2UL)                     /*!< IC1PSC (Bit 2)                                        */
#define GTIMx_CCMR1CAP_IC1PSC_Msk         (0xcUL)                   /*!< IC1PSC (Bitfield-Mask: 0x03)                          */
#define GTIMx_CCMR1CAP_CC1S_Pos           (0UL)                     /*!< CC1S (Bit 0)                                          */
#define GTIMx_CCMR1CAP_CC1S_Msk           (0x3UL)                   /*!< CC1S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR1CMP  ======================================================== */
#define GTIMx_CCMR1CMP_OC2MH_Pos          (24UL)                    /*!< OC2MH (Bit 24)                                        */
#define GTIMx_CCMR1CMP_OC2MH_Msk          (0x1000000UL)             /*!< OC2MH (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC1MH_Pos          (16UL)                    /*!< OC1MH (Bit 16)                                        */
#define GTIMx_CCMR1CMP_OC1MH_Msk          (0x10000UL)               /*!< OC1MH (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC2CE_Pos          (15UL)                    /*!< OC2CE (Bit 15)                                        */
#define GTIMx_CCMR1CMP_OC2CE_Msk          (0x8000UL)                /*!< OC2CE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC2M_Pos           (12UL)                    /*!< OC2M (Bit 12)                                         */
#define GTIMx_CCMR1CMP_OC2M_Msk           (0x7000UL)                /*!< OC2M (Bitfield-Mask: 0x07)                            */
#define GTIMx_CCMR1CMP_OC2PE_Pos          (11UL)                    /*!< OC2PE (Bit 11)                                        */
#define GTIMx_CCMR1CMP_OC2PE_Msk          (0x800UL)                 /*!< OC2PE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC2FE_Pos          (10UL)                    /*!< OC2FE (Bit 10)                                        */
#define GTIMx_CCMR1CMP_OC2FE_Msk          (0x400UL)                 /*!< OC2FE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_CC2S_Pos           (8UL)                     /*!< CC2S (Bit 8)                                          */
