damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
#define GTIMx_CCMR1CMP_CC2S_Msk           (0x300UL)                 /*!< CC2S (Bitfield-Mask: 0x03)                            */
#define GTIMx_CCMR1CMP_OC1CE_Pos          (7UL)                     /*!< OC1CE (Bit 7)                                         */
#define GTIMx_CCMR1CMP_OC1CE_Msk          (0x80UL)                  /*!< OC1CE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC1M_Pos           (4UL)                     /*!< OC1M (Bit 4)                                          */
#define GTIMx_CCMR1CMP_OC1M_Msk           (0x70UL)                  /*!< OC1M (Bitfield-Mask: 0x07)                            */
#define GTIMx_CCMR1CMP_OC1PE_Pos          (3UL)                     /*!< OC1PE (Bit 3)                                         */
#define GTIMx_CCMR1CMP_OC1PE_Msk          (0x8UL)                   /*!< OC1PE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_OC1FE_Pos          (2UL)                     /*!< OC1FE (Bit 2)                                         */
#define GTIMx_CCMR1CMP_OC1FE_Msk          (0x4UL)                   /*!< OC1FE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR1CMP_CC1S_Pos           (0UL)                     /*!< CC1S (Bit 0)                                          */
#define GTIMx_CCMR1CMP_CC1S_Msk           (0x3UL)                   /*!< CC1S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR2CAP  ======================================================== */
#define GTIMx_CCMR2CAP_IC4F_Pos           (12UL)                    /*!< IC4F (Bit 12)                                         */
#define GTIMx_CCMR2CAP_IC4F_Msk           (0xf000UL)                /*!< IC4F (Bitfield-Mask: 0x0f)                            */
#define GTIMx_CCMR2CAP_IC4PSC_Pos         (10UL)                    /*!< IC4PSC (Bit 10)                                       */
#define GTIMx_CCMR2CAP_IC4PSC_Msk         (0xc00UL)                 /*!< IC4PSC (Bitfield-Mask: 0x03)                          */
#define GTIMx_CCMR2CAP_CC4S_Pos           (8UL)                     /*!< CC4S (Bit 8)                                          */
#define GTIMx_CCMR2CAP_CC4S_Msk           (0x300UL)                 /*!< CC4S (Bitfield-Mask: 0x03)                            */
#define GTIMx_CCMR2CAP_IC3F_Pos           (4UL)                     /*!< IC3F (Bit 4)                                          */
#define GTIMx_CCMR2CAP_IC3F_Msk           (0xf0UL)                  /*!< IC3F (Bitfield-Mask: 0x0f)                            */
#define GTIMx_CCMR2CAP_IC3PSC_Pos         (2UL)                     /*!< IC3PSC (Bit 2)                                        */
#define GTIMx_CCMR2CAP_IC3PSC_Msk         (0xcUL)                   /*!< IC3PSC (Bitfield-Mask: 0x03)                          */
#define GTIMx_CCMR2CAP_CC3S_Pos           (0UL)                     /*!< CC3S (Bit 0)                                          */
#define GTIMx_CCMR2CAP_CC3S_Msk           (0x3UL)                   /*!< CC3S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR2CMP  ======================================================== */
#define GTIMx_CCMR2CMP_OC4MH_Pos          (24UL)                    /*!< OC4MH (Bit 24)                                        */
#define GTIMx_CCMR2CMP_OC4MH_Msk          (0x1000000UL)             /*!< OC4MH (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC3MH_Pos          (16UL)                    /*!< OC3MH (Bit 16)                                        */
#define GTIMx_CCMR2CMP_OC3MH_Msk          (0x10000UL)               /*!< OC3MH (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC4CE_Pos          (15UL)                    /*!< OC4CE (Bit 15)                                        */
#define GTIMx_CCMR2CMP_OC4CE_Msk          (0x8000UL)                /*!< OC4CE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC4M_Pos           (12UL)                    /*!< OC4M (Bit 12)                                         */
#define GTIMx_CCMR2CMP_OC4M_Msk           (0x7000UL)                /*!< OC4M (Bitfield-Mask: 0x07)                            */
#define GTIMx_CCMR2CMP_OC4PE_Pos          (11UL)                    /*!< OC4PE (Bit 11)                                        */
#define GTIMx_CCMR2CMP_OC4PE_Msk          (0x800UL)                 /*!< OC4PE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC4FE_Pos          (10UL)                    /*!< OC4FE (Bit 10)                                        */
#define GTIMx_CCMR2CMP_OC4FE_Msk          (0x400UL)                 /*!< OC4FE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_CC4S_Pos           (8UL)                     /*!< CC4S (Bit 8)                                          */
#define GTIMx_CCMR2CMP_CC4S_Msk           (0x300UL)                 /*!< CC4S (Bitfield-Mask: 0x03)                            */
#define GTIMx_CCMR2CMP_OC3CE_Pos          (7UL)                     /*!< OC3CE (Bit 7)                                         */
#define GTIMx_CCMR2CMP_OC3CE_Msk          (0x80UL)                  /*!< OC3CE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC3M_Pos           (4UL)                     /*!< OC3M (Bit 4)                                          */
#define GTIMx_CCMR2CMP_OC3M_Msk           (0x70UL)                  /*!< OC3M (Bitfield-Mask: 0x07)                            */
#define GTIMx_CCMR2CMP_OC3PE_Pos          (3UL)                     /*!< OC3PE (Bit 3)                                         */
#define GTIMx_CCMR2CMP_OC3PE_Msk          (0x8UL)                   /*!< OC3PE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC3FE_Pos          (2UL)                     /*!< OC3FE (Bit 2)                                         */
#define GTIMx_CCMR2CMP_OC3FE_Msk          (0x4UL)                   /*!< OC3FE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_CC3S_Pos           (0UL)                     /*!< CC3S (Bit 0)                                          */
#define GTIMx_CCMR2CMP_CC3S_Msk           (0x3UL)                   /*!< CC3S (Bitfield-Mask: 0x03)                            */
/* =========================================================  CCER  ========================================================== */
#define GTIMx_CCER_CC4NP_Pos              (15UL)                    /*!< CC4NP (Bit 15)                                        */
#define GTIMx_CCER_CC4NP_Msk              (0x8000UL)                /*!< CC4NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC4P_Pos               (13UL)                    /*!< CC4P (Bit 13)                                         */
#define GTIMx_CCER_CC4P_Msk               (0x2000UL)                /*!< CC4P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC4E_Pos               (12UL)                    /*!< CC4E (Bit 12)                                         */
#define GTIMx_CCER_CC4E_Msk               (0x1000UL)                /*!< CC4E (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC3NP_Pos              (11UL)                    /*!< CC3NP (Bit 11)                                        */
#define GTIMx_CCER_CC3NP_Msk              (0x800UL)                 /*!< CC3NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC3P_Pos               (9UL)                     /*!< CC3P (Bit 9)                                          */
#define GTIMx_CCER_CC3P_Msk               (0x200UL)                 /*!< CC3P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC3E_Pos               (8UL)                     /*!< CC3E (Bit 8)                                          */
#define GTIMx_CCER_CC3E_Msk               (0x100UL)                 /*!< CC3E (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC2NP_Pos              (7UL)                     /*!< CC2NP (Bit 7)                                         */
#define GTIMx_CCER_CC2NP_Msk              (0x80UL)                  /*!< CC2NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC2P_Pos               (5UL)                     /*!< CC2P (Bit 5)                                          */
#define GTIMx_CCER_CC2P_Msk               (0x20UL)                  /*!< CC2P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC2E_Pos               (4UL)                     /*!< CC2E (Bit 4)                                          */
#define GTIMx_CCER_CC2E_Msk               (0x10UL)                  /*!< CC2E (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC1NP_Pos              (3UL)                     /*!< CC1NP (Bit 3)                                         */
#define GTIMx_CCER_CC1NP_Msk              (0x8UL)                   /*!< CC1NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC1P_Pos               (1UL)                     /*!< CC1P (Bit 1)                                          */
#define GTIMx_CCER_CC1P_Msk               (0x2UL)                   /*!< CC1P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC1E_Pos               (0UL)                     /*!< CC1E (Bit 0)                                          */
#define GTIMx_CCER_CC1E_Msk               (0x1UL)                   /*!< CC1E (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CNT  ========================================================== */
#define GTIMx_CNT_UIFCPY_Pos              (31UL)                    /*!< UIFCPY (Bit 31)                                       */
#define GTIMx_CNT_UIFCPY_Msk              (0x80000000UL)            /*!< UIFCPY (Bitfield-Mask: 0x01)                          */
#define GTIMx_CNT_CNT_Pos                 (0UL)                     /*!< CNT (Bit 0)                                           */
#define GTIMx_CNT_CNT_Msk                 (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define GTIMx_PSC_PSC_Pos                 (0UL)                     /*!< PSC (Bit 0)                                           */
#define GTIMx_PSC_PSC_Msk                 (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  ARR  ========================================================== */
#define GTIMx_ARR_ARR_Pos                 (0UL)                     /*!< ARR (Bit 0)                                           */
#define GTIMx_ARR_ARR_Msk                 (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* =========================================================  CCR1  ========================================================== */
#define GTIMx_CCR1_CCR1_Pos               (0UL)                     /*!< CCR1 (Bit 0)                                          */
#define GTIMx_CCR1_CCR1_Msk               (0xffffUL)                /*!< CCR1 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR2  ========================================================== */
#define GTIMx_CCR2_CCR2_Pos               (0UL)                     /*!< CCR2 (Bit 0)                                          */
#define GTIMx_CCR2_CCR2_Msk               (0xffffUL)                /*!< CCR2 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR3  ========================================================== */
#define GTIMx_CCR3_CCR3_Pos               (0UL)                     /*!< CCR3 (Bit 0)                                          */
#define GTIMx_CCR3_CCR3_Msk               (0xffffUL)                /*!< CCR3 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR4  ========================================================== */
#define GTIMx_CCR4_CCR4_Pos               (0UL)                     /*!< CCR4 (Bit 0)                                          */
#define GTIMx_CCR4_CCR4_Msk               (0xffffUL)                /*!< CCR4 (Bitfield-Mask: 0xffff)                          */
/* ==========================================================  ECR  ========================================================== */
#define GTIMx_ECR_IPOS_Pos                (6UL)                     /*!< IPOS (Bit 6)                                          */
#define GTIMx_ECR_IPOS_Msk                (0xc0UL)                  /*!< IPOS (Bitfield-Mask: 0x03)                            */
#define GTIMx_ECR_FIDX_Pos                (5UL)                     /*!< FIDX (Bit 5)                                          */
#define GTIMx_ECR_FIDX_Msk                (0x20UL)                  /*!< FIDX (Bitfield-Mask: 0x01)                            */
#define GTIMx_ECR_IDIR_Pos                (1UL)                     /*!< IDIR (Bit 1)                                          */
#define GTIMx_ECR_IDIR_Msk                (0x6UL)                   /*!< IDIR (Bitfield-Mask: 0x03)                            */
#define GTIMx_ECR_IE_Pos                  (0UL)                     /*!< IE (Bit 0)                                            */
#define GTIMx_ECR_IE_Msk                  (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =========================================================  TISEL  ========================================================= */
#define GTIMx_TISEL_TI4SEL_Pos            (24UL)                    /*!< TI4SEL (Bit 24)                                       */
#define GTIMx_TISEL_TI4SEL_Msk            (0xf000000UL)             /*!< TI4SEL (Bitfield-Mask: 0x0f)                          */
#define GTIMx_TISEL_TI3SEL_Pos            (16UL)                    /*!< TI3SEL (Bit 16)                                       */
#define GTIMx_TISEL_TI3SEL_Msk            (0xf0000UL)               /*!< TI3SEL (Bitfield-Mask: 0x0f)                          */
#define GTIMx_TISEL_TI2SEL_Pos            (8UL)                     /*!< TI2SEL (Bit 8)                                        */
#define GTIMx_TISEL_TI2SEL_Msk            (0xf00UL)                 /*!< TI2SEL (Bitfield-Mask: 0x0f)                          */
#define GTIMx_TISEL_TI1SEL_Pos            (0UL)                     /*!< TI1SEL (Bit 0)                                        */
#define GTIMx_TISEL_TI1SEL_Msk            (0xfUL)                   /*!< TI1SEL (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  AF1  ========================================================== */
#define GTIMx_AF1_ETRSEL_Pos              (14UL)                    /*!< ETRSEL (Bit 14)                                       */
#define GTIMx_AF1_ETRSEL_Msk              (0x3c000UL)               /*!< ETRSEL (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  AF2  ========================================================== */
#define GTIMx_AF2_OCRSEL_Pos              (16UL)                    /*!< OCRSEL (Bit 16)                                       */
#define GTIMx_AF2_OCRSEL_Msk              (0x70000UL)               /*!< OCRSEL (Bitfield-Mask: 0x07)                          */


/* =========================================================================================================================== */
/* ================                                          HALLTIM                                          ================ */
/* =========================================================================================================================== */

