damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* ==========================================================  CR  =========================================================== */
#define HALLTIM_CR_SOFTCAP_Pos            (23UL)                    /*!< SOFTCAP (Bit 23)                                      */
#define HALLTIM_CR_SOFTCAP_Msk            (0x800000UL)              /*!< SOFTCAP (Bitfield-Mask: 0x01)                         */
#define HALLTIM_CR_FLT2LEN_Pos            (8UL)                     /*!< FLT2LEN (Bit 8)                                       */
#define HALLTIM_CR_FLT2LEN_Msk            (0x7fff00UL)              /*!< FLT2LEN (Bitfield-Mask: 0x7fff)                       */
#define HALLTIM_CR_MMS_Pos                (4UL)                     /*!< MMS (Bit 4)                                           */
#define HALLTIM_CR_MMS_Msk                (0x70UL)                  /*!< MMS (Bitfield-Mask: 0x07)                             */
#define HALLTIM_CR_DIV_Pos                (2UL)                     /*!< DIV (Bit 2)                                           */
#define HALLTIM_CR_DIV_Msk                (0xcUL)                   /*!< DIV (Bitfield-Mask: 0x03)                             */
#define HALLTIM_CR_FLT1EN_Pos             (1UL)                     /*!< FLT1EN (Bit 1)                                        */
#define HALLTIM_CR_FLT1EN_Msk             (0x2UL)                   /*!< FLT1EN (Bitfield-Mask: 0x01)                          */
#define HALLTIM_CR_EN_Pos                 (0UL)                     /*!< EN (Bit 0)                                            */
#define HALLTIM_CR_EN_Msk                 (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  DIER  ========================================================== */
#define HALLTIM_DIER_SOFTDMA_Pos          (7UL)                     /*!< SOFTDMA (Bit 7)                                       */
#define HALLTIM_DIER_SOFTDMA_Msk          (0x80UL)                  /*!< SOFTDMA (Bitfield-Mask: 0x01)                         */
#define HALLTIM_DIER_MATCHDMA_Pos         (6UL)                     /*!< MATCHDMA (Bit 6)                                      */
#define HALLTIM_DIER_MATCHDMA_Msk         (0x40UL)                  /*!< MATCHDMA (Bitfield-Mask: 0x01)                        */
#define HALLTIM_DIER_OVDMA_Pos            (5UL)                     /*!< OVDMA (Bit 5)                                         */
#define HALLTIM_DIER_OVDMA_Msk            (0x20UL)                  /*!< OVDMA (Bitfield-Mask: 0x01)                           */
#define HALLTIM_DIER_CAPDMA_Pos           (4UL)                     /*!< CAPDMA (Bit 4)                                        */
#define HALLTIM_DIER_CAPDMA_Msk           (0x10UL)                  /*!< CAPDMA (Bitfield-Mask: 0x01)                          */
#define HALLTIM_DIER_MATCHIE_Pos          (2UL)                     /*!< MATCHIE (Bit 2)                                       */
#define HALLTIM_DIER_MATCHIE_Msk          (0x4UL)                   /*!< MATCHIE (Bitfield-Mask: 0x01)                         */
#define HALLTIM_DIER_OVIE_Pos             (1UL)                     /*!< OVIE (Bit 1)                                          */
#define HALLTIM_DIER_OVIE_Msk             (0x2UL)                   /*!< OVIE (Bitfield-Mask: 0x01)                            */
#define HALLTIM_DIER_CAPIE_Pos            (0UL)                     /*!< CAPIE (Bit 0)                                         */
#define HALLTIM_DIER_CAPIE_Msk            (0x1UL)                   /*!< CAPIE (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CNT  ========================================================== */
#define HALLTIM_CNT_DATA_Pos              (0UL)                     /*!< DATA (Bit 0)                                          */
#define HALLTIM_CNT_DATA_Msk              (0xffffffUL)              /*!< DATA (Bitfield-Mask: 0xffffff)                        */
/* ==========================================================  ARR  ========================================================== */
#define HALLTIM_ARR_DATA_Pos              (0UL)                     /*!< DATA (Bit 0)                                          */
#define HALLTIM_ARR_DATA_Msk              (0xffffffUL)              /*!< DATA (Bitfield-Mask: 0xffffff)                        */
/* =========================================================  WIDTH  ========================================================= */
#define HALLTIM_WIDTH_DATA_Pos            (0UL)                     /*!< DATA (Bit 0)                                          */
#define HALLTIM_WIDTH_DATA_Msk            (0xffffffUL)              /*!< DATA (Bitfield-Mask: 0xffffff)                        */
/* ==========================================================  CCR  ========================================================== */
#define HALLTIM_CCR_DATA_Pos              (0UL)                     /*!< DATA (Bit 0)                                          */
#define HALLTIM_CCR_DATA_Msk              (0xffffffUL)              /*!< DATA (Bitfield-Mask: 0xffffff)                        */
/* ==========================================================  ISR  ========================================================== */
#define HALLTIM_ISR_MATCH_Pos             (2UL)                     /*!< MATCH (Bit 2)                                         */
#define HALLTIM_ISR_MATCH_Msk             (0x4UL)                   /*!< MATCH (Bitfield-Mask: 0x01)                           */
#define HALLTIM_ISR_OV_Pos                (1UL)                     /*!< OV (Bit 1)                                            */
#define HALLTIM_ISR_OV_Msk                (0x2UL)                   /*!< OV (Bitfield-Mask: 0x01)                              */
#define HALLTIM_ISR_CAPF_Pos              (0UL)                     /*!< CAPF (Bit 0)                                          */
#define HALLTIM_ISR_CAPF_Msk              (0x1UL)                   /*!< CAPF (Bitfield-Mask: 0x01)                            */
/* ==========================================================  ICR  ========================================================== */
#define HALLTIM_ICR_MATCHF_Pos            (2UL)                     /*!< MATCHF (Bit 2)                                        */
#define HALLTIM_ICR_MATCHF_Msk            (0x4UL)                   /*!< MATCHF (Bitfield-Mask: 0x01)                          */
#define HALLTIM_ICR_OVF_Pos               (1UL)                     /*!< OVF (Bit 1)                                           */
#define HALLTIM_ICR_OVF_Msk               (0x2UL)                   /*!< OVF (Bitfield-Mask: 0x01)                             */
#define HALLTIM_ICR_CAPF_Pos              (0UL)                     /*!< CAPF (Bit 0)                                          */
#define HALLTIM_ICR_CAPF_Msk              (0x1UL)                   /*!< CAPF (Bitfield-Mask: 0x01)                            */
/* =========================================================  STATE  ========================================================= */
#define HALLTIM_STATE_CH3S_Pos            (6UL)                     /*!< CH3S (Bit 6)                                          */
#define HALLTIM_STATE_CH3S_Msk            (0x40UL)                  /*!< CH3S (Bitfield-Mask: 0x01)                            */
#define HALLTIM_STATE_CH2S_Pos            (5UL)                     /*!< CH2S (Bit 5)                                          */
#define HALLTIM_STATE_CH2S_Msk            (0x20UL)                  /*!< CH2S (Bitfield-Mask: 0x01)                            */
#define HALLTIM_STATE_CH1S_Pos            (4UL)                     /*!< CH1S (Bit 4)                                          */
#define HALLTIM_STATE_CH1S_Msk            (0x10UL)                  /*!< CH1S (Bitfield-Mask: 0x01)                            */
#define HALLTIM_STATE_CH3F_Pos            (2UL)                     /*!< CH3F (Bit 2)                                          */
#define HALLTIM_STATE_CH3F_Msk            (0x4UL)                   /*!< CH3F (Bitfield-Mask: 0x01)                            */
#define HALLTIM_STATE_CH2F_Pos            (1UL)                     /*!< CH2F (Bit 1)                                          */
#define HALLTIM_STATE_CH2F_Msk            (0x2UL)                   /*!< CH2F (Bitfield-Mask: 0x01)                            */
#define HALLTIM_STATE_CH1F_Pos            (0UL)                     /*!< CH1F (Bit 0)                                          */
#define HALLTIM_STATE_CH1F_Msk            (0x1UL)                   /*!< CH1F (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */

