damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* =========================================================  INSEL  ========================================================= */
#define I2Cx_INSEL_SDAINSEL_Pos           (3UL)                     /*!< SDAINSEL (Bit 3)                                      */
#define I2Cx_INSEL_SDAINSEL_Msk           (0x38UL)                  /*!< SDAINSEL (Bitfield-Mask: 0x07)                        */
#define I2Cx_INSEL_SCLINSEL_Pos           (0UL)                     /*!< SCLINSEL (Bit 0)                                      */
#define I2Cx_INSEL_SCLINSEL_Msk           (0x7UL)                   /*!< SCLINSEL (Bitfield-Mask: 0x07)                        */
/* =========================================================  MCR0  ========================================================== */
#define I2Cx_MCR0_RXFIFORST_Pos           (9UL)                     /*!< RXFIFORST (Bit 9)                                     */
#define I2Cx_MCR0_RXFIFORST_Msk           (0x200UL)                 /*!< RXFIFORST (Bitfield-Mask: 0x01)                       */
#define I2Cx_MCR0_TXFIFORST_Pos           (8UL)                     /*!< TXFIFORST (Bit 8)                                     */
#define I2Cx_MCR0_TXFIFORST_Msk           (0x100UL)                 /*!< TXFIFORST (Bitfield-Mask: 0x01)                       */
#define I2Cx_MCR0_CLKSRC_Pos              (6UL)                     /*!< CLKSRC (Bit 6)                                        */
#define I2Cx_MCR0_CLKSRC_Msk              (0xc0UL)                  /*!< CLKSRC (Bitfield-Mask: 0x03)                          */
#define I2Cx_MCR0_DBGEN_Pos               (3UL)                     /*!< DBGEN (Bit 3)                                         */
#define I2Cx_MCR0_DBGEN_Msk               (0x8UL)                   /*!< DBGEN (Bitfield-Mask: 0x01)                           */
#define I2Cx_MCR0_SLEEPEN_Pos             (2UL)                     /*!< SLEEPEN (Bit 2)                                       */
#define I2Cx_MCR0_SLEEPEN_Msk             (0x4UL)                   /*!< SLEEPEN (Bitfield-Mask: 0x01)                         */
#define I2Cx_MCR0_RESET_Pos               (1UL)                     /*!< RESET (Bit 1)                                         */
#define I2Cx_MCR0_RESET_Msk               (0x2UL)                   /*!< RESET (Bitfield-Mask: 0x01)                           */
#define I2Cx_MCR0_MEN_Pos                 (0UL)                     /*!< MEN (Bit 0)                                           */
#define I2Cx_MCR0_MEN_Msk                 (0x1UL)                   /*!< MEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  MCR1  ========================================================== */
#define I2Cx_MCR1_RDMO_Pos                (9UL)                     /*!< RDMO (Bit 9)                                          */
#define I2Cx_MCR1_RDMO_Msk                (0x200UL)                 /*!< RDMO (Bitfield-Mask: 0x01)                            */
#define I2Cx_MCR1_CIRFIFO_Pos             (8UL)                     /*!< CIRFIFO (Bit 8)                                       */
#define I2Cx_MCR1_CIRFIFO_Msk             (0x100UL)                 /*!< CIRFIFO (Bitfield-Mask: 0x01)                         */
/* =========================================================  MCR2  ========================================================== */
#define I2Cx_MCR2_PINCFG_Pos              (24UL)                    /*!< PINCFG (Bit 24)                                       */
#define I2Cx_MCR2_PINCFG_Msk              (0x7000000UL)             /*!< PINCFG (Bitfield-Mask: 0x07)                          */
#define I2Cx_MCR2_MATCFG_Pos              (16UL)                    /*!< MATCFG (Bit 16)                                       */
#define I2Cx_MCR2_MATCFG_Msk              (0x70000UL)               /*!< MATCFG (Bitfield-Mask: 0x07)                          */
#define I2Cx_MCR2_TRGSEL_Pos              (15UL)                    /*!< TRGSEL (Bit 15)                                       */
#define I2Cx_MCR2_TRGSEL_Msk              (0x8000UL)                /*!< TRGSEL (Bitfield-Mask: 0x01)                          */
#define I2Cx_MCR2_TIMECFG_Pos             (10UL)                    /*!< TIMECFG (Bit 10)                                      */
#define I2Cx_MCR2_TIMECFG_Msk             (0x400UL)                 /*!< TIMECFG (Bitfield-Mask: 0x01)                         */
#define I2Cx_MCR2_IGNACK_Pos              (9UL)                     /*!< IGNACK (Bit 9)                                        */
#define I2Cx_MCR2_IGNACK_Msk              (0x200UL)                 /*!< IGNACK (Bitfield-Mask: 0x01)                          */
#define I2Cx_MCR2_AUTOSTOP_Pos            (8UL)                     /*!< AUTOSTOP (Bit 8)                                      */
#define I2Cx_MCR2_AUTOSTOP_Msk            (0x100UL)                 /*!< AUTOSTOP (Bitfield-Mask: 0x01)                        */
#define I2Cx_MCR2_PRESCALE_Pos            (0UL)                     /*!< PRESCALE (Bit 0)                                      */
#define I2Cx_MCR2_PRESCALE_Msk            (0x7UL)                   /*!< PRESCALE (Bitfield-Mask: 0x07)                        */
/* =========================================================  MCR3  ========================================================== */
#define I2Cx_MCR3_FLTSDA_Pos              (24UL)                    /*!< FLTSDA (Bit 24)                                       */
#define I2Cx_MCR3_FLTSDA_Msk              (0xf000000UL)             /*!< FLTSDA (Bitfield-Mask: 0x0f)                          */
#define I2Cx_MCR3_FLTSCL_Pos              (16UL)                    /*!< FLTSCL (Bit 16)                                       */
#define I2Cx_MCR3_FLTSCL_Msk              (0xf0000UL)               /*!< FLTSCL (Bitfield-Mask: 0x0f)                          */
#define I2Cx_MCR3_BUSIDLE_Pos             (0UL)                     /*!< BUSIDLE (Bit 0)                                       */
#define I2Cx_MCR3_BUSIDLE_Msk             (0xfffUL)                 /*!< BUSIDLE (Bitfield-Mask: 0xfff)                        */
/* =========================================================  MCR4  ========================================================== */
#define I2Cx_MCR4_PINLOW_Pos              (8UL)                     /*!< PINLOW (Bit 8)                                        */
#define I2Cx_MCR4_PINLOW_Msk              (0xfff00UL)               /*!< PINLOW (Bitfield-Mask: 0xfff)                         */
/* =========================================================  MCCR  ========================================================= */
#define I2Cx_MCCR_DATAVD_Pos             (24UL)                    /*!< DATAVD (Bit 24)                                       */
#define I2Cx_MCCR_DATAVD_Msk             (0x3f000000UL)            /*!< DATAVD (Bitfield-Mask: 0x3f)                          */
#define I2Cx_MCCR_SETHOLD_Pos            (16UL)                    /*!< SETHOLD (Bit 16)                                      */
#define I2Cx_MCCR_SETHOLD_Msk            (0x3f0000UL)              /*!< SETHOLD (Bitfield-Mask: 0x3f)                         */
#define I2Cx_MCCR_CLKHI_Pos              (8UL)                     /*!< CLKHI (Bit 8)                                         */
#define I2Cx_MCCR_CLKHI_Msk              (0x3f00UL)                /*!< CLKHI (Bitfield-Mask: 0x3f)                           */
#define I2Cx_MCCR_CLKLO_Pos              (0UL)                     /*!< CLKLO (Bit 0)                                         */
#define I2Cx_MCCR_CLKLO_Msk              (0x3fUL)                  /*!< CLKLO (Bitfield-Mask: 0x3f)                           */
/* ========================================================  MMATCH  ========================================================= */
#define I2Cx_MMATCH_MATCH1_Pos            (16UL)                    /*!< MATCH1 (Bit 16)                                       */
#define I2Cx_MMATCH_MATCH1_Msk            (0xff0000UL)              /*!< MATCH1 (Bitfield-Mask: 0xff)                          */
#define I2Cx_MMATCH_MATCH0_Pos            (0UL)                     /*!< MATCH0 (Bit 0)                                        */
#define I2Cx_MMATCH_MATCH0_Msk            (0xffUL)                  /*!< MATCH0 (Bitfield-Mask: 0xff)                          */
/* ========================================================  MFIFOCR  ======================================================== */
#define I2Cx_MFIFOCR_RXWATER_Pos          (16UL)                    /*!< RXWATER (Bit 16)                                      */
#define I2Cx_MFIFOCR_RXWATER_Msk          (0x10000UL)               /*!< RXWATER (Bitfield-Mask: 0x01)                         */
#define I2Cx_MFIFOCR_TXWATER_Pos          (0UL)                     /*!< TXWATER (Bit 0)                                       */
#define I2Cx_MFIFOCR_TXWATER_Msk          (0x1UL)                   /*!< TXWATER (Bitfield-Mask: 0x01)                         */
/* ========================================================  MFIFOSR  ======================================================== */
#define I2Cx_MFIFOSR_RXCNT_Pos            (16UL)                    /*!< RXCNT (Bit 16)                                        */
#define I2Cx_MFIFOSR_RXCNT_Msk            (0x10000UL)               /*!< RXCNT (Bitfield-Mask: 0x01)                           */
#define I2Cx_MFIFOSR_TXCNT_Pos            (0UL)                     /*!< TXCNT (Bit 0)                                         */
#define I2Cx_MFIFOSR_TXCNT_Msk            (0x1UL)                   /*!< TXCNT (Bitfield-Mask: 0x01)                           */
/* =========================================================  MTDR  ========================================================== */
#define I2Cx_MTDR_CMD_Pos                 (8UL)                     /*!< CMD (Bit 8)                                           */
#define I2Cx_MTDR_CMD_Msk                 (0x700UL)                 /*!< CMD (Bitfield-Mask: 0x07)                             */
#define I2Cx_MTDR_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define I2Cx_MTDR_DATA_Msk                (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =========================================================  MRDR  ========================================================== */
#define I2Cx_MRDR_EMPTY_Pos               (14UL)                    /*!< EMPTY (Bit 14)                                        */
#define I2Cx_MRDR_EMPTY_Msk               (0x4000UL)                /*!< EMPTY (Bitfield-Mask: 0x01)                           */
#define I2Cx_MRDR_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define I2Cx_MRDR_DATA_Msk                (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =========================================================  MDER  ========================================================== */
#define I2Cx_MDER_RXNE_Pos                (1UL)                     /*!< RXNE (Bit 1)                                          */
#define I2Cx_MDER_RXNE_Msk                (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define I2Cx_MDER_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define I2Cx_MDER_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* =========================================================  MIER  ========================================================== */
#define I2Cx_MIER_MATCH_Pos               (14UL)                    /*!< MATCH (Bit 14)                                        */
#define I2Cx_MIER_MATCH_Msk               (0x4000UL)                /*!< MATCH (Bitfield-Mask: 0x01)                           */
#define I2Cx_MIER_PINLOW_Pos              (13UL)                    /*!< PINLOW (Bit 13)                                       */
#define I2Cx_MIER_PINLOW_Msk              (0x2000UL)                /*!< PINLOW (Bitfield-Mask: 0x01)                          */
#define I2Cx_MIER_FIFO_Pos                (12UL)                    /*!< FIFO (Bit 12)                                         */
#define I2Cx_MIER_FIFO_Msk                (0x1000UL)                /*!< FIFO (Bitfield-Mask: 0x01)                            */
#define I2Cx_MIER_ARBI_Pos                (11UL)                    /*!< ARBI (Bit 11)                                         */
#define I2Cx_MIER_ARBI_Msk                (0x800UL)                 /*!< ARBI (Bitfield-Mask: 0x01)                            */
#define I2Cx_MIER_NACK_Pos                (10UL)                    /*!< NACK (Bit 10)                                         */
#define I2Cx_MIER_NACK_Msk                (0x400UL)                 /*!< NACK (Bitfield-Mask: 0x01)                            */
#define I2Cx_MIER_STOP_Pos                (9UL)                     /*!< STOP (Bit 9)                                          */
#define I2Cx_MIER_STOP_Msk                (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define I2Cx_MIER_PACKET_Pos              (8UL)                     /*!< PACKET (Bit 8)                                        */
#define I2Cx_MIER_PACKET_Msk              (0x100UL)                 /*!< PACKET (Bitfield-Mask: 0x01)                          */
#define I2Cx_MIER_RXNE_Pos                (1UL)                     /*!< RXNE (Bit 1)                                          */
#define I2Cx_MIER_RXNE_Msk                (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define I2Cx_MIER_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define I2Cx_MIER_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* =========================================================  MISR  ========================================================== */
#define I2Cx_MISR_BUSBUSY_Pos             (25UL)                    /*!< BUSBUSY (Bit 25)                                      */
#define I2Cx_MISR_BUSBUSY_Msk             (0x2000000UL)             /*!< BUSBUSY (Bitfield-Mask: 0x01)                         */
#define I2Cx_MISR_MSTBUSY_Pos             (24UL)                    /*!< MSTBUSY (Bit 24)                                      */
#define I2Cx_MISR_MSTBUSY_Msk             (0x1000000UL)             /*!< MSTBUSY (Bitfield-Mask: 0x01)                         */
#define I2Cx_MISR_MATCH_Pos               (14UL)                    /*!< MATCH (Bit 14)                                        */
#define I2Cx_MISR_MATCH_Msk               (0x4000UL)                /*!< MATCH (Bitfield-Mask: 0x01)                           */
#define I2Cx_MISR_PINLOW_Pos              (13UL)                    /*!< PINLOW (Bit 13)                                       */
#define I2Cx_MISR_PINLOW_Msk              (0x2000UL)                /*!< PINLOW (Bitfield-Mask: 0x01)                          */
#define I2Cx_MISR_FIFO_Pos                (12UL)                    /*!< FIFO (Bit 12)                                         */
#define I2Cx_MISR_FIFO_Msk                (0x1000UL)                /*!< FIFO (Bitfield-Mask: 0x01)                            */
#define I2Cx_MISR_ARBI_Pos                (11UL)                    /*!< ARBI (Bit 11)                                         */
#define I2Cx_MISR_ARBI_Msk                (0x800UL)                 /*!< ARBI (Bitfield-Mask: 0x01)                            */
#define I2Cx_MISR_NACK_Pos                (10UL)                    /*!< NACK (Bit 10)                                         */
#define I2Cx_MISR_NACK_Msk                (0x400UL)                 /*!< NACK (Bitfield-Mask: 0x01)                            */
#define I2Cx_MISR_STOP_Pos                (9UL)                     /*!< STOP (Bit 9)                                          */
#define I2Cx_MISR_STOP_Msk                (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define I2Cx_MISR_PACKET_Pos              (8UL)                     /*!< PACKET (Bit 8)                                        */
#define I2Cx_MISR_PACKET_Msk              (0x100UL)                 /*!< PACKET (Bitfield-Mask: 0x01)                          */
#define I2Cx_MISR_RXNE_Pos                (1UL)                     /*!< RXNE (Bit 1)                                          */
#define I2Cx_MISR_RXNE_Msk                (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define I2Cx_MISR_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define I2Cx_MISR_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* =========================================================  MICR  ========================================================== */
#define I2Cx_MICR_MATCH_Pos               (14UL)                    /*!< MATCH (Bit 14)                                        */
#define I2Cx_MICR_MATCH_Msk               (0x4000UL)                /*!< MATCH (Bitfield-Mask: 0x01)                           */
#define I2Cx_MICR_PINLOW_Pos              (13UL)                    /*!< PINLOW (Bit 13)                                       */
#define I2Cx_MICR_PINLOW_Msk              (0x2000UL)                /*!< PINLOW (Bitfield-Mask: 0x01)                          */
#define I2Cx_MICR_FIFO_Pos                (12UL)                    /*!< FIFO (Bit 12)                                         */
#define I2Cx_MICR_FIFO_Msk                (0x1000UL)                /*!< FIFO (Bitfield-Mask: 0x01)                            */
#define I2Cx_MICR_ARBI_Pos                (11UL)                    /*!< ARBI (Bit 11)                                         */
#define I2Cx_MICR_ARBI_Msk                (0x800UL)                 /*!< ARBI (Bitfield-Mask: 0x01)                            */
#define I2Cx_MICR_NACK_Pos                (10UL)                    /*!< NACK (Bit 10)                                         */
#define I2Cx_MICR_NACK_Msk                (0x400UL)                 /*!< NACK (Bitfield-Mask: 0x01)                            */
#define I2Cx_MICR_STOP_Pos                (9UL)                     /*!< STOP (Bit 9)                                          */
#define I2Cx_MICR_STOP_Msk                (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define I2Cx_MICR_PACKET_Pos              (8UL)                     /*!< PACKET (Bit 8)                                        */
#define I2Cx_MICR_PACKET_Msk              (0x100UL)                 /*!< PACKET (Bitfield-Mask: 0x01)                          */
/* =========================================================  SCR0  ========================================================== */
#define I2Cx_SCR0_RXFIFORST_Pos           (9UL)                     /*!< RXFIFORST (Bit 9)                                     */
#define I2Cx_SCR0_RXFIFORST_Msk           (0x200UL)                 /*!< RXFIFORST (Bitfield-Mask: 0x01)                       */
#define I2Cx_SCR0_TXFIFORST_Pos           (8UL)                     /*!< TXFIFORST (Bit 8)                                     */
#define I2Cx_SCR0_TXFIFORST_Msk           (0x100UL)                 /*!< TXFIFORST (Bitfield-Mask: 0x01)                       */
#define I2Cx_SCR0_CLKSRC_Pos              (6UL)                     /*!< CLKSRC (Bit 6)                                        */
#define I2Cx_SCR0_CLKSRC_Msk              (0xc0UL)                  /*!< CLKSRC (Bitfield-Mask: 0x03)                          */
#define I2Cx_SCR0_FLTEN_Pos               (4UL)                     /*!< FLTEN (Bit 4)                                         */
#define I2Cx_SCR0_FLTEN_Msk               (0x10UL)                  /*!< FLTEN (Bitfield-Mask: 0x01)                           */
#define I2Cx_SCR0_RESET_Pos               (1UL)                     /*!< RESET (Bit 1)                                         */
#define I2Cx_SCR0_RESET_Msk               (0x2UL)                   /*!< RESET (Bitfield-Mask: 0x01)                           */
#define I2Cx_SCR0_SEN_Pos                 (0UL)                     /*!< SEN (Bit 0)                                           */
#define I2Cx_SCR0_SEN_Msk                 (0x1UL)                   /*!< SEN (Bitfield-Mask: 0x01)                             */
/* =========================================================  SCR1  ========================================================== */
#define I2Cx_SCR1_ADDRCFG_Pos             (16UL)                    /*!< ADDRCFG (Bit 16)                                      */
#define I2Cx_SCR1_ADDRCFG_Msk             (0x70000UL)               /*!< ADDRCFG (Bitfield-Mask: 0x07)                         */
#define I2Cx_SCR1_TRGSEL_Pos              (15UL)                    /*!< TRGSEL (Bit 15)                                       */
#define I2Cx_SCR1_TRGSEL_Msk              (0x8000UL)                /*!< TRGSEL (Bitfield-Mask: 0x01)                          */
#define I2Cx_SCR1_IGNACK_Pos              (12UL)                    /*!< IGNACK (Bit 12)                                       */
#define I2Cx_SCR1_IGNACK_Msk              (0x1000UL)                /*!< IGNACK (Bitfield-Mask: 0x01)                          */
#define I2Cx_SCR1_RXCFG_Pos               (11UL)                    /*!< RXCFG (Bit 11)                                        */
#define I2Cx_SCR1_RXCFG_Msk               (0x800UL)                 /*!< RXCFG (Bitfield-Mask: 0x01)                           */
#define I2Cx_SCR1_TXCFG_Pos               (10UL)                    /*!< TXCFG (Bit 10)                                        */
#define I2Cx_SCR1_TXCFG_Msk               (0x400UL)                 /*!< TXCFG (Bitfield-Mask: 0x01)                           */
#define I2Cx_SCR1_ALERTEN_Pos             (9UL)                     /*!< ALERTEN (Bit 9)                                       */
#define I2Cx_SCR1_ALERTEN_Msk             (0x200UL)                 /*!< ALERTEN (Bitfield-Mask: 0x01)                         */
#define I2Cx_SCR1_GCEN_Pos                (8UL)                     /*!< GCEN (Bit 8)                                          */
#define I2Cx_SCR1_GCEN_Msk                (0x100UL)                 /*!< GCEN (Bitfield-Mask: 0x01)                            */
#define I2Cx_SCR1_ACKSTALL_Pos            (3UL)                     /*!< ACKSTALL (Bit 3)                                      */
#define I2Cx_SCR1_ACKSTALL_Msk            (0x8UL)                   /*!< ACKSTALL (Bitfield-Mask: 0x01)                        */
#define I2Cx_SCR1_TXSTALL_Pos             (2UL)                     /*!< TXSTALL (Bit 2)                                       */
#define I2Cx_SCR1_TXSTALL_Msk             (0x4UL)                   /*!< TXSTALL (Bitfield-Mask: 0x01)                         */
#define I2Cx_SCR1_RXSTALL_Pos             (1UL)                     /*!< RXSTALL (Bit 1)                                       */
#define I2Cx_SCR1_RXSTALL_Msk             (0x2UL)                   /*!< RXSTALL (Bitfield-Mask: 0x01)                         */
#define I2Cx_SCR1_ADRSTALL_Pos            (0UL)                     /*!< ADRSTALL (Bit 0)                                      */
#define I2Cx_SCR1_ADRSTALL_Msk            (0x1UL)                   /*!< ADRSTALL (Bitfield-Mask: 0x01)                        */
/* =========================================================  SCR2  ========================================================== */
#define I2Cx_SCR2_PINCFG_Pos              (24UL)                    /*!< PINCFG (Bit 24)                                       */
