damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
#define I2Cx_SCR2_PINCFG_Msk              (0x7000000UL)             /*!< PINCFG (Bitfield-Mask: 0x07)                          */
/* =========================================================  SCR3  ========================================================== */
#define I2Cx_SCR3_FLTSDA_Pos              (24UL)                    /*!< FLTSDA (Bit 24)                                       */
#define I2Cx_SCR3_FLTSDA_Msk              (0xf000000UL)             /*!< FLTSDA (Bitfield-Mask: 0x0f)                          */
#define I2Cx_SCR3_FLTSCL_Pos              (16UL)                    /*!< FLTSCL (Bit 16)                                       */
#define I2Cx_SCR3_FLTSCL_Msk              (0xf0000UL)               /*!< FLTSCL (Bitfield-Mask: 0x0f)                          */
#define I2Cx_SCR3_DATAVD_Pos              (8UL)                     /*!< DATAVD (Bit 8)                                        */
#define I2Cx_SCR3_DATAVD_Msk              (0x3f00UL)                /*!< DATAVD (Bitfield-Mask: 0x3f)                          */
#define I2Cx_SCR3_CLKHOLD_Pos             (0UL)                     /*!< CLKHOLD (Bit 0)                                       */
#define I2Cx_SCR3_CLKHOLD_Msk             (0xfUL)                   /*!< CLKHOLD (Bitfield-Mask: 0x0f)                         */
/* =========================================================  SAMR  ========================================================== */
#define I2Cx_SAMR_ADDR1_Pos               (17UL)                    /*!< ADDR1 (Bit 17)                                        */
#define I2Cx_SAMR_ADDR1_Msk               (0x7fe0000UL)             /*!< ADDR1 (Bitfield-Mask: 0x3ff)                          */
#define I2Cx_SAMR_ADDR0_Pos               (1UL)                     /*!< ADDR0 (Bit 1)                                         */
#define I2Cx_SAMR_ADDR0_Msk               (0x7feUL)                 /*!< ADDR0 (Bitfield-Mask: 0x3ff)                          */
/* =========================================================  STAR  ========================================================== */
#define I2Cx_STAR_TXNACK_Pos              (0UL)                     /*!< TXNACK (Bit 0)                                        */
#define I2Cx_STAR_TXNACK_Msk              (0x1UL)                   /*!< TXNACK (Bitfield-Mask: 0x01)                          */
/* =========================================================  STDR  ========================================================== */
#define I2Cx_STDR_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define I2Cx_STDR_DATA_Msk                (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =========================================================  SRDR  ========================================================== */
#define I2Cx_SRDR_SOF_Pos                 (15UL)                    /*!< SOF (Bit 15)                                          */
#define I2Cx_SRDR_SOF_Msk                 (0x8000UL)                /*!< SOF (Bitfield-Mask: 0x01)                             */
#define I2Cx_SRDR_RXEMPTY_Pos             (14UL)                    /*!< RXEMPTY (Bit 14)                                      */
#define I2Cx_SRDR_RXEMPTY_Msk             (0x4000UL)                /*!< RXEMPTY (Bitfield-Mask: 0x01)                         */
#define I2Cx_SRDR_DATA_Pos                (0UL)                     /*!< DATA (Bit 0)                                          */
#define I2Cx_SRDR_DATA_Msk                (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =========================================================  SASR  ========================================================== */
#define I2Cx_SASR_ANV_Pos                 (14UL)                    /*!< ANV (Bit 14)                                          */
#define I2Cx_SASR_ANV_Msk                 (0x4000UL)                /*!< ANV (Bitfield-Mask: 0x01)                             */
#define I2Cx_SASR_RADDR_Pos               (0UL)                     /*!< RADDR (Bit 0)                                         */
#define I2Cx_SASR_RADDR_Msk               (0x7ffUL)                 /*!< RADDR (Bitfield-Mask: 0x7ff)                          */
/* =========================================================  SDER  ========================================================== */
#define I2Cx_SDER_ADDR_Pos                (2UL)                     /*!< ADDR (Bit 2)                                          */
#define I2Cx_SDER_ADDR_Msk                (0x4UL)                   /*!< ADDR (Bitfield-Mask: 0x01)                            */
#define I2Cx_SDER_RXNE_Pos                (1UL)                     /*!< RXNE (Bit 1)                                          */
#define I2Cx_SDER_RXNE_Msk                (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define I2Cx_SDER_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define I2Cx_SDER_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* =========================================================  SIER  ========================================================== */
#define I2Cx_SIER_ALERT_Pos               (15UL)                    /*!< ALERT (Bit 15)                                        */
#define I2Cx_SIER_ALERT_Msk               (0x8000UL)                /*!< ALERT (Bitfield-Mask: 0x01)                           */
#define I2Cx_SIER_GC_Pos                  (14UL)                    /*!< GC (Bit 14)                                           */
#define I2Cx_SIER_GC_Msk                  (0x4000UL)                /*!< GC (Bitfield-Mask: 0x01)                              */
#define I2Cx_SIER_AM1_Pos                 (13UL)                    /*!< AM1 (Bit 13)                                          */
#define I2Cx_SIER_AM1_Msk                 (0x2000UL)                /*!< AM1 (Bitfield-Mask: 0x01)                             */
#define I2Cx_SIER_AM0_Pos                 (12UL)                    /*!< AM0 (Bit 12)                                          */
#define I2Cx_SIER_AM0_Msk                 (0x1000UL)                /*!< AM0 (Bitfield-Mask: 0x01)                             */
#define I2Cx_SIER_FIFO_Pos                (11UL)                    /*!< FIFO (Bit 11)                                         */
#define I2Cx_SIER_FIFO_Msk                (0x800UL)                 /*!< FIFO (Bitfield-Mask: 0x01)                            */
#define I2Cx_SIER_BIT_Pos                 (10UL)                    /*!< BIT (Bit 10)                                          */
#define I2Cx_SIER_BIT_Msk                 (0x400UL)                 /*!< BIT (Bitfield-Mask: 0x01)                             */
#define I2Cx_SIER_STOP_Pos                (9UL)                     /*!< STOP (Bit 9)                                          */
#define I2Cx_SIER_STOP_Msk                (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define I2Cx_SIER_RESTART_Pos             (8UL)                     /*!< RESTART (Bit 8)                                       */
#define I2Cx_SIER_RESTART_Msk             (0x100UL)                 /*!< RESTART (Bitfield-Mask: 0x01)                         */
#define I2Cx_SIER_TACK_Pos                (3UL)                     /*!< TACK (Bit 3)                                          */
#define I2Cx_SIER_TACK_Msk                (0x8UL)                   /*!< TACK (Bitfield-Mask: 0x01)                            */
#define I2Cx_SIER_ADDR_Pos                (2UL)                     /*!< ADDR (Bit 2)                                          */
#define I2Cx_SIER_ADDR_Msk                (0x4UL)                   /*!< ADDR (Bitfield-Mask: 0x01)                            */
#define I2Cx_SIER_RXNE_Pos                (1UL)                     /*!< RXNE (Bit 1)                                          */
#define I2Cx_SIER_RXNE_Msk                (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define I2Cx_SIER_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define I2Cx_SIER_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* =========================================================  SISR  ========================================================== */
#define I2Cx_SISR_BUSBUSY_Pos             (25UL)                    /*!< BUSBUSY (Bit 25)                                      */
#define I2Cx_SISR_BUSBUSY_Msk             (0x2000000UL)             /*!< BUSBUSY (Bitfield-Mask: 0x01)                         */
#define I2Cx_SISR_SLVBUSY_Pos             (24UL)                    /*!< SLVBUSY (Bit 24)                                      */
#define I2Cx_SISR_SLVBUSY_Msk             (0x1000000UL)             /*!< SLVBUSY (Bitfield-Mask: 0x01)                         */
#define I2Cx_SISR_ALERT_Pos               (15UL)                    /*!< ALERT (Bit 15)                                        */
#define I2Cx_SISR_ALERT_Msk               (0x8000UL)                /*!< ALERT (Bitfield-Mask: 0x01)                           */
#define I2Cx_SISR_GC_Pos                  (14UL)                    /*!< GC (Bit 14)                                           */
#define I2Cx_SISR_GC_Msk                  (0x4000UL)                /*!< GC (Bitfield-Mask: 0x01)                              */
#define I2Cx_SISR_AM1_Pos                 (13UL)                    /*!< AM1 (Bit 13)                                          */
#define I2Cx_SISR_AM1_Msk                 (0x2000UL)                /*!< AM1 (Bitfield-Mask: 0x01)                             */
#define I2Cx_SISR_AM0_Pos                 (12UL)                    /*!< AM0 (Bit 12)                                          */
#define I2Cx_SISR_AM0_Msk                 (0x1000UL)                /*!< AM0 (Bitfield-Mask: 0x01)                             */
#define I2Cx_SISR_FIFO_Pos                (11UL)                    /*!< FIFO (Bit 11)                                         */
#define I2Cx_SISR_FIFO_Msk                (0x800UL)                 /*!< FIFO (Bitfield-Mask: 0x01)                            */
#define I2Cx_SISR_BIT_Pos                 (10UL)                    /*!< BIT (Bit 10)                                          */
#define I2Cx_SISR_BIT_Msk                 (0x400UL)                 /*!< BIT (Bitfield-Mask: 0x01)                             */
#define I2Cx_SISR_STOP_Pos                (9UL)                     /*!< STOP (Bit 9)                                          */
#define I2Cx_SISR_STOP_Msk                (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define I2Cx_SISR_RESTART_Pos             (8UL)                     /*!< RESTART (Bit 8)                                       */
#define I2Cx_SISR_RESTART_Msk             (0x100UL)                 /*!< RESTART (Bitfield-Mask: 0x01)                         */
#define I2Cx_SISR_TACK_Pos                (3UL)                     /*!< TACK (Bit 3)                                          */
#define I2Cx_SISR_TACK_Msk                (0x8UL)                   /*!< TACK (Bitfield-Mask: 0x01)                            */
#define I2Cx_SISR_ADDR_Pos                (2UL)                     /*!< ADDR (Bit 2)                                          */
#define I2Cx_SISR_ADDR_Msk                (0x4UL)                   /*!< ADDR (Bitfield-Mask: 0x01)                            */
#define I2Cx_SISR_RXNE_Pos                (1UL)                     /*!< RXNE (Bit 1)                                          */
#define I2Cx_SISR_RXNE_Msk                (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define I2Cx_SISR_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define I2Cx_SISR_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* =========================================================  SICR  ========================================================== */
#define I2Cx_SICR_FIFO_Pos                (11UL)                    /*!< FIFO (Bit 11)                                         */
#define I2Cx_SICR_FIFO_Msk                (0x800UL)                 /*!< FIFO (Bitfield-Mask: 0x01)                            */
#define I2Cx_SICR_BIT_Pos                 (10UL)                    /*!< BIT (Bit 10)                                          */
#define I2Cx_SICR_BIT_Msk                 (0x400UL)                 /*!< BIT (Bitfield-Mask: 0x01)                             */
#define I2Cx_SICR_STOP_Pos                (9UL)                     /*!< STOP (Bit 9)                                          */
#define I2Cx_SICR_STOP_Msk                (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define I2Cx_SICR_RESTART_Pos             (8UL)                     /*!< RESTART (Bit 8)                                       */
#define I2Cx_SICR_RESTART_Msk             (0x100UL)                 /*!< RESTART (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                           IRMOD                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define IRMOD_CR_INV_Pos                  (5UL)                     /*!< INV (Bit 5)                                           */
#define IRMOD_CR_INV_Msk                  (0x20UL)                  /*!< INV (Bitfield-Mask: 0x01)                             */
#define IRMOD_CR_IRSW_Pos                 (4UL)                     /*!< IRSW (Bit 4)                                          */
#define IRMOD_CR_IRSW_Msk                 (0x10UL)                  /*!< IRSW (Bitfield-Mask: 0x01)                            */
#define IRMOD_CR_MOD_Pos                  (0UL)                     /*!< MOD (Bit 0)                                           */
#define IRMOD_CR_MOD_Msk                  (0xfUL)                   /*!< MOD (Bitfield-Mask: 0x0f)                             */


/* =========================================================================================================================== */
/* ================                                           IWDT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  KR  =========================================================== */
#define IWDT_KR_KR_Pos                    (0UL)                     /*!< KR (Bit 0)                                            */
#define IWDT_KR_KR_Msk                    (0xffffUL)                /*!< KR (Bitfield-Mask: 0xffff)                            */
/* ==========================================================  CR  =========================================================== */
#define IWDT_CR_PAUSE_Pos                 (5UL)                     /*!< PAUSE (Bit 5)                                         */
#define IWDT_CR_PAUSE_Msk                 (0x20UL)                  /*!< PAUSE (Bitfield-Mask: 0x01)                           */
#define IWDT_CR_IE_Pos                    (4UL)                     /*!< IE (Bit 4)                                            */
#define IWDT_CR_IE_Msk                    (0x10UL)                  /*!< IE (Bitfield-Mask: 0x01)                              */
#define IWDT_CR_ACTION_Pos                (3UL)                     /*!< ACTION (Bit 3)                                        */
#define IWDT_CR_ACTION_Msk                (0x8UL)                   /*!< ACTION (Bitfield-Mask: 0x01)                          */
#define IWDT_CR_PRS_Pos                   (0UL)                     /*!< PRS (Bit 0)                                           */
#define IWDT_CR_PRS_Msk                   (0x7UL)                   /*!< PRS (Bitfield-Mask: 0x07)                             */
/* ==========================================================  ARR  ========================================================== */
#define IWDT_ARR_ARR_Pos                  (0UL)                     /*!< ARR (Bit 0)                                           */
#define IWDT_ARR_ARR_Msk                  (0xfffUL)                 /*!< ARR (Bitfield-Mask: 0xfff)                            */
/* ==========================================================  CNT  ========================================================== */
#define IWDT_CNT_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define IWDT_CNT_CNT_Msk                  (0xfffUL)                 /*!< CNT (Bitfield-Mask: 0xfff)                            */
/* =========================================================  WINR  ========================================================== */
#define IWDT_WINR_WINR_Pos                (0UL)                     /*!< WINR (Bit 0)                                          */
#define IWDT_WINR_WINR_Msk                (0xfffUL)                 /*!< WINR (Bitfield-Mask: 0xfff)                           */
/* ==========================================================  SR  =========================================================== */
#define IWDT_SR_RELOAD_Pos                (5UL)                     /*!< RELOAD (Bit 5)                                        */
#define IWDT_SR_RELOAD_Msk                (0x20UL)                  /*!< RELOAD (Bitfield-Mask: 0x01)                          */
#define IWDT_SR_RUN_Pos                   (4UL)                     /*!< RUN (Bit 4)                                           */
#define IWDT_SR_RUN_Msk                   (0x10UL)                  /*!< RUN (Bitfield-Mask: 0x01)                             */
#define IWDT_SR_OV_Pos                    (3UL)                     /*!< OV (Bit 3)                                            */
#define IWDT_SR_OV_Msk                    (0x8UL)                   /*!< OV (Bitfield-Mask: 0x01)                              */
#define IWDT_SR_WINRF_Pos                 (2UL)                     /*!< WINRF (Bit 2)                                         */
#define IWDT_SR_WINRF_Msk                 (0x4UL)                   /*!< WINRF (Bitfield-Mask: 0x01)                           */
#define IWDT_SR_ARRF_Pos                  (1UL)                     /*!< ARRF (Bit 1)                                          */
#define IWDT_SR_ARRF_Msk                  (0x2UL)                   /*!< ARRF (Bitfield-Mask: 0x01)                            */
#define IWDT_SR_CRF_Pos                   (0UL)                     /*!< CRF (Bit 0)                                           */
#define IWDT_SR_CRF_Msk                   (0x1UL)                   /*!< CRF (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                           LPTIM                                           ================ */
/* =========================================================================================================================== */

