damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* ==========================================================  CR1  ========================================================== */
#define UARTx_CR1_SYNC_Pos                (14UL)                    /*!< SYNC (Bit 14)                                         */
#define UARTx_CR1_SYNC_Msk                (0x4000UL)                /*!< SYNC (Bitfield-Mask: 0x01)                            */
#define UARTx_CR1_SOURCE_Pos              (12UL)                    /*!< SOURCE (Bit 12)                                       */
#define UARTx_CR1_SOURCE_Msk              (0x3000UL)                /*!< SOURCE (Bitfield-Mask: 0x03)                          */
#define UARTx_CR1_SIGNAL_Pos              (11UL)                    /*!< SIGNAL (Bit 11)                                       */
#define UARTx_CR1_SIGNAL_Msk              (0x800UL)                 /*!< SIGNAL (Bitfield-Mask: 0x01)                          */
#define UARTx_CR1_OVER_Pos                (9UL)                     /*!< OVER (Bit 9)                                          */
#define UARTx_CR1_OVER_Msk                (0x600UL)                 /*!< OVER (Bitfield-Mask: 0x03)                            */
#define UARTx_CR1_START_Pos               (8UL)                     /*!< START (Bit 8)                                         */
#define UARTx_CR1_START_Msk               (0x100UL)                 /*!< START (Bitfield-Mask: 0x01)                           */
#define UARTx_CR1_MSBF_Pos                (7UL)                     /*!< MSBF (Bit 7)                                          */
#define UARTx_CR1_MSBF_Msk                (0x80UL)                  /*!< MSBF (Bitfield-Mask: 0x01)                            */
#define UARTx_CR1_CHLEN_Pos               (6UL)                     /*!< CHLEN (Bit 6)                                         */
#define UARTx_CR1_CHLEN_Msk               (0x40UL)                  /*!< CHLEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR1_STOP_Pos                (4UL)                     /*!< STOP (Bit 4)                                          */
#define UARTx_CR1_STOP_Msk                (0x30UL)                  /*!< STOP (Bitfield-Mask: 0x03)                            */
#define UARTx_CR1_PARITYEN_Pos            (3UL)                     /*!< PARITYEN (Bit 3)                                      */
#define UARTx_CR1_PARITYEN_Msk            (0x8UL)                   /*!< PARITYEN (Bitfield-Mask: 0x01)                        */
#define UARTx_CR1_PARITY_Pos              (2UL)                     /*!< PARITY (Bit 2)                                        */
#define UARTx_CR1_PARITY_Msk              (0x4UL)                   /*!< PARITY (Bitfield-Mask: 0x01)                          */
#define UARTx_CR1_RXEN_Pos                (1UL)                     /*!< RXEN (Bit 1)                                          */
#define UARTx_CR1_RXEN_Msk                (0x2UL)                   /*!< RXEN (Bitfield-Mask: 0x01)                            */
#define UARTx_CR1_TXEN_Pos                (0UL)                     /*!< TXEN (Bit 0)                                          */
#define UARTx_CR1_TXEN_Msk                (0x1UL)                   /*!< TXEN (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CR2  ========================================================== */
#define UARTx_CR2_RXSRC_Pos               (15UL)                    /*!< RXSRC (Bit 15)                                        */
#define UARTx_CR2_RXSRC_Msk               (0x38000UL)               /*!< RXSRC (Bitfield-Mask: 0x07)                           */
#define UARTx_CR2_LOOP_Pos                (14UL)                    /*!< LOOP (Bit 14)                                         */
#define UARTx_CR2_LOOP_Msk                (0x4000UL)                /*!< LOOP (Bitfield-Mask: 0x01)                            */
#define UARTx_CR2_ADCTX_Pos               (13UL)                    /*!< ADCTX (Bit 13)                                        */
#define UARTx_CR2_ADCTX_Msk               (0x2000UL)                /*!< ADCTX (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_ADCRX_Pos               (12UL)                    /*!< ADCRX (Bit 12)                                        */
#define UARTx_CR2_ADCRX_Msk               (0x1000UL)                /*!< ADCRX (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_SWAP_Pos                (11UL)                    /*!< SWAP (Bit 11)                                         */
#define UARTx_CR2_SWAP_Msk                (0x800UL)                 /*!< SWAP (Bitfield-Mask: 0x01)                            */
#define UARTx_CR2_TIMCR_Pos               (8UL)                     /*!< TIMCR (Bit 8)                                         */
#define UARTx_CR2_TIMCR_Msk               (0x700UL)                 /*!< TIMCR (Bitfield-Mask: 0x07)                           */
#define UARTx_CR2_DMATX_Pos               (7UL)                     /*!< DMATX (Bit 7)                                         */
#define UARTx_CR2_DMATX_Msk               (0x80UL)                  /*!< DMATX (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_DMARX_Pos               (6UL)                     /*!< DMARX (Bit 6)                                         */
#define UARTx_CR2_DMARX_Msk               (0x40UL)                  /*!< DMARX (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_TXINV_Pos               (5UL)                     /*!< TXINV (Bit 5)                                         */
#define UARTx_CR2_TXINV_Msk               (0x20UL)                  /*!< TXINV (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_RXINV_Pos               (4UL)                     /*!< RXINV (Bit 4)                                         */
#define UARTx_CR2_RXINV_Msk               (0x10UL)                  /*!< RXINV (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_RTSEN_Pos               (3UL)                     /*!< RTSEN (Bit 3)                                         */
#define UARTx_CR2_RTSEN_Msk               (0x8UL)                   /*!< RTSEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_CTSEN_Pos               (2UL)                     /*!< CTSEN (Bit 2)                                         */
#define UARTx_CR2_CTSEN_Msk               (0x4UL)                   /*!< CTSEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_RXMATCHEN_Pos           (1UL)                     /*!< RXMATCHEN (Bit 1)                                     */
#define UARTx_CR2_RXMATCHEN_Msk           (0x2UL)                   /*!< RXMATCHEN (Bitfield-Mask: 0x01)                       */
#define UARTx_CR2_ADDREN_Pos              (0UL)                     /*!< ADDREN (Bit 0)                                        */
#define UARTx_CR2_ADDREN_Msk              (0x1UL)                   /*!< ADDREN (Bitfield-Mask: 0x01)                          */
/* ==========================================================  CR3  ========================================================== */
#define UARTx_CR3_BRKL_Pos                (8UL)                     /*!< BRKL (Bit 8)                                          */
#define UARTx_CR3_BRKL_Msk                (0x100UL)                 /*!< BRKL (Bitfield-Mask: 0x01)                            */
#define UARTx_CR3_LIN_Pos                 (7UL)                     /*!< LIN (Bit 7)                                           */
#define UARTx_CR3_LIN_Msk                 (0x80UL)                  /*!< LIN (Bitfield-Mask: 0x01)                             */
#define UARTx_CR3_DETIME_Pos              (2UL)                     /*!< DETIME (Bit 2)                                        */
#define UARTx_CR3_DETIME_Msk              (0x7cUL)                  /*!< DETIME (Bitfield-Mask: 0x1f)                          */
#define UARTx_CR3_DEP_Pos                  (1UL)                     /*!< DEP (Bit 1)                                           */
#define UARTx_CR3_DEP_Msk                  (0x2UL)                   /*!< DEP (Bitfield-Mask: 0x01)                             */
#define UARTx_CR3_DEM_Pos                 (0UL)                     /*!< DEM (Bit 0)                                           */
#define UARTx_CR3_DEM_Msk                 (0x1UL)                   /*!< DEM (Bitfield-Mask: 0x01)                             */
/* =========================================================  BRRI  ========================================================== */
#define UARTx_BRRI_BRRI_Pos               (0UL)                     /*!< BRRI (Bit 0)                                          */
#define UARTx_BRRI_BRRI_Msk               (0xffffUL)                /*!< BRRI (Bitfield-Mask: 0xffff)                          */
/* =========================================================  BRRF  ========================================================== */
#define UARTx_BRRF_BRRF_Pos               (0UL)                     /*!< BRRF (Bit 0)                                          */
#define UARTx_BRRF_BRRF_Msk               (0xfUL)                   /*!< BRRF (Bitfield-Mask: 0x0f)                            */
/* ========================================================  TIMARR  ========================================================= */
#define UARTx_TIMARR_TIMARR_Pos           (0UL)                     /*!< TIMARR (Bit 0)                                        */
#define UARTx_TIMARR_TIMARR_Msk           (0xffffffUL)              /*!< TIMARR (Bitfield-Mask: 0xffffff)                      */
/* ========================================================  TIMCNT  ========================================================= */
#define UARTx_TIMCNT_TIMCNT_Pos           (0UL)                     /*!< TIMCNT (Bit 0)                                        */
#define UARTx_TIMCNT_TIMCNT_Msk           (0xffffffUL)              /*!< TIMCNT (Bitfield-Mask: 0xffffff)                      */
/* ==========================================================  TDR  ========================================================== */
#define UARTx_TDR_BREAK_Pos               (10UL)                    /*!< BREAK (Bit 10)                                        */
#define UARTx_TDR_BREAK_Msk               (0x400UL)                 /*!< BREAK (Bitfield-Mask: 0x01)                           */
#define UARTx_TDR_IDLE_Pos                (9UL)                     /*!< IDLE (Bit 9)                                          */
#define UARTx_TDR_IDLE_Msk                (0x200UL)                 /*!< IDLE (Bitfield-Mask: 0x01)                            */
#define UARTx_TDR_TDR_Pos                 (0UL)                     /*!< TDR (Bit 0)                                           */
#define UARTx_TDR_TDR_Msk                 (0x1ffUL)                 /*!< TDR (Bitfield-Mask: 0x1ff)                            */
/* ==========================================================  RDR  ========================================================== */
#define UARTx_RDR_RDR_Pos                 (0UL)                     /*!< RDR (Bit 0)                                           */
#define UARTx_RDR_RDR_Msk                 (0x1ffUL)                 /*!< RDR (Bitfield-Mask: 0x1ff)                            */
/* ==========================================================  IER  ========================================================== */
#define UARTx_IER_RXMATCH_Pos             (12UL)                    /*!< RXMATCH (Bit 12)                                      */
#define UARTx_IER_RXMATCH_Msk             (0x1000UL)                /*!< RXMATCH (Bitfield-Mask: 0x01)                         */
#define UARTx_IER_ORE_Pos                 (11UL)                    /*!< ORE (Bit 11)                                          */
#define UARTx_IER_ORE_Msk                 (0x800UL)                 /*!< ORE (Bitfield-Mask: 0x01)                             */
#define UARTx_IER_NE_Pos                  (10UL)                    /*!< NE (Bit 10)                                           */
#define UARTx_IER_NE_Msk                  (0x400UL)                 /*!< NE (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_PE_Pos                  (9UL)                     /*!< PE (Bit 9)                                            */
#define UARTx_IER_PE_Msk                  (0x200UL)                 /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_FE_Pos                  (8UL)                     /*!< FE (Bit 8)                                            */
#define UARTx_IER_FE_Msk                  (0x100UL)                 /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_CTS_Pos                 (7UL)                     /*!< CTS (Bit 7)                                           */
#define UARTx_IER_CTS_Msk                 (0x80UL)                  /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_IER_TIMOV_Pos               (6UL)                     /*!< TIMOV (Bit 6)                                         */
#define UARTx_IER_TIMOV_Msk               (0x40UL)                  /*!< TIMOV (Bitfield-Mask: 0x01)                           */
#define UARTx_IER_BAUD_Pos                (5UL)                     /*!< BAUD (Bit 5)                                          */
#define UARTx_IER_BAUD_Msk                (0x20UL)                  /*!< BAUD (Bitfield-Mask: 0x01)                            */
#define UARTx_IER_RXBRK_Pos               (4UL)                     /*!< RXBRK (Bit 4)                                         */
#define UARTx_IER_RXBRK_Msk               (0x10UL)                  /*!< RXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_IER_RXIDLE_Pos              (3UL)                     /*!< RXIDLE (Bit 3)                                        */
#define UARTx_IER_RXIDLE_Msk              (0x8UL)                   /*!< RXIDLE (Bitfield-Mask: 0x01)                          */
#define UARTx_IER_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                            */
#define UARTx_IER_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                            */
#define UARTx_IER_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define UARTx_IER_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define UARTx_ISR_CTSLV_Pos               (15UL)                    /*!< CTSLV (Bit 15)                                        */
#define UARTx_ISR_CTSLV_Msk               (0x8000UL)                /*!< CTSLV (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_TXBUSY_Pos              (14UL)                    /*!< TXBUSY (Bit 14)                                       */
#define UARTx_ISR_TXBUSY_Msk              (0x4000UL)                /*!< TXBUSY (Bitfield-Mask: 0x01)                          */
#define UARTx_ISR_SLVMATCH_Pos            (13UL)                    /*!< SLVMATCH (Bit 13)                                     */
#define UARTx_ISR_SLVMATCH_Msk            (0x2000UL)                /*!< SLVMATCH (Bitfield-Mask: 0x01)                        */
#define UARTx_ISR_RXMATCH_Pos             (12UL)                    /*!< RXMATCH (Bit 12)                                      */
#define UARTx_ISR_RXMATCH_Msk             (0x1000UL)                /*!< RXMATCH (Bitfield-Mask: 0x01)                         */
#define UARTx_ISR_ORE_Pos                 (11UL)                    /*!< ORE (Bit 11)                                          */
#define UARTx_ISR_ORE_Msk                 (0x800UL)                 /*!< ORE (Bitfield-Mask: 0x01)                             */
#define UARTx_ISR_NE_Pos                  (10UL)                    /*!< NE (Bit 10)                                           */
#define UARTx_ISR_NE_Msk                  (0x400UL)                 /*!< NE (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_PE_Pos                  (9UL)                     /*!< PE (Bit 9)                                            */
#define UARTx_ISR_PE_Msk                  (0x200UL)                 /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_FE_Pos                  (8UL)                     /*!< FE (Bit 8)                                            */
#define UARTx_ISR_FE_Msk                  (0x100UL)                 /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_CTS_Pos                 (7UL)                     /*!< CTS (Bit 7)                                           */
#define UARTx_ISR_CTS_Msk                 (0x80UL)                  /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_ISR_TIMOV_Pos               (6UL)                     /*!< TIMOV (Bit 6)                                         */
#define UARTx_ISR_TIMOV_Msk               (0x40UL)                  /*!< TIMOV (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_BAUD_Pos                (5UL)                     /*!< BAUD (Bit 5)                                          */
#define UARTx_ISR_BAUD_Msk                (0x20UL)                  /*!< BAUD (Bitfield-Mask: 0x01)                            */
#define UARTx_ISR_RXBRK_Pos               (4UL)                     /*!< RXBRK (Bit 4)                                         */
#define UARTx_ISR_RXBRK_Msk               (0x10UL)                  /*!< RXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_RXIDLE_Pos              (3UL)                     /*!< RXIDLE (Bit 3)                                        */
#define UARTx_ISR_RXIDLE_Msk              (0x8UL)                   /*!< RXIDLE (Bitfield-Mask: 0x01)                          */
#define UARTx_ISR_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                            */
#define UARTx_ISR_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                            */
#define UARTx_ISR_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define UARTx_ISR_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define UARTx_ICR_RXMATCH_Pos             (12UL)                    /*!< RXMATCH (Bit 12)                                      */
#define UARTx_ICR_RXMATCH_Msk             (0x1000UL)                /*!< RXMATCH (Bitfield-Mask: 0x01)                         */
#define UARTx_ICR_ORE_Pos                 (11UL)                    /*!< ORE (Bit 11)                                          */
#define UARTx_ICR_ORE_Msk                 (0x800UL)                 /*!< ORE (Bitfield-Mask: 0x01)                             */
#define UARTx_ICR_NE_Pos                  (10UL)                    /*!< NE (Bit 10)                                           */
#define UARTx_ICR_NE_Msk                  (0x400UL)                 /*!< NE (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_PE_Pos                  (9UL)                     /*!< PE (Bit 9)                                            */
#define UARTx_ICR_PE_Msk                  (0x200UL)                 /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_FE_Pos                  (8UL)                     /*!< FE (Bit 8)                                            */
#define UARTx_ICR_FE_Msk                  (0x100UL)                 /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_CTS_Pos                 (7UL)                     /*!< CTS (Bit 7)                                           */
#define UARTx_ICR_CTS_Msk                 (0x80UL)                  /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_ICR_TIMOV_Pos               (6UL)                     /*!< TIMOV (Bit 6)                                         */
#define UARTx_ICR_TIMOV_Msk               (0x40UL)                  /*!< TIMOV (Bitfield-Mask: 0x01)                           */
#define UARTx_ICR_BAUD_Pos                (5UL)                     /*!< BAUD (Bit 5)                                          */
#define UARTx_ICR_BAUD_Msk                (0x20UL)                  /*!< BAUD (Bitfield-Mask: 0x01)                            */
#define UARTx_ICR_RXBRK_Pos               (4UL)                     /*!< RXBRK (Bit 4)                                         */
#define UARTx_ICR_RXBRK_Msk               (0x10UL)                  /*!< RXBRK (Bitfield-Mask: 0x01)                           */
#define UARTx_ICR_RXIDLE_Pos              (3UL)                     /*!< RXIDLE (Bit 3)                                        */
#define UARTx_ICR_RXIDLE_Msk              (0x8UL)                   /*!< RXIDLE (Bitfield-Mask: 0x01)                          */
#define UARTx_ICR_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                            */
#define UARTx_ICR_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                            */
#define UARTx_ICR_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                              */
/* =========================================================  ADDR  ========================================================== */
#define UARTx_ADDR_ADDR_Pos               (0UL)                     /*!< ADDR (Bit 0)                                          */
#define UARTx_ADDR_ADDR_Msk               (0xffUL)                  /*!< ADDR (Bitfield-Mask: 0xff)                            */
/* =========================================================  MASK  ========================================================== */
#define UARTx_MASK_MASK_Pos               (0UL)                     /*!< MASK (Bit 0)                                          */
#define UARTx_MASK_MASK_Msk               (0xffUL)                  /*!< MASK (Bitfield-Mask: 0xff)                            */
/* ========================================================  RXMATCH  ======================================================== */
#define UARTx_RXMATCH_RXMATCH_Pos         (0UL)                     /*!< RXMATCH (Bit 0)                                       */
#define UARTx_RXMATCH_RXMATCH_Msk         (0x1ffUL)                 /*!< RXMATCH (Bitfield-Mask: 0x1ff)                        */


/* =========================================================================================================================== */
/* ================                                            LVD                                            ================ */
/* =========================================================================================================================== */

