damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* ==========================================================  CR0  ========================================================== */
#define LVD_CR0_FLTCLK_Pos                (8UL)                     /*!< FLTCLK (Bit 8)                                        */
#define LVD_CR0_FLTCLK_Msk                (0x100UL)                 /*!< FLTCLK (Bitfield-Mask: 0x01)                          */
#define LVD_CR0_VTH_Pos                   (4UL)                     /*!< VTH (Bit 4)                                           */
#define LVD_CR0_VTH_Msk                   (0x70UL)                  /*!< VTH (Bitfield-Mask: 0x07)                             */
#define LVD_CR0_SOURCE_Pos                (2UL)                     /*!< SOURCE (Bit 2)                                        */
#define LVD_CR0_SOURCE_Msk                (0x4UL)                   /*!< SOURCE (Bitfield-Mask: 0x01)                          */
#define LVD_CR0_ACTION_Pos                (1UL)                     /*!< ACTION (Bit 1)                                        */
#define LVD_CR0_ACTION_Msk                (0x2UL)                   /*!< ACTION (Bitfield-Mask: 0x01)                          */
#define LVD_CR0_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define LVD_CR0_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR1  ========================================================== */
#define LVD_CR1_FLTTIME_Pos               (4UL)                     /*!< FLTTIME (Bit 4)                                       */
#define LVD_CR1_FLTTIME_Msk               (0xf0UL)                  /*!< FLTTIME (Bitfield-Mask: 0x0f)                         */
#define LVD_CR1_FALL_Pos                  (3UL)                     /*!< FALL (Bit 3)                                          */
#define LVD_CR1_FALL_Msk                  (0x8UL)                   /*!< FALL (Bitfield-Mask: 0x01)                            */
#define LVD_CR1_RISE_Pos                  (2UL)                     /*!< RISE (Bit 2)                                          */
#define LVD_CR1_RISE_Msk                  (0x4UL)                   /*!< RISE (Bitfield-Mask: 0x01)                            */
#define LVD_CR1_LEVEL_Pos                 (1UL)                     /*!< LEVEL (Bit 1)                                         */
#define LVD_CR1_LEVEL_Msk                 (0x2UL)                   /*!< LEVEL (Bitfield-Mask: 0x01)                           */
#define LVD_CR1_IE_Pos                    (0UL)                     /*!< IE (Bit 0)                                            */
#define LVD_CR1_IE_Msk                    (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ==========================================================  SR  =========================================================== */
#define LVD_SR_FLTV_Pos                   (1UL)                     /*!< FLTV (Bit 1)                                          */
#define LVD_SR_FLTV_Msk                   (0x2UL)                   /*!< FLTV (Bitfield-Mask: 0x01)                            */
#define LVD_SR_INTF_Pos                   (0UL)                     /*!< INTF (Bit 0)                                          */
#define LVD_SR_INTF_Msk                   (0x1UL)                   /*!< INTF (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                            OPA                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define OPAx_CR_BIAS_Pos                   (13UL)                    /*!< BIAS (Bit 13)                                         */
#define OPAx_CR_BIAS_Msk                   (0xe000UL)                /*!< BIAS (Bitfield-Mask: 0x07)                            */
#define OPAx_CR_AMP_Pos                    (10UL)                    /*!< AMP (Bit 10)                                          */
#define OPAx_CR_AMP_Msk                    (0x1c00UL)                /*!< AMP (Bitfield-Mask: 0x07)                             */
#define OPAx_CR_INN2EN_Pos                 (9UL)                     /*!< INN2EN (Bit 9)                                        */
#define OPAx_CR_INN2EN_Msk                 (0x200UL)                 /*!< INN2EN (Bitfield-Mask: 0x01)                          */
#define OPAx_CR_INN1EN_Pos                 (8UL)                     /*!< INN1EN (Bit 8)                                        */
#define OPAx_CR_INN1EN_Msk                 (0x100UL)                 /*!< INN1EN (Bitfield-Mask: 0x01)                          */
#define OPAx_CR_INP4EN_Pos                 (7UL)                     /*!< INP4EN (Bit 7)                                        */
#define OPAx_CR_INP4EN_Msk                 (0x80UL)                  /*!< INP4EN (Bitfield-Mask: 0x01)                          */
#define OPAx_CR_INP3EN_Pos                 (6UL)                     /*!< INP3EN (Bit 6)                                        */
#define OPAx_CR_INP3EN_Msk                 (0x40UL)                  /*!< INP3EN (Bitfield-Mask: 0x01)                          */
#define OPAx_CR_INP2EN_Pos                 (5UL)                     /*!< INP2EN (Bit 5)                                        */
#define OPAx_CR_INP2EN_Msk                 (0x20UL)                  /*!< INP2EN (Bitfield-Mask: 0x01)                          */
#define OPAx_CR_INP1EN_Pos                 (4UL)                     /*!< INP1EN (Bit 4)                                        */
#define OPAx_CR_INP1EN_Msk                 (0x10UL)                  /*!< INP1EN (Bitfield-Mask: 0x01)                          */
#define OPAx_CR_MODE_Pos                   (1UL)                     /*!< MODE (Bit 1)                                          */
#define OPAx_CR_MODE_Msk                   (0x6UL)                   /*!< MODE (Bitfield-Mask: 0x03)                            */
#define OPAx_CR_EN_Pos                     (0UL)                     /*!< EN (Bit 0)                                            */
#define OPAx_CR_EN_Msk                     (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CAL  ========================================================== */
#define OPAx_CAL_GTIM4OC2_Pos              (31UL)                    /*!< GTIM4OC2 (Bit 31)                                     */
#define OPAx_CAL_GTIM4OC2_Msk              (0x80000000UL)            /*!< GTIM4OC2 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_GTIM4OC1_Pos              (30UL)                    /*!< GTIM4OC1 (Bit 30)                                     */
#define OPAx_CAL_GTIM4OC1_Msk              (0x40000000UL)            /*!< GTIM4OC1 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_GTIM4TRGO_Pos             (29UL)                    /*!< GTIM4TRGO (Bit 29)                                    */
#define OPAx_CAL_GTIM4TRGO_Msk             (0x20000000UL)            /*!< GTIM4TRGO (Bitfield-Mask: 0x01)                       */
#define OPAx_CAL_GTIM3OC2_Pos              (28UL)                    /*!< GTIM3OC2 (Bit 28)                                     */
#define OPAx_CAL_GTIM3OC2_Msk              (0x10000000UL)            /*!< GTIM3OC2 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_GTIM3OC1_Pos              (27UL)                    /*!< GTIM3OC1 (Bit 27)                                     */
#define OPAx_CAL_GTIM3OC1_Msk              (0x8000000UL)             /*!< GTIM3OC1 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_GTIM3TRGO_Pos             (26UL)                    /*!< GTIM3TRGO (Bit 26)                                    */
#define OPAx_CAL_GTIM3TRGO_Msk             (0x4000000UL)             /*!< GTIM3TRGO (Bitfield-Mask: 0x01)                       */
#define OPAx_CAL_GTIM2OC2_Pos              (25UL)                    /*!< GTIM2OC2 (Bit 25)                                     */
#define OPAx_CAL_GTIM2OC2_Msk              (0x2000000UL)             /*!< GTIM2OC2 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_GTIM2OC1_Pos              (24UL)                    /*!< GTIM2OC1 (Bit 24)                                     */
#define OPAx_CAL_GTIM2OC1_Msk              (0x1000000UL)             /*!< GTIM2OC1 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_GTIM2TRGO_Pos             (23UL)                    /*!< GTIM2TRGO (Bit 23)                                    */
#define OPAx_CAL_GTIM2TRGO_Msk             (0x800000UL)              /*!< GTIM2TRGO (Bitfield-Mask: 0x01)                       */
#define OPAx_CAL_GTIM1OC2_Pos              (22UL)                    /*!< GTIM1OC2 (Bit 22)                                     */
#define OPAx_CAL_GTIM1OC2_Msk              (0x400000UL)              /*!< GTIM1OC2 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_GTIM1OC1_Pos              (21UL)                    /*!< GTIM1OC1 (Bit 21)                                     */
#define OPAx_CAL_GTIM1OC1_Msk              (0x200000UL)              /*!< GTIM1OC1 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_GTIM1TRGO_Pos             (20UL)                    /*!< GTIM1TRGO (Bit 20)                                    */
#define OPAx_CAL_GTIM1TRGO_Msk             (0x100000UL)              /*!< GTIM1TRGO (Bitfield-Mask: 0x01)                       */
#define OPAx_CAL_ATIM1OC6_Pos              (19UL)                    /*!< ATIM1OC6 (Bit 19)                                     */
#define OPAx_CAL_ATIM1OC6_Msk              (0x80000UL)               /*!< ATIM1OC6 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_ATIM1OC5_Pos              (18UL)                    /*!< ATIM1OC5 (Bit 18)                                     */
#define OPAx_CAL_ATIM1OC5_Msk              (0x40000UL)               /*!< ATIM1OC5 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_ATIM1OC4_Pos              (17UL)                    /*!< ATIM1OC4 (Bit 17)                                     */
#define OPAx_CAL_ATIM1OC4_Msk              (0x20000UL)               /*!< ATIM1OC4 (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_ATIM1TRGO_Pos             (16UL)                    /*!< ATIM1TRGO (Bit 16)                                    */
#define OPAx_CAL_ATIM1TRGO_Msk             (0x10000UL)               /*!< ATIM1TRGO (Bitfield-Mask: 0x01)                       */
#define OPAx_CAL_ADC2START1_Pos            (15UL)                    /*!< ADC2START1 (Bit 15)                                   */
#define OPAx_CAL_ADC2START1_Msk            (0x8000UL)                /*!< ADC2START1 (Bitfield-Mask: 0x01)                      */
#define OPAx_CAL_ADC1START1_Pos            (14UL)                    /*!< ADC1START1 (Bit 14)                                   */
#define OPAx_CAL_ADC1START1_Msk            (0x4000UL)                /*!< ADC1START1 (Bitfield-Mask: 0x01)                      */
#define OPAx_CAL_CLKDIV_Pos                (11UL)                    /*!< CLKDIV (Bit 11)                                       */
#define OPAx_CAL_CLKDIV_Msk                (0x3800UL)                /*!< CLKDIV (Bitfield-Mask: 0x07)                          */
#define OPAx_CAL_AZRUN_Pos                 (10UL)                    /*!< AZRUN (Bit 10)                                        */
#define OPAx_CAL_AZRUN_Msk                 (0x400UL)                 /*!< AZRUN (Bitfield-Mask: 0x01)                           */
#define OPAx_CAL_ADCSTART_Pos              (8UL)                     /*!< ADCSTART (Bit 8)                                      */
#define OPAx_CAL_ADCSTART_Msk              (0x100UL)                 /*!< ADCSTART (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_CALPERIOD_Pos             (4UL)                     /*!< CALPERIOD (Bit 4)                                     */
#define OPAx_CAL_CALPERIOD_Msk             (0xf0UL)                  /*!< CALPERIOD (Bitfield-Mask: 0x0f)                       */
#define OPAx_CAL_SOFTTRIG_Pos              (3UL)                     /*!< SOFTTRIG (Bit 3)                                      */
#define OPAx_CAL_SOFTTRIG_Msk              (0x8UL)                   /*!< SOFTTRIG (Bitfield-Mask: 0x01)                        */
#define OPAx_CAL_START_Pos                 (2UL)                     /*!< START (Bit 2)                                         */
#define OPAx_CAL_START_Msk                 (0x4UL)                   /*!< START (Bitfield-Mask: 0x01)                           */
#define OPAx_CAL_CALMODE_Pos               (1UL)                     /*!< CALMODE (Bit 1)                                       */
#define OPAx_CAL_CALMODE_Msk               (0x2UL)                   /*!< CALMODE (Bitfield-Mask: 0x01)                         */
#define OPAx_CAL_CALEN_Pos                 (0UL)                     /*!< CALEN (Bit 0)                                         */
#define OPAx_CAL_CALEN_Msk                 (0x1UL)                   /*!< CALEN (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                            RAM                                            ================ */
/* =========================================================================================================================== */

