damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* ==========================================================  CR1  ========================================================== */
#define SPIx_CR1_BR_Pos                   (24UL)                    /*!< BR (Bit 24)                                           */
#define SPIx_CR1_BR_Msk                   (0x7f000000UL)            /*!< BR (Bitfield-Mask: 0x7f)                              */
#define SPIx_CR1_SMP_Pos                  (20UL)                    /*!< SMP (Bit 20)                                          */
#define SPIx_CR1_SMP_Msk                  (0x100000UL)              /*!< SMP (Bitfield-Mask: 0x01)                             */
#define SPIx_CR1_MISOHD_Pos               (19UL)                    /*!< MISOHD (Bit 19)                                       */
#define SPIx_CR1_MISOHD_Msk               (0x80000UL)               /*!< MISOHD (Bitfield-Mask: 0x01)                          */
#define SPIx_CR1_FLTEN_Pos                (18UL)                    /*!< FLTEN (Bit 18)                                        */
#define SPIx_CR1_FLTEN_Msk                (0x40000UL)               /*!< FLTEN (Bitfield-Mask: 0x01)                           */
#define SPIx_CR1_MODE_Pos                 (16UL)                    /*!< MODE (Bit 16)                                         */
#define SPIx_CR1_MODE_Msk                 (0x30000UL)               /*!< MODE (Bitfield-Mask: 0x03)                            */
#define SPIx_CR1_GAP_Pos                  (12UL)                    /*!< GAP (Bit 12)                                          */
#define SPIx_CR1_GAP_Msk                  (0xf000UL)                /*!< GAP (Bitfield-Mask: 0x0f)                             */
#define SPIx_CR1_WIDTH_Pos                (8UL)                     /*!< WIDTH (Bit 8)                                         */
#define SPIx_CR1_WIDTH_Msk                (0xf00UL)                 /*!< WIDTH (Bitfield-Mask: 0x0f)                           */
#define SPIx_CR1_LSBF_Pos                 (7UL)                     /*!< LSBF (Bit 7)                                          */
#define SPIx_CR1_LSBF_Msk                 (0x80UL)                  /*!< LSBF (Bitfield-Mask: 0x01)                            */
#define SPIx_CR1_CPOL_Pos                 (3UL)                     /*!< CPOL (Bit 3)                                          */
#define SPIx_CR1_CPOL_Msk                 (0x8UL)                   /*!< CPOL (Bitfield-Mask: 0x01)                            */
#define SPIx_CR1_CPHA_Pos                 (2UL)                     /*!< CPHA (Bit 2)                                          */
#define SPIx_CR1_CPHA_Msk                 (0x4UL)                   /*!< CPHA (Bitfield-Mask: 0x01)                            */
#define SPIx_CR1_SSM_Pos                  (1UL)                     /*!< SSM (Bit 1)                                           */
#define SPIx_CR1_SSM_Msk                  (0x2UL)                   /*!< SSM (Bitfield-Mask: 0x01)                             */
#define SPIx_CR1_MSTR_Pos                 (0UL)                     /*!< MSTR (Bit 0)                                          */
#define SPIx_CR1_MSTR_Msk                 (0x1UL)                   /*!< MSTR (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CR2  ========================================================== */
#define SPIx_CR2_DMATX_Pos                (2UL)                     /*!< DMATX (Bit 2)                                         */
#define SPIx_CR2_DMATX_Msk                (0x4UL)                   /*!< DMATX (Bitfield-Mask: 0x01)                           */
#define SPIx_CR2_DMARX_Pos                (1UL)                     /*!< DMARX (Bit 1)                                         */
#define SPIx_CR2_DMARX_Msk                (0x2UL)                   /*!< DMARX (Bitfield-Mask: 0x01)                           */
#define SPIx_CR2_EN_Pos                   (0UL)                     /*!< EN (Bit 0)                                            */
#define SPIx_CR2_EN_Msk                   (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR3  ========================================================== */
#define SPIx_CR3_HDOE_Pos                 (0UL)                     /*!< HDOE (Bit 0)                                          */
#define SPIx_CR3_HDOE_Msk                 (0x1UL)                   /*!< HDOE (Bitfield-Mask: 0x01)                            */
/* ==========================================================  SSI  ========================================================== */
#define SPIx_SSI_SSI_Pos                  (0UL)                     /*!< SSI (Bit 0)                                           */
#define SPIx_SSI_SSI_Msk                  (0x1UL)                   /*!< SSI (Bitfield-Mask: 0x01)                             */
/* ==========================================================  IER  ========================================================== */
#define SPIx_IER_MODF_Pos                 (7UL)                     /*!< MODF (Bit 7)                                          */
#define SPIx_IER_MODF_Msk                 (0x80UL)                  /*!< MODF (Bitfield-Mask: 0x01)                            */
#define SPIx_IER_SSERR_Pos                (6UL)                     /*!< SSERR (Bit 6)                                         */
#define SPIx_IER_SSERR_Msk                (0x40UL)                  /*!< SSERR (Bitfield-Mask: 0x01)                           */
#define SPIx_IER_OV_Pos                   (5UL)                     /*!< OV (Bit 5)                                            */
#define SPIx_IER_OV_Msk                   (0x20UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define SPIx_IER_UD_Pos                   (4UL)                     /*!< UD (Bit 4)                                            */
#define SPIx_IER_UD_Msk                   (0x10UL)                  /*!< UD (Bitfield-Mask: 0x01)                              */
#define SPIx_IER_SSR_Pos                  (3UL)                     /*!< SSR (Bit 3)                                           */
#define SPIx_IER_SSR_Msk                  (0x8UL)                   /*!< SSR (Bitfield-Mask: 0x01)                             */
#define SPIx_IER_SSF_Pos                  (2UL)                     /*!< SSF (Bit 2)                                           */
#define SPIx_IER_SSF_Msk                  (0x4UL)                   /*!< SSF (Bitfield-Mask: 0x01)                             */
#define SPIx_IER_RXNE_Pos                 (1UL)                     /*!< RXNE (Bit 1)                                          */
#define SPIx_IER_RXNE_Msk                 (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define SPIx_IER_TXE_Pos                  (0UL)                     /*!< TXE (Bit 0)                                           */
#define SPIx_IER_TXE_Msk                  (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define SPIx_ISR_SSLVL_Pos                (9UL)                     /*!< SSLVL (Bit 9)                                         */
#define SPIx_ISR_SSLVL_Msk                (0x200UL)                 /*!< SSLVL (Bitfield-Mask: 0x01)                           */
#define SPIx_ISR_BUSY_Pos                 (8UL)                     /*!< BUSY (Bit 8)                                          */
#define SPIx_ISR_BUSY_Msk                 (0x100UL)                 /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define SPIx_ISR_MODF_Pos                 (7UL)                     /*!< MODF (Bit 7)                                          */
#define SPIx_ISR_MODF_Msk                 (0x80UL)                  /*!< MODF (Bitfield-Mask: 0x01)                            */
#define SPIx_ISR_SSERR_Pos                (6UL)                     /*!< SSERR (Bit 6)                                         */
#define SPIx_ISR_SSERR_Msk                (0x40UL)                  /*!< SSERR (Bitfield-Mask: 0x01)                           */
#define SPIx_ISR_OV_Pos                   (5UL)                     /*!< OV (Bit 5)                                            */
#define SPIx_ISR_OV_Msk                   (0x20UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define SPIx_ISR_UD_Pos                   (4UL)                     /*!< UD (Bit 4)                                            */
#define SPIx_ISR_UD_Msk                   (0x10UL)                  /*!< UD (Bitfield-Mask: 0x01)                              */
#define SPIx_ISR_SSR_Pos                  (3UL)                     /*!< SSR (Bit 3)                                           */
#define SPIx_ISR_SSR_Msk                  (0x8UL)                   /*!< SSR (Bitfield-Mask: 0x01)                             */
#define SPIx_ISR_SSF_Pos                  (2UL)                     /*!< SSF (Bit 2)                                           */
#define SPIx_ISR_SSF_Msk                  (0x4UL)                   /*!< SSF (Bitfield-Mask: 0x01)                             */
#define SPIx_ISR_RXNE_Pos                 (1UL)                     /*!< RXNE (Bit 1)                                          */
#define SPIx_ISR_RXNE_Msk                 (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define SPIx_ISR_TXE_Pos                  (0UL)                     /*!< TXE (Bit 0)                                           */
#define SPIx_ISR_TXE_Msk                  (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define SPIx_ICR_MODF_Pos                 (7UL)                     /*!< MODF (Bit 7)                                          */
#define SPIx_ICR_MODF_Msk                 (0x80UL)                  /*!< MODF (Bitfield-Mask: 0x01)                            */
#define SPIx_ICR_SSERR_Pos                (6UL)                     /*!< SSERR (Bit 6)                                         */
#define SPIx_ICR_SSERR_Msk                (0x40UL)                  /*!< SSERR (Bitfield-Mask: 0x01)                           */
#define SPIx_ICR_OV_Pos                   (5UL)                     /*!< OV (Bit 5)                                            */
#define SPIx_ICR_OV_Msk                   (0x20UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define SPIx_ICR_UD_Pos                   (4UL)                     /*!< UD (Bit 4)                                            */
#define SPIx_ICR_UD_Msk                   (0x10UL)                  /*!< UD (Bitfield-Mask: 0x01)                              */
#define SPIx_ICR_SSR_Pos                  (3UL)                     /*!< SSR (Bit 3)                                           */
#define SPIx_ICR_SSR_Msk                  (0x8UL)                   /*!< SSR (Bitfield-Mask: 0x01)                             */
#define SPIx_ICR_SSF_Pos                  (2UL)                     /*!< SSF (Bit 2)                                           */
#define SPIx_ICR_SSF_Msk                  (0x4UL)                   /*!< SSF (Bitfield-Mask: 0x01)                             */
#define SPIx_ICR_RXNE_Pos                 (1UL)                     /*!< RXNE (Bit 1)                                          */
#define SPIx_ICR_RXNE_Msk                 (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define SPIx_ICR_FLUSH_Pos                (0UL)                     /*!< FLUSH (Bit 0)                                         */
#define SPIx_ICR_FLUSH_Msk                (0x1UL)                   /*!< FLUSH (Bitfield-Mask: 0x01)                           */
/* ==========================================================  DR  =========================================================== */
#define SPIx_DR_DR_Pos                    (0UL)                     /*!< DR (Bit 0)                                            */
#define SPIx_DR_DR_Msk                    (0xffffUL)                /*!< DR (Bitfield-Mask: 0xffff)                            */


/* =========================================================================================================================== */
/* ================                                          SYSCTRL                                          ================ */
/* =========================================================================================================================== */

