damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
#define SYSCTRL_AHBEN_FLASH_Msk           (0x2UL)                   /*!< FLASH (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_DMA_Pos             (0UL)                     /*!< DMA (Bit 0)                                           */
#define SYSCTRL_AHBEN_DMA_Msk             (0x1UL)                   /*!< DMA (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBEN1  ========================================================= */
#define SYSCTRL_APBEN1_KEY_Pos            (16UL)                    /*!< KEY (Bit 16)                                          */
#define SYSCTRL_APBEN1_KEY_Msk            (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_APBEN1_SPI3_Pos           (14UL)                    /*!< SPI3 (Bit 14)                                         */
#define SYSCTRL_APBEN1_SPI3_Msk           (0x4000UL)                /*!< SPI3 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_SPI2_Pos           (13UL)                    /*!< SPI2 (Bit 13)                                         */
#define SYSCTRL_APBEN1_SPI2_Msk           (0x2000UL)                /*!< SPI2 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_GTIM4_Pos          (12UL)                    /*!< GTIM4 (Bit 12)                                        */
#define SYSCTRL_APBEN1_GTIM4_Msk          (0x1000UL)                /*!< GTIM4 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_GTIM3_Pos          (11UL)                    /*!< GTIM3 (Bit 11)                                        */
#define SYSCTRL_APBEN1_GTIM3_Msk          (0x800UL)                 /*!< GTIM3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_UART3_Pos          (8UL)                     /*!< UART3 (Bit 8)                                         */
#define SYSCTRL_APBEN1_UART3_Msk          (0x100UL)                 /*!< UART3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_GTIM2_Pos          (7UL)                     /*!< GTIM2 (Bit 7)                                         */
#define SYSCTRL_APBEN1_GTIM2_Msk          (0x80UL)                  /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_GTIM1_Pos          (6UL)                     /*!< GTIM1 (Bit 6)                                         */
#define SYSCTRL_APBEN1_GTIM1_Msk          (0x40UL)                  /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_ATIM_Pos           (5UL)                     /*!< ATIM (Bit 5)                                          */
#define SYSCTRL_APBEN1_ATIM_Msk           (0x20UL)                  /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_UART2_Pos          (4UL)                     /*!< UART2 (Bit 4)                                         */
#define SYSCTRL_APBEN1_UART2_Msk          (0x10UL)                  /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_UART1_Pos          (3UL)                     /*!< UART1 (Bit 3)                                         */
#define SYSCTRL_APBEN1_UART1_Msk          (0x8UL)                   /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_SPI1_Pos           (2UL)                     /*!< SPI1 (Bit 2)                                          */
#define SYSCTRL_APBEN1_SPI1_Msk           (0x4UL)                   /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_VC_Pos             (1UL)                     /*!< VC (Bit 1)                                            */
#define SYSCTRL_APBEN1_VC_Msk             (0x2UL)                   /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBEN1_ADC_Pos            (0UL)                     /*!< ADC (Bit 0)                                           */
#define SYSCTRL_APBEN1_ADC_Msk            (0x1UL)                   /*!< ADC (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBEN2  ========================================================= */
#define SYSCTRL_APBEN2_KEY_Pos            (16UL)                    /*!< KEY (Bit 16)                                          */
#define SYSCTRL_APBEN2_KEY_Msk            (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_APBEN2_HALLTIM_Pos        (12UL)                    /*!< HALLTIM (Bit 12)                                      */
#define SYSCTRL_APBEN2_HALLTIM_Msk        (0x1000UL)                /*!< HALLTIM (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_APBEN2_I2C2_Pos           (11UL)                    /*!< I2C2 (Bit 11)                                         */
#define SYSCTRL_APBEN2_I2C2_Msk           (0x800UL)                 /*!< I2C2 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_DAC_Pos            (10UL)                    /*!< DAC (Bit 10)                                          */
#define SYSCTRL_APBEN2_DAC_Msk            (0x400UL)                 /*!< DAC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBEN2_OPA_Pos            (9UL)                     /*!< OPA (Bit 9)                                           */
#define SYSCTRL_APBEN2_OPA_Msk            (0x200UL)                 /*!< OPA (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBEN2_LPTIM_Pos          (7UL)                     /*!< LPTIM (Bit 7)                                         */
#define SYSCTRL_APBEN2_LPTIM_Msk          (0x80UL)                  /*!< LPTIM (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN2_I2C1_Pos           (6UL)                     /*!< I2C1 (Bit 6)                                          */
#define SYSCTRL_APBEN2_I2C1_Msk           (0x40UL)                  /*!< I2C1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_WWDT_Pos           (5UL)                     /*!< WWDT (Bit 5)                                          */
#define SYSCTRL_APBEN2_WWDT_Msk           (0x20UL)                  /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_IWDT_Pos           (4UL)                     /*!< IWDT (Bit 4)                                          */
#define SYSCTRL_APBEN2_IWDT_Msk           (0x10UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_BTIM123_Pos        (2UL)                     /*!< BTIM123 (Bit 2)                                       */
#define SYSCTRL_APBEN2_BTIM123_Msk        (0x4UL)                   /*!< BTIM123 (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_APBEN2_RTC_Pos            (1UL)                     /*!< RTC (Bit 1)                                           */
#define SYSCTRL_APBEN2_RTC_Msk            (0x2UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */
/* ========================================================  AHBRST  ========================================================= */
#define SYSCTRL_AHBRST_CORDIC_Pos         (8UL)                     /*!< CORDIC (Bit 8)                                        */
#define SYSCTRL_AHBRST_CORDIC_Msk         (0x100UL)                 /*!< CORDIC (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_AHBRST_GPIOF_Pos          (7UL)                     /*!< GPIOF (Bit 7)                                         */
#define SYSCTRL_AHBRST_GPIOF_Msk          (0x80UL)                  /*!< GPIOF (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOC_Pos          (6UL)                     /*!< GPIOC (Bit 6)                                         */
#define SYSCTRL_AHBRST_GPIOC_Msk          (0x40UL)                  /*!< GPIOC (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOB_Pos          (5UL)                     /*!< GPIOB (Bit 5)                                         */
#define SYSCTRL_AHBRST_GPIOB_Msk          (0x20UL)                  /*!< GPIOB (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOA_Pos          (4UL)                     /*!< GPIOA (Bit 4)                                         */
#define SYSCTRL_AHBRST_GPIOA_Msk          (0x10UL)                  /*!< GPIOA (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_EAU_Pos            (3UL)                     /*!< EAU (Bit 3)                                           */
#define SYSCTRL_AHBRST_EAU_Msk            (0x8UL)                   /*!< EAU (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_AHBRST_CRC_Pos            (2UL)                     /*!< CRC (Bit 2)                                           */
#define SYSCTRL_AHBRST_CRC_Msk            (0x4UL)                   /*!< CRC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_AHBRST_FLASH_Pos          (1UL)                     /*!< FLASH (Bit 1)                                         */
#define SYSCTRL_AHBRST_FLASH_Msk          (0x2UL)                   /*!< FLASH (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_DMA_Pos            (0UL)                     /*!< DMA (Bit 0)                                           */
#define SYSCTRL_AHBRST_DMA_Msk            (0x1UL)                   /*!< DMA (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBRST1  ======================================================== */
#define SYSCTRL_APBRST1_SPI3_Pos          (14UL)                    /*!< SPI3 (Bit 14)                                         */
#define SYSCTRL_APBRST1_SPI3_Msk          (0x4000UL)                /*!< SPI3 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_SPI2_Pos          (13UL)                    /*!< SPI2 (Bit 13)                                         */
#define SYSCTRL_APBRST1_SPI2_Msk          (0x2000UL)                /*!< SPI2 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_GTIM4_Pos         (12UL)                    /*!< GTIM4 (Bit 12)                                        */
#define SYSCTRL_APBRST1_GTIM4_Msk         (0x1000UL)                /*!< GTIM4 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_GTIM3_Pos         (11UL)                    /*!< GTIM3 (Bit 11)                                        */
#define SYSCTRL_APBRST1_GTIM3_Msk         (0x800UL)                 /*!< GTIM3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_UART3_Pos         (8UL)                     /*!< UART3 (Bit 8)                                         */
#define SYSCTRL_APBRST1_UART3_Msk         (0x100UL)                 /*!< UART3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_GTIM2_Pos         (7UL)                     /*!< GTIM2 (Bit 7)                                         */
#define SYSCTRL_APBRST1_GTIM2_Msk         (0x80UL)                  /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_GTIM1_Pos         (6UL)                     /*!< GTIM1 (Bit 6)                                         */
#define SYSCTRL_APBRST1_GTIM1_Msk         (0x40UL)                  /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_ATIM_Pos          (5UL)                     /*!< ATIM (Bit 5)                                          */
#define SYSCTRL_APBRST1_ATIM_Msk          (0x20UL)                  /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_UART2_Pos         (4UL)                     /*!< UART2 (Bit 4)                                         */
#define SYSCTRL_APBRST1_UART2_Msk         (0x10UL)                  /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_UART1_Pos         (3UL)                     /*!< UART1 (Bit 3)                                         */
#define SYSCTRL_APBRST1_UART1_Msk         (0x8UL)                   /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_SPI1_Pos          (2UL)                     /*!< SPI1 (Bit 2)                                          */
#define SYSCTRL_APBRST1_SPI1_Msk          (0x4UL)                   /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_VC_Pos            (1UL)                     /*!< VC (Bit 1)                                            */
#define SYSCTRL_APBRST1_VC_Msk            (0x2UL)                   /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBRST1_ADC_Pos           (0UL)                     /*!< ADC (Bit 0)                                           */
#define SYSCTRL_APBRST1_ADC_Msk           (0x1UL)                   /*!< ADC (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBRST2  ======================================================== */
#define SYSCTRL_APBRST2_HALLTIM_Pos       (12UL)                    /*!< HALLTIM (Bit 12)                                      */
#define SYSCTRL_APBRST2_HALLTIM_Msk       (0x1000UL)                /*!< HALLTIM (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_APBRST2_I2C2_Pos          (11UL)                    /*!< I2C2 (Bit 11)                                         */
#define SYSCTRL_APBRST2_I2C2_Msk          (0x800UL)                 /*!< I2C2 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_DAC_Pos           (10UL)                    /*!< DAC (Bit 10)                                          */
#define SYSCTRL_APBRST2_DAC_Msk           (0x400UL)                 /*!< DAC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBRST2_OPA_Pos           (9UL)                     /*!< OPA (Bit 9)                                           */
#define SYSCTRL_APBRST2_OPA_Msk           (0x200UL)                 /*!< OPA (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBRST2_LPTIM_Pos         (7UL)                     /*!< LPTIM (Bit 7)                                         */
#define SYSCTRL_APBRST2_LPTIM_Msk         (0x80UL)                  /*!< LPTIM (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST2_I2C1_Pos          (6UL)                     /*!< I2C1 (Bit 6)                                          */
#define SYSCTRL_APBRST2_I2C1_Msk          (0x40UL)                  /*!< I2C1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_WWDT_Pos          (5UL)                     /*!< WWDT (Bit 5)                                          */
#define SYSCTRL_APBRST2_WWDT_Msk          (0x20UL)                  /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_IWDT_Pos          (4UL)                     /*!< IWDT (Bit 4)                                          */
#define SYSCTRL_APBRST2_IWDT_Msk          (0x10UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_BTIM123_Pos       (2UL)                     /*!< BTIM123 (Bit 2)                                       */
#define SYSCTRL_APBRST2_BTIM123_Msk       (0x4UL)                   /*!< BTIM123 (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_APBRST2_RTC_Pos           (1UL)                     /*!< RTC (Bit 1)                                           */
#define SYSCTRL_APBRST2_RTC_Msk           (0x2UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */
/* =======================================================  RESETFLAG  ======================================================= */
#define SYSCTRL_RESETFLAG_SYSRESETREQ_Pos (9UL)                     /*!< SYSRESETREQ (Bit 9)                                   */
#define SYSCTRL_RESETFLAG_SYSRESETREQ_Msk (0x200UL)                 /*!< SYSRESETREQ (Bitfield-Mask: 0x01)                     */
#define SYSCTRL_RESETFLAG_LOCKUP_Pos      (8UL)                     /*!< LOCKUP (Bit 8)                                        */
#define SYSCTRL_RESETFLAG_LOCKUP_Msk      (0x100UL)                 /*!< LOCKUP (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_RESETFLAG_RSTB_Pos        (6UL)                     /*!< RSTB (Bit 6)                                          */
#define SYSCTRL_RESETFLAG_RSTB_Msk        (0x40UL)                  /*!< RSTB (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_WWDT_Pos        (5UL)                     /*!< WWDT (Bit 5)                                          */
#define SYSCTRL_RESETFLAG_WWDT_Msk        (0x20UL)                  /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_IWDT_Pos        (4UL)                     /*!< IWDT (Bit 4)                                          */
#define SYSCTRL_RESETFLAG_IWDT_Msk        (0x10UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_LVD_Pos         (3UL)                     /*!< LVD (Bit 3)                                           */
#define SYSCTRL_RESETFLAG_LVD_Msk         (0x8UL)                   /*!< LVD (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_RESETFLAG_POR_Pos         (0UL)                     /*!< POR (Bit 0)                                           */
#define SYSCTRL_RESETFLAG_POR_Msk         (0x1UL)                   /*!< POR (Bitfield-Mask: 0x01)                             */
/* =========================================================  DEBUG  ========================================================= */
#define SYSCTRL_DEBUG_HALLTIM_Pos         (11UL)                    /*!< HALLTIM (Bit 11)                                      */
#define SYSCTRL_DEBUG_HALLTIM_Msk         (0x800UL)                 /*!< HALLTIM (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_DEBUG_WWDT_Pos            (10UL)                    /*!< WWDT (Bit 10)                                         */
#define SYSCTRL_DEBUG_WWDT_Msk            (0x400UL)                 /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_DEBUG_IWDT_Pos            (9UL)                     /*!< IWDT (Bit 9)                                          */
#define SYSCTRL_DEBUG_IWDT_Msk            (0x200UL)                 /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_DEBUG_RTC_Pos             (8UL)                     /*!< RTC (Bit 8)                                           */
#define SYSCTRL_DEBUG_RTC_Msk             (0x100UL)                 /*!< RTC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_DEBUG_LPTIM_Pos           (6UL)                     /*!< LPTIM (Bit 6)                                         */
#define SYSCTRL_DEBUG_LPTIM_Msk           (0x40UL)                  /*!< LPTIM (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_BTIM123_Pos         (5UL)                     /*!< BTIM123 (Bit 5)                                       */
#define SYSCTRL_DEBUG_BTIM123_Msk         (0x20UL)                  /*!< BTIM123 (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_DEBUG_GTIM4_Pos           (4UL)                     /*!< GTIM4 (Bit 4)                                         */
#define SYSCTRL_DEBUG_GTIM4_Msk           (0x10UL)                  /*!< GTIM4 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_GTIM3_Pos           (3UL)                     /*!< GTIM3 (Bit 3)                                         */
#define SYSCTRL_DEBUG_GTIM3_Msk           (0x8UL)                   /*!< GTIM3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_GTIM2_Pos           (2UL)                     /*!< GTIM2 (Bit 2)                                         */
#define SYSCTRL_DEBUG_GTIM2_Msk           (0x4UL)                   /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_GTIM1_Pos           (1UL)                     /*!< GTIM1 (Bit 1)                                         */
#define SYSCTRL_DEBUG_GTIM1_Msk           (0x2UL)                   /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_ATIM_Pos            (0UL)                     /*!< ATIM (Bit 0)                                          */
#define SYSCTRL_DEBUG_ATIM_Msk            (0x1UL)                   /*!< ATIM (Bitfield-Mask: 0x01)                            */
/* ==========================================================  MCO  ========================================================== */
#define SYSCTRL_MCO_DIV_Pos               (4UL)                     /*!< DIV (Bit 4)                                           */
#define SYSCTRL_MCO_DIV_Msk               (0xf0UL)                  /*!< DIV (Bitfield-Mask: 0x0f)                             */
#define SYSCTRL_MCO_SOURCE_Pos            (0UL)                     /*!< SOURCE (Bit 0)                                        */
#define SYSCTRL_MCO_SOURCE_Msk            (0xfUL)                   /*!< SOURCE (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  PLL  ========================================================== */
#define SYSCTRL_PLL_STABLE_Pos            (16UL)                    /*!< STABLE (Bit 16)                                       */
#define SYSCTRL_PLL_STABLE_Msk            (0x10000UL)               /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_PLL_MUL_Pos               (8UL)                     /*!< MUL (Bit 8)                                           */
#define SYSCTRL_PLL_MUL_Msk               (0xff00UL)                /*!< MUL (Bitfield-Mask: 0xff)                             */
#define SYSCTRL_PLL_WAITCYCLE_Pos         (5UL)                     /*!< WAITCYCLE (Bit 5)                                     */
#define SYSCTRL_PLL_WAITCYCLE_Msk         (0xe0UL)                  /*!< WAITCYCLE (Bitfield-Mask: 0x07)                       */
#define SYSCTRL_PLL_DIV_Pos               (1UL)                     /*!< DIV (Bit 1)                                           */
#define SYSCTRL_PLL_DIV_Msk               (0x1eUL)                  /*!< DIV (Bitfield-Mask: 0x0f)                             */
#define SYSCTRL_PLL_SOURCE_Pos            (0UL)                     /*!< SOURCE (Bit 0)                                        */
#define SYSCTRL_PLL_SOURCE_Msk            (0x1UL)                   /*!< SOURCE (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                            VC                                             ================ */
/* =========================================================================================================================== */

