damowuhe/cw32l012_hal_cmake/Drivers/CMSIS/cw32l012/inc/cw32l012.h
/* ==========================================================  CR0  ========================================================== */
#define VCx_CR0_INP_Pos                   (12UL)                    /*!< INP (Bit 12)                                          */
#define VCx_CR0_INP_Msk                   (0x3000UL)                /*!< INP (Bitfield-Mask: 0x03)                             */
#define VCx_CR0_INN_Pos                   (8UL)                     /*!< INN (Bit 8)                                           */
#define VCx_CR0_INN_Msk                   (0x300UL)                 /*!< INN (Bitfield-Mask: 0x03)                             */
#define VCx_CR0_WINDOW_Pos                (7UL)                     /*!< WINDOW (Bit 7)                                        */
#define VCx_CR0_WINDOW_Msk                (0x80UL)                  /*!< WINDOW (Bitfield-Mask: 0x01)                          */
#define VCx_CR0_POL_Pos                   (6UL)                     /*!< POL (Bit 6)                                           */
#define VCx_CR0_POL_Msk                   (0x40UL)                  /*!< POL (Bitfield-Mask: 0x01)                             */
#define VCx_CR0_IE_Pos                    (5UL)                     /*!< IE (Bit 5)                                            */
#define VCx_CR0_IE_Msk                    (0x20UL)                  /*!< IE (Bitfield-Mask: 0x01)                              */
#define VCx_CR0_HYS_Pos                   (3UL)                     /*!< HYS (Bit 3)                                           */
#define VCx_CR0_HYS_Msk                   (0x8UL)                   /*!< HYS (Bitfield-Mask: 0x01)                             */
#define VCx_CR0_RESP_Pos                  (1UL)                     /*!< RESP (Bit 1)                                          */
#define VCx_CR0_RESP_Msk                  (0x2UL)                   /*!< RESP (Bitfield-Mask: 0x01)                            */
#define VCx_CR0_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define VCx_CR0_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR1  ========================================================== */
#define VCx_CR1_BLANKLVL_Pos              (11UL)                    /*!< BLANKLVL (Bit 11)                                     */
#define VCx_CR1_BLANKLVL_Msk              (0x800UL)                 /*!< BLANKLVL (Bitfield-Mask: 0x01)                        */
#define VCx_CR1_BLANKTIME_Pos             (8UL)                     /*!< BLANKTIME (Bit 8)                                     */
#define VCx_CR1_BLANKTIME_Msk             (0x700UL)                 /*!< BLANKTIME (Bitfield-Mask: 0x07)                       */
#define VCx_CR1_HIGHIE_Pos                (7UL)                     /*!< HIGHIE (Bit 7)                                        */
#define VCx_CR1_HIGHIE_Msk                (0x80UL)                  /*!< HIGHIE (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_RISEIE_Pos                (6UL)                     /*!< RISEIE (Bit 6)                                        */
#define VCx_CR1_RISEIE_Msk                (0x40UL)                  /*!< RISEIE (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_FALLIE_Pos                (5UL)                     /*!< FALLIE (Bit 5)                                        */
#define VCx_CR1_FALLIE_Msk                (0x20UL)                  /*!< FALLIE (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_FLTCLK_Pos                (4UL)                     /*!< FLTCLK (Bit 4)                                        */
#define VCx_CR1_FLTCLK_Msk                (0x10UL)                  /*!< FLTCLK (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_FLTTIME_Pos               (0UL)                     /*!< FLTTIME (Bit 0)                                       */
#define VCx_CR1_FLTTIME_Msk               (0xfUL)                   /*!< FLTTIME (Bitfield-Mask: 0x0f)                         */
/* ==========================================================  CR2  ========================================================== */
#define VCx_CR2_HALLTIM1TRGO_Pos          (31UL)                    /*!< HALLTIM1TRGO (Bit 31)                                 */
#define VCx_CR2_HALLTIM1TRGO_Msk          (0x80000000UL)            /*!< HALLTIM1TRGO (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_BTIM3TRGO_Pos             (30UL)                    /*!< BTIM3TRGO (Bit 30)                                    */
#define VCx_CR2_BTIM3TRGO_Msk             (0x40000000UL)            /*!< BTIM3TRGO (Bitfield-Mask: 0x01)                       */
#define VCx_CR2_BTIM2TRGO_Pos             (29UL)                    /*!< BTIM2TRGO (Bit 29)                                    */
#define VCx_CR2_BTIM2TRGO_Msk             (0x20000000UL)            /*!< BTIM2TRGO (Bitfield-Mask: 0x01)                       */
#define VCx_CR2_BTIM1TRGO_Pos             (28UL)                    /*!< BTIM1TRGO (Bit 28)                                    */
#define VCx_CR2_BTIM1TRGO_Msk             (0x10000000UL)            /*!< BTIM1TRGO (Bitfield-Mask: 0x01)                       */
#define VCx_CR2_GTIM4OC4REFC_Pos          (27UL)                    /*!< GTIM4OC4REFC (Bit 27)                                 */
#define VCx_CR2_GTIM4OC4REFC_Msk          (0x8000000UL)             /*!< GTIM4OC4REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM4OC3REFC_Pos          (26UL)                    /*!< GTIM4OC3REFC (Bit 26)                                 */
#define VCx_CR2_GTIM4OC3REFC_Msk          (0x4000000UL)             /*!< GTIM4OC3REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM4OC2REFC_Pos          (25UL)                    /*!< GTIM4OC2REFC (Bit 25)                                 */
#define VCx_CR2_GTIM4OC2REFC_Msk          (0x2000000UL)             /*!< GTIM4OC2REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM4OC1REFC_Pos          (24UL)                    /*!< GTIM4OC1REFC (Bit 24)                                 */
#define VCx_CR2_GTIM4OC1REFC_Msk          (0x1000000UL)             /*!< GTIM4OC1REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM4TRGO_Pos             (23UL)                    /*!< GTIM4TRGO (Bit 23)                                    */
#define VCx_CR2_GTIM4TRGO_Msk             (0x800000UL)              /*!< GTIM4TRGO (Bitfield-Mask: 0x01)                       */
#define VCx_CR2_GTIM3OC4REFC_Pos          (22UL)                    /*!< GTIM3OC4REFC (Bit 22)                                 */
#define VCx_CR2_GTIM3OC4REFC_Msk          (0x400000UL)              /*!< GTIM3OC4REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM3OC3REFC_Pos          (21UL)                    /*!< GTIM3OC3REFC (Bit 21)                                 */
#define VCx_CR2_GTIM3OC3REFC_Msk          (0x200000UL)              /*!< GTIM3OC3REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM3OC2REFC_Pos          (20UL)                    /*!< GTIM3OC2REFC (Bit 20)                                 */
#define VCx_CR2_GTIM3OC2REFC_Msk          (0x100000UL)              /*!< GTIM3OC2REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM3OC1REFC_Pos          (19UL)                    /*!< GTIM3OC1REFC (Bit 19)                                 */
#define VCx_CR2_GTIM3OC1REFC_Msk          (0x80000UL)               /*!< GTIM3OC1REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM3TRGO_Pos             (18UL)                    /*!< GTIM3TRGO (Bit 18)                                    */
#define VCx_CR2_GTIM3TRGO_Msk             (0x40000UL)               /*!< GTIM3TRGO (Bitfield-Mask: 0x01)                       */
#define VCx_CR2_GTIM2OC4REFC_Pos          (17UL)                    /*!< GTIM2OC4REFC (Bit 17)                                 */
#define VCx_CR2_GTIM2OC4REFC_Msk          (0x20000UL)               /*!< GTIM2OC4REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM2OC3REFC_Pos          (16UL)                    /*!< GTIM2OC3REFC (Bit 16)                                 */
#define VCx_CR2_GTIM2OC3REFC_Msk          (0x10000UL)               /*!< GTIM2OC3REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM2OC2REFC_Pos          (15UL)                    /*!< GTIM2OC2REFC (Bit 15)                                 */
#define VCx_CR2_GTIM2OC2REFC_Msk          (0x8000UL)                /*!< GTIM2OC2REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM2OC1REFC_Pos          (14UL)                    /*!< GTIM2OC1REFC (Bit 14)                                 */
#define VCx_CR2_GTIM2OC1REFC_Msk          (0x4000UL)                /*!< GTIM2OC1REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM2TRGO_Pos             (13UL)                    /*!< GTIM2TRGO (Bit 13)                                    */
#define VCx_CR2_GTIM2TRGO_Msk             (0x2000UL)                /*!< GTIM2TRGO (Bitfield-Mask: 0x01)                       */
#define VCx_CR2_GTIM1OC4REFC_Pos          (12UL)                    /*!< GTIM1OC4REFC (Bit 12)                                 */
#define VCx_CR2_GTIM1OC4REFC_Msk          (0x1000UL)                /*!< GTIM1OC4REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM1OC3REFC_Pos          (11UL)                    /*!< GTIM1OC3REFC (Bit 11)                                 */
#define VCx_CR2_GTIM1OC3REFC_Msk          (0x800UL)                 /*!< GTIM1OC3REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM1OC2REFC_Pos          (10UL)                    /*!< GTIM1OC2REFC (Bit 10)                                 */
#define VCx_CR2_GTIM1OC2REFC_Msk          (0x400UL)                 /*!< GTIM1OC2REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM1OC1REFC_Pos          (9UL)                     /*!< GTIM1OC1REFC (Bit 9)                                  */
#define VCx_CR2_GTIM1OC1REFC_Msk          (0x200UL)                 /*!< GTIM1OC1REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_GTIM1TRGO_Pos             (8UL)                     /*!< GTIM1TRGO (Bit 8)                                     */
#define VCx_CR2_GTIM1TRGO_Msk             (0x100UL)                 /*!< GTIM1TRGO (Bitfield-Mask: 0x01)                       */
#define VCx_CR2_ATIMOC6REFC_Pos           (7UL)                     /*!< ATIM1OC6REFC (Bit 7)                                  */
#define VCx_CR2_ATIMOC6REFC_Msk           (0x80UL)                  /*!< ATIM1OC6REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_ATIMOC5REFC_Pos           (6UL)                     /*!< ATIM1OC5REFC (Bit 6)                                  */
#define VCx_CR2_ATIMOC5REFC_Msk           (0x40UL)                  /*!< ATIM1OC5REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_ATIMOC4REFC_Pos           (5UL)                     /*!< ATIM1OC4REFC (Bit 5)                                  */
#define VCx_CR2_ATIMOC4REFC_Msk           (0x20UL)                  /*!< ATIM1OC4REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_ATIMOC3REFC_Pos           (4UL)                     /*!< ATIM1OC3REFC (Bit 4)                                  */
#define VCx_CR2_ATIMOC3REFC_Msk           (0x10UL)                  /*!< ATIM1OC3REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_ATIMOC2REFC_Pos           (3UL)                     /*!< ATIM1OC2REFC (Bit 3)                                  */
#define VCx_CR2_ATIMOC2REFC_Msk           (0x8UL)                   /*!< ATIM1OC2REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_ATIMOC1REFC_Pos           (2UL)                     /*!< ATIM1OC1REFC (Bit 2)                                  */
#define VCx_CR2_ATIMOC1REFC_Msk           (0x4UL)                   /*!< ATIM1OC1REFC (Bitfield-Mask: 0x01)                    */
#define VCx_CR2_ATIMTRGO2_Pos             (1UL)                     /*!< ATIM1TRGO2 (Bit 1)                                    */
#define VCx_CR2_ATIMTRGO2_Msk             (0x2UL)                   /*!< ATIM1TRGO2 (Bitfield-Mask: 0x01)                      */
#define VCx_CR2_ATIMTRGO_Pos              (0UL)                     /*!< ATIM1TRGO (Bit 0)                                     */
#define VCx_CR2_ATIMTRGO_Msk              (0x1UL)                   /*!< ATIM1TRGO (Bitfield-Mask: 0x01)                       */
/* ==========================================================  SR  =========================================================== */
#define VCx_SR_FLTV_Pos                   (1UL)                     /*!< FLTV (Bit 1)                                          */
#define VCx_SR_FLTV_Msk                   (0x2UL)                   /*!< FLTV (Bitfield-Mask: 0x01)                            */
#define VCx_SR_INTF_Pos                   (0UL)                     /*!< INTF (Bit 0)                                          */
#define VCx_SR_INTF_Msk                   (0x1UL)                   /*!< INTF (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                          VCREF                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  DIV  ========================================================== */
#define VC12REF_DIV_VIN_Pos               (5UL)                     /*!< VIN (Bit 5)                                           */
#define VC12REF_DIV_VIN_Msk               (0x20UL)                  /*!< VIN (Bitfield-Mask: 0x01)                             */
#define VC12REF_DIV_EN_Pos                (4UL)                     /*!< EN (Bit 4)                                            */
#define VC12REF_DIV_EN_Msk                (0x10UL)                  /*!< EN (Bitfield-Mask: 0x01)                              */
#define VC12REF_DIV_DIV_Pos               (0UL)                     /*!< DIV (Bit 0)                                           */
#define VC12REF_DIV_DIV_Msk               (0x7UL)                   /*!< DIV (Bitfield-Mask: 0x07)                             */


/* =========================================================================================================================== */
/* ================                                           WWDT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR0  ========================================================== */
#define WWDT_CR0_EN_Pos                   (7UL)                     /*!< EN (Bit 7)                                            */
#define WWDT_CR0_EN_Msk                   (0x80UL)                  /*!< EN (Bitfield-Mask: 0x01)                              */
#define WWDT_CR0_WCNT_Pos                 (0UL)                     /*!< WCNT (Bit 0)                                          */
#define WWDT_CR0_WCNT_Msk                 (0x7fUL)                  /*!< WCNT (Bitfield-Mask: 0x7f)                            */
/* ==========================================================  CR1  ========================================================== */
#define WWDT_CR1_IE_Pos                   (10UL)                    /*!< IE (Bit 10)                                           */
#define WWDT_CR1_IE_Msk                   (0x400UL)                 /*!< IE (Bitfield-Mask: 0x01)                              */
#define WWDT_CR1_PRS_Pos                  (7UL)                     /*!< PRS (Bit 7)                                           */
#define WWDT_CR1_PRS_Msk                  (0x380UL)                 /*!< PRS (Bitfield-Mask: 0x07)                             */
#define WWDT_CR1_WINR_Pos                 (0UL)                     /*!< WINR (Bit 0)                                          */
#define WWDT_CR1_WINR_Msk                 (0x7fUL)                  /*!< WINR (Bitfield-Mask: 0x7f)                            */
/* ==========================================================  SR  =========================================================== */
#define WWDT_SR_POV_Pos                   (0UL)                     /*!< POV (Bit 0)                                           */
#define WWDT_SR_POV_Msk                   (0x1UL)                   /*!< POV (Bitfield-Mask: 0x01)                             */

/** @} */ /* End of group PosMask_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* __CW32L012_H */


/** @} */ /* End of group cw32l012 */

